{"name_ar": "سورة هود", "ayahs_ar": ["الَر كِتَابٌ أُحْكِمَتْ آيَاتُهُ ثُمَّ فُصِّلَتْ مِن لَّدُنْ حَكِيمٍ خَبِيرٍ", "أَلاَّ تَعْبُدُواْ إِلاَّ اللّهَ إِنَّنِي لَكُم مِّنْهُ نَذِيرٌ وَبَشِيرٌ", "وَأَنِ اسْتَغْفِرُواْ رَبَّكُمْ ثُمَّ تُوبُواْ إِلَيْهِ يُمَتِّعْكُم مَّتَاعًا حَسَنًا إِلَى أَجَلٍ مُّسَمًّى وَيُؤْتِ كُلَّ ذِي فَضْلٍ فَضْلَهُ وَإِن تَوَلَّوْاْ فَإِنِّيَ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ كَبِيرٍ", "إِلَى اللّهِ مَرْجِعُكُمْ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ", "أَلا إِنَّهُمْ يَثْنُونَ صُدُورَهُمْ لِيَسْتَخْفُواْ مِنْهُ أَلا حِينَ يَسْتَغْشُونَ ثِيَابَهُمْ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ", "وَمَا مِن دَآبَّةٍ فِي الأَرْضِ إِلاَّ عَلَى اللّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا كُلٌّ فِي كِتَابٍ مُّبِينٍ", "وَهُوَ الَّذِي خَلَق السَّمَاوَاتِ وَالأَرْضَ فِي سِتَّةِ أَيَّامٍ وَكَانَ عَرْشُهُ عَلَى الْمَاء لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلاً وَلَئِن قُلْتَ إِنَّكُم مَّبْعُوثُونَ مِن بَعْدِ الْمَوْتِ لَيَقُولَنَّ الَّذِينَ كَفَرُواْ إِنْ هَـذَا إِلاَّ سِحْرٌ مُّبِينٌ", "وَلَئِنْ أَخَّرْنَا عَنْهُمُ الْعَذَابَ إِلَى أُمَّةٍ مَّعْدُودَةٍ لَّيَقُولُنَّ مَا يَحْبِسُهُ أَلاَ يَوْمَ يَأْتِيهِمْ لَيْسَ مَصْرُوفًا عَنْهُمْ وَحَاقَ بِهِم مَّا كَانُواْ بِهِ يَسْتَهْزِؤُونَ", "وَلَئِنْ أَذَقْنَا الإِنْسَانَ مِنَّا رَحْمَةً ثُمَّ نَزَعْنَاهَا مِنْهُ إِنَّهُ لَيَئُوسٌ كَفُورٌ", "وَلَئِنْ أَذَقْنَاهُ نَعْمَاء بَعْدَ ضَرَّاء مَسَّتْهُ لَيَقُولَنَّ ذَهَبَ السَّيِّئَاتُ عَنِّي إِنَّهُ لَفَرِحٌ فَخُورٌ", "إِلاَّ الَّذِينَ صَبَرُواْ وَعَمِلُواْ الصَّالِحَاتِ أُوْلَـئِكَ لَهُم مَّغْفِرَةٌ وَأَجْرٌ كَبِيرٌ", "فَلَعَلَّكَ تَارِكٌ بَعْضَ مَا يُوحَى إِلَيْكَ وَضَآئِقٌ بِهِ صَدْرُكَ أَن يَقُولُواْ لَوْلاَ أُنزِلَ عَلَيْهِ كَنزٌ أَوْ جَاء مَعَهُ مَلَكٌ إِنَّمَا أَنتَ نَذِيرٌ وَاللّهُ عَلَى كُلِّ شَيْءٍ وَكِيلٌ", "أَمْ يَقُولُونَ افْتَرَاهُ قُلْ فَأْتُواْ بِعَشْرِ سُوَرٍ مِّثْلِهِ مُفْتَرَيَاتٍ وَادْعُواْ مَنِ اسْتَطَعْتُم مِّن دُونِ اللّهِ إِن كُنتُمْ صَادِقِينَ", "فَإِن لَّمْ يَسْتَجِيبُواْ لَكُمْ فَاعْلَمُواْ أَنَّمَا أُنزِلِ بِعِلْمِ اللّهِ وَأَن لاَّ إِلَـهَ إِلاَّ هُوَ فَهَلْ أَنتُم مُّسْلِمُونَ", "مَن كَانَ يُرِيدُ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا نُوَفِّ إِلَيْهِمْ أَعْمَالَهُمْ فِيهَا وَهُمْ فِيهَا لاَ يُبْخَسُونَ", "أُوْلَـئِكَ الَّذِينَ لَيْسَ لَهُمْ فِي الآخِرَةِ إِلاَّ النَّارُ وَحَبِطَ مَا صَنَعُواْ فِيهَا وَبَاطِلٌ مَّا كَانُواْ يَعْمَلُونَ", "أَفَمَن كَانَ عَلَى بَيِّنَةٍ مِّن رَّبِّهِ وَيَتْلُوهُ شَاهِدٌ مِّنْهُ وَمِن قَبْلِهِ كِتَابُ مُوسَى إَمَامًا وَرَحْمَةً أُوْلَـئِكَ يُؤْمِنُونَ بِهِ وَمَن يَكْفُرْ بِهِ مِنَ الأَحْزَابِ فَالنَّارُ مَوْعِدُهُ فَلاَ تَكُ فِي مِرْيَةٍ مِّنْهُ إِنَّهُ الْحَقُّ مِن رَّبِّكَ وَلَـكِنَّ أَكْثَرَ النَّاسِ لاَ يُؤْمِنُونَ", "وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَى عَلَى اللّهِ كَذِبًا أُوْلَـئِكَ يُعْرَضُونَ عَلَى رَبِّهِمْ وَيَقُولُ الأَشْهَادُ هَـؤُلاء الَّذِينَ كَذَبُواْ عَلَى رَبِّهِمْ أَلاَ لَعْنَةُ اللّهِ عَلَى الظَّالِمِينَ", "الَّذِينَ يَصُدُّونَ عَن سَبِيلِ اللّهِ وَيَبْغُونَهَا عِوَجًا وَهُم بِالآخِرَةِ هُمْ كَافِرُونَ", "أُولَـئِكَ لَمْ يَكُونُواْ مُعْجِزِينَ فِي الأَرْضِ وَمَا كَانَ لَهُم مِّن دُونِ اللّهِ مِنْ أَوْلِيَاء يُضَاعَفُ لَهُمُ الْعَذَابُ مَا كَانُواْ يَسْتَطِيعُونَ السَّمْعَ وَمَا كَانُواْ يُبْصِرُونَ", "أُوْلَـئِكَ الَّذِينَ خَسِرُواْ أَنفُسَهُمْ وَضَلَّ عَنْهُم مَّا كَانُواْ يَفْتَرُونَ", "لاَ جَرَمَ أَنَّهُمْ فِي الآخِرَةِ هُمُ الأَخْسَرُونَ", "إِنَّ الَّذِينَ آمَنُواْ وَعَمِلُواْ الصَّالِحَاتِ وَأَخْبَتُواْ إِلَى رَبِّهِمْ أُوْلَـئِكَ أَصْحَابُ الجَنَّةِ هُمْ فِيهَا خَالِدُونَ", "مَثَلُ الْفَرِيقَيْنِ كَالأَعْمَى وَالأَصَمِّ وَالْبَصِيرِ وَالسَّمِيعِ هَلْ يَسْتَوِيَانِ مَثَلاً أَفَلاَ تَذَكَّرُونَ", "وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَى قَوْمِهِ إِنِّي لَكُمْ نَذِيرٌ مُّبِينٌ", "أَن لاَّ تَعْبُدُواْ إِلاَّ اللّهَ إِنِّيَ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ أَلِيمٍ", "فَقَالَ الْمَلأُ الَّذِينَ كَفَرُواْ مِن قِوْمِهِ مَا نَرَاكَ إِلاَّ بَشَرًا مِّثْلَنَا وَمَا نَرَاكَ اتَّبَعَكَ إِلاَّ الَّذِينَ هُمْ أَرَاذِلُنَا بَادِيَ الرَّأْيِ وَمَا نَرَى لَكُمْ عَلَيْنَا مِن فَضْلٍ بَلْ نَظُنُّكُمْ كَاذِبِينَ", "قَالَ يَا قَوْمِ أَرَأَيْتُمْ إِن كُنتُ عَلَى بَيِّنَةٍ مِّن رَّبِّيَ وَآتَانِي رَحْمَةً مِّنْ عِندِهِ فَعُمِّيَتْ عَلَيْكُمْ أَنُلْزِمُكُمُوهَا وَأَنتُمْ لَهَا كَارِهُونَ", "وَيَا قَوْمِ لا أَسْأَلُكُمْ عَلَيْهِ مَالاً إِنْ أَجْرِيَ إِلاَّ عَلَى اللّهِ وَمَآ أَنَاْ بِطَارِدِ الَّذِينَ آمَنُواْ إِنَّهُم مُّلاَقُو رَبِّهِمْ وَلَـكِنِّيَ أَرَاكُمْ قَوْمًا تَجْهَلُونَ", "وَيَا قَوْمِ مَن يَنصُرُنِي مِنَ اللّهِ إِن طَرَدتُّهُمْ أَفَلاَ تَذَكَّرُونَ", "وَلاَ أَقُولُ لَكُمْ عِندِي خَزَآئِنُ اللّهِ وَلاَ أَعْلَمُ الْغَيْبَ وَلاَ أَقُولُ إِنِّي مَلَكٌ وَلاَ أَقُولُ لِلَّذِينَ تَزْدَرِي أَعْيُنُكُمْ لَن يُؤْتِيَهُمُ اللّهُ خَيْرًا اللّهُ أَعْلَمُ بِمَا فِي أَنفُسِهِمْ إِنِّي إِذًا لَّمِنَ الظَّالِمِينَ", "قَالُواْ يَا نُوحُ قَدْ جَادَلْتَنَا فَأَكْثَرْتَ جِدَالَنَا فَأْتَنِا بِمَا تَعِدُنَا إِن كُنتَ مِنَ الصَّادِقِينَ", "قَالَ إِنَّمَا يَأْتِيكُم بِهِ اللّهُ إِن شَاء وَمَا أَنتُم بِمُعْجِزِينَ", "وَلاَ يَنفَعُكُمْ نُصْحِي إِنْ أَرَدتُّ أَنْ أَنصَحَ لَكُمْ إِن كَانَ اللّهُ يُرِيدُ أَن يُغْوِيَكُمْ هُوَ رَبُّكُمْ وَإِلَيْهِ تُرْجَعُونَ", "أَمْ يَقُولُونَ افْتَرَاهُ قُلْ إِنِ افْتَرَيْتُهُ فَعَلَيَّ إِجْرَامِي وَأَنَاْ بَرِيءٌ مِّمَّا تُجْرَمُونَ", "وَأُوحِيَ إِلَى نُوحٍ أَنَّهُ لَن يُؤْمِنَ مِن قَوْمِكَ إِلاَّ مَن قَدْ آمَنَ فَلاَ تَبْتَئِسْ بِمَا كَانُواْ يَفْعَلُونَ", "وَاصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا وَلاَ تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُواْ إِنَّهُم مُّغْرَقُونَ", "وَيَصْنَعُ الْفُلْكَ وَكُلَّمَا مَرَّ عَلَيْهِ مَلأٌ مِّن قَوْمِهِ سَخِرُواْ مِنْهُ قَالَ إِن تَسْخَرُواْ مِنَّا فَإِنَّا نَسْخَرُ مِنكُمْ كَمَا تَسْخَرُونَ", "فَسَوْفَ تَعْلَمُونَ مَن يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيمٌ", "حَتَّى إِذَا جَاء أَمْرُنَا وَفَارَ التَّنُّورُ قُلْنَا احْمِلْ فِيهَا مِن كُلٍّ زَوْجَيْنِ اثْنَيْنِ وَأَهْلَكَ إِلاَّ مَن سَبَقَ عَلَيْهِ الْقَوْلُ وَمَنْ آمَنَ وَمَا آمَنَ مَعَهُ إِلاَّ قَلِيلٌ", "وَقَالَ ارْكَبُواْ فِيهَا بِسْمِ اللّهِ مَجْرَاهَا وَمُرْسَاهَا إِنَّ رَبِّي لَغَفُورٌ رَّحِيمٌ", "وَهِيَ تَجْرِي بِهِمْ فِي مَوْجٍ كَالْجِبَالِ وَنَادَى نُوحٌ ابْنَهُ وَكَانَ فِي مَعْزِلٍ يَا بُنَيَّ ارْكَب مَّعَنَا وَلاَ تَكُن مَّعَ الْكَافِرِينَ", "قَالَ سَآوِي إِلَى جَبَلٍ يَعْصِمُنِي مِنَ الْمَاء قَالَ لاَ عَاصِمَ الْيَوْمَ مِنْ أَمْرِ اللّهِ إِلاَّ مَن رَّحِمَ وَحَالَ بَيْنَهُمَا الْمَوْجُ فَكَانَ مِنَ الْمُغْرَقِينَ", "وَقِيلَ يَا أَرْضُ ابْلَعِي مَاءكِ وَيَا سَمَاء أَقْلِعِي وَغِيضَ الْمَاء وَقُضِيَ الأَمْرُ وَاسْتَوَتْ عَلَى الْجُودِيِّ وَقِيلَ بُعْداً لِّلْقَوْمِ الظَّالِمِينَ", "وَنَادَى نُوحٌ رَّبَّهُ فَقَالَ رَبِّ إِنَّ ابُنِي مِنْ أَهْلِي وَإِنَّ وَعْدَكَ الْحَقُّ وَأَنتَ أَحْكَمُ الْحَاكِمِينَ", "قَالَ يَا نُوحُ إِنَّهُ لَيْسَ مِنْ أَهْلِكَ إِنَّهُ عَمَلٌ غَيْرُ صَالِحٍ فَلاَ تَسْأَلْنِ مَا لَيْسَ لَكَ بِهِ عِلْمٌ إِنِّي أَعِظُكَ أَن تَكُونَ مِنَ الْجَاهِلِينَ", "قَالَ رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ", "قِيلَ يَا نُوحُ اهْبِطْ بِسَلاَمٍ مِّنَّا وَبَركَاتٍ عَلَيْكَ وَعَلَى أُمَمٍ مِّمَّن مَّعَكَ وَأُمَمٌ سَنُمَتِّعُهُمْ ثُمَّ يَمَسُّهُم مِّنَّا عَذَابٌ أَلِيمٌ", "تِلْكَ مِنْ أَنبَاء الْغَيْبِ نُوحِيهَا إِلَيْكَ مَا كُنتَ تَعْلَمُهَا أَنتَ وَلاَ قَوْمُكَ مِن قَبْلِ هَـذَا فَاصْبِرْ إِنَّ الْعَاقِبَةَ لِلْمُتَّقِينَ", "وَإِلَى عَادٍ أَخَاهُمْ هُودًا قَالَ يَا قَوْمِ اعْبُدُواْ اللّهَ مَا لَكُم مِّنْ إِلَـهٍ غَيْرُهُ إِنْ أَنتُمْ إِلاَّ مُفْتَرُونَ", "يَا قَوْمِ لا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا إِنْ أَجْرِيَ إِلاَّ عَلَى الَّذِي فَطَرَنِي أَفَلاَ تَعْقِلُونَ", "وَيَا قَوْمِ اسْتَغْفِرُواْ رَبَّكُمْ ثُمَّ تُوبُواْ إِلَيْهِ يُرْسِلِ السَّمَاء عَلَيْكُم مِّدْرَارًا وَيَزِدْكُمْ قُوَّةً إِلَى قُوَّتِكُمْ وَلاَ تَتَوَلَّوْاْ مُجْرِمِينَ", "قَالُواْ يَا هُودُ مَا جِئْتَنَا بِبَيِّنَةٍ وَمَا نَحْنُ بِتَارِكِي آلِهَتِنَا عَن قَوْلِكَ وَمَا نَحْنُ لَكَ بِمُؤْمِنِينَ", "إِن نَّقُولُ إِلاَّ اعْتَرَاكَ بَعْضُ آلِهَتِنَا بِسُوَءٍ قَالَ إِنِّي أُشْهِدُ اللّهِ وَاشْهَدُواْ أَنِّي بَرِيءٌ مِّمَّا تُشْرِكُونَ", "مِن دُونِهِ فَكِيدُونِي جَمِيعًا ثُمَّ لاَ تُنظِرُونِ", "إِنِّي تَوَكَّلْتُ عَلَى اللّهِ رَبِّي وَرَبِّكُم مَّا مِن دَآبَّةٍ إِلاَّ هُوَ آخِذٌ بِنَاصِيَتِهَا إِنَّ رَبِّي عَلَى صِرَاطٍ مُّسْتَقِيمٍ", "فَإِن تَوَلَّوْاْ فَقَدْ أَبْلَغْتُكُم مَّا أُرْسِلْتُ بِهِ إِلَيْكُمْ وَيَسْتَخْلِفُ رَبِّي قَوْمًا غَيْرَكُمْ وَلاَ تَضُرُّونَهُ شَيْئًا إِنَّ رَبِّي عَلَىَ كُلِّ شَيْءٍ حَفِيظٌ", "وَلَمَّا جَاء أَمْرُنَا نَجَّيْنَا هُودًا وَالَّذِينَ آمَنُواْ مَعَهُ بِرَحْمَةٍ مِّنَّا وَنَجَّيْنَاهُم مِّنْ عَذَابٍ غَلِيظٍ", "وَتِلْكَ عَادٌ جَحَدُواْ بِآيَاتِ رَبِّهِمْ وَعَصَوْاْ رُسُلَهُ وَاتَّبَعُواْ أَمْرَ كُلِّ جَبَّارٍ عَنِيدٍ", "وَأُتْبِعُواْ فِي هَـذِهِ الدُّنْيَا لَعْنَةً وَيَوْمَ الْقِيَامَةِ أَلا إِنَّ عَادًا كَفَرُواْ رَبَّهُمْ أَلاَ بُعْدًا لِّعَادٍ قَوْمِ هُودٍ", "وَإِلَى ثَمُودَ أَخَاهُمْ صَالِحًا قَالَ يَا قَوْمِ اعْبُدُواْ اللّهَ مَا لَكُم مِّنْ إِلَـهٍ غَيْرُهُ هُوَ أَنشَأَكُم مِّنَ الأَرْضِ وَاسْتَعْمَرَكُمْ فِيهَا فَاسْتَغْفِرُوهُ ثُمَّ تُوبُواْ إِلَيْهِ إِنَّ رَبِّي قَرِيبٌ مُّجِيبٌ", "قَالُواْ يَا صَالِحُ قَدْ كُنتَ فِينَا مَرْجُوًّا قَبْلَ هَـذَا أَتَنْهَانَا أَن نَّعْبُدَ مَا يَعْبُدُ آبَاؤُنَا وَإِنَّنَا لَفِي شَكٍّ مِّمَّا تَدْعُونَا إِلَيْهِ مُرِيبٍ", "قَالَ يَا قَوْمِ أَرَأَيْتُمْ إِن كُنتُ عَلَى بَيِّنَةً مِّن رَّبِّي وَآتَانِي مِنْهُ رَحْمَةً فَمَن يَنصُرُنِي مِنَ اللّهِ إِنْ عَصَيْتُهُ فَمَا تَزِيدُونَنِي غَيْرَ تَخْسِيرٍ", "وَيَا قَوْمِ هَـذِهِ نَاقَةُ اللّهِ لَكُمْ آيَةً فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللّهِ وَلاَ تَمَسُّوهَا بِسُوءٍ فَيَأْخُذَكُمْ عَذَابٌ قَرِيبٌ", "فَعَقَرُوهَا فَقَالَ تَمَتَّعُواْ فِي دَارِكُمْ ثَلاَثَةَ أَيَّامٍ ذَلِكَ وَعْدٌ غَيْرُ مَكْذُوبٍ", "فَلَمَّا جَاء أَمْرُنَا نَجَّيْنَا صَالِحًا وَالَّذِينَ آمَنُواْ مَعَهُ بِرَحْمَةٍ مِّنَّا وَمِنْ خِزْيِ يَوْمِئِذٍ إِنَّ رَبَّكَ هُوَ الْقَوِيُّ الْعَزِيزُ", "وَأَخَذَ الَّذِينَ ظَلَمُواْ الصَّيْحَةُ فَأَصْبَحُواْ فِي دِيَارِهِمْ جَاثِمِينَ", "كَأَن لَّمْ يَغْنَوْاْ فِيهَا أَلاَ إِنَّ ثَمُودَ كَفرُواْ رَبَّهُمْ أَلاَ بُعْدًا لِّثَمُودَ", "وَلَقَدْ جَاءتْ رُسُلُنَا إِبْرَاهِيمَ بِالْبُـشْرَى قَالُواْ سَلاَمًا قَالَ سَلاَمٌ فَمَا لَبِثَ أَن جَاء بِعِجْلٍ حَنِيذٍ", "فَلَمَّا رَأَى أَيْدِيَهُمْ لاَ تَصِلُ إِلَيْهِ نَكِرَهُمْ وَأَوْجَسَ مِنْهُمْ خِيفَةً قَالُواْ لاَ تَخَفْ إِنَّا أُرْسِلْنَا إِلَى قَوْمِ لُوطٍ", "وَامْرَأَتُهُ قَآئِمَةٌ فَضَحِكَتْ فَبَشَّرْنَاهَا بِإِسْحَقَ وَمِن وَرَاء إِسْحَقَ يَعْقُوبَ", "قَالَتْ يَا وَيْلَتَى أَأَلِدُ وَأَنَاْ عَجُوزٌ وَهَـذَا بَعْلِي شَيْخًا إِنَّ هَـذَا لَشَيْءٌ عَجِيبٌ", "قَالُواْ أَتَعْجَبِينَ مِنْ أَمْرِ اللّهِ رَحْمَتُ اللّهِ وَبَرَكَاتُهُ عَلَيْكُمْ أَهْلَ الْبَيْتِ إِنَّهُ حَمِيدٌ مَّجِيدٌ", "فَلَمَّا ذَهَبَ عَنْ إِبْرَاهِيمَ الرَّوْعُ وَجَاءتْهُ الْبُشْرَى يُجَادِلُنَا فِي قَوْمِ لُوطٍ", "إِنَّ إِبْرَاهِيمَ لَحَلِيمٌ أَوَّاهٌ مُّنِيبٌ", "يَا إِبْرَاهِيمُ أَعْرِضْ عَنْ هَذَا إِنَّهُ قَدْ جَاء أَمْرُ رَبِّكَ وَإِنَّهُمْ آتِيهِمْ عَذَابٌ غَيْرُ مَرْدُودٍ", "وَلَمَّا جَاءتْ رُسُلُنَا لُوطًا سِيءَ بِهِمْ وَضَاقَ بِهِمْ ذَرْعًا وَقَالَ هَـذَا يَوْمٌ عَصِيبٌ", "وَجَاءهُ قَوْمُهُ يُهْرَعُونَ إِلَيْهِ وَمِن قَبْلُ كَانُواْ يَعْمَلُونَ السَّيِّئَاتِ قَالَ يَا قَوْمِ هَـؤُلاء بَنَاتِي هُنَّ أَطْهَرُ لَكُمْ فَاتَّقُواْ اللّهَ وَلاَ تُخْزُونِ فِي ضَيْفِي أَلَيْسَ مِنكُمْ رَجُلٌ رَّشِيدٌ", "قَالُواْ لَقَدْ عَلِمْتَ مَا لَنَا فِي بَنَاتِكَ مِنْ حَقٍّ وَإِنَّكَ لَتَعْلَمُ مَا نُرِيدُ", "قَالَ لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلَى رُكْنٍ شَدِيدٍ", "قَالُواْ يَا لُوطُ إِنَّا رُسُلُ رَبِّكَ لَن يَصِلُواْ إِلَيْكَ فَأَسْرِ بِأَهْلِكَ بِقِطْعٍ مِّنَ اللَّيْلِ وَلاَ يَلْتَفِتْ مِنكُمْ أَحَدٌ إِلاَّ امْرَأَتَكَ إِنَّهُ مُصِيبُهَا مَا أَصَابَهُمْ إِنَّ مَوْعِدَهُمُ الصُّبْحُ أَلَيْسَ الصُّبْحُ بِقَرِيبٍ", "فَلَمَّا جَاء أَمْرُنَا جَعَلْنَا عَالِيَهَا سَافِلَهَا وَأَمْطَرْنَا عَلَيْهَا حِجَارَةً مِّن سِجِّيلٍ مَّنضُودٍ", "مُّسَوَّمَةً عِندَ رَبِّكَ وَمَا هِيَ مِنَ الظَّالِمِينَ بِبَعِيدٍ", "وَإِلَى مَدْيَنَ أَخَاهُمْ شُعَيْبًا قَالَ يَا قَوْمِ اعْبُدُواْ اللّهَ مَا لَكُم مِّنْ إِلَـهٍ غَيْرُهُ وَلاَ تَنقُصُواْ الْمِكْيَالَ وَالْمِيزَانَ إِنِّيَ أَرَاكُم بِخَيْرٍ وَإِنِّيَ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ مُّحِيطٍ", "وَيَا قَوْمِ أَوْفُواْ الْمِكْيَالَ وَالْمِيزَانَ بِالْقِسْطِ وَلاَ تَبْخَسُواْ النَّاسَ أَشْيَاءهُمْ وَلاَ تَعْثَوْاْ فِي الأَرْضِ مُفْسِدِينَ", "بَقِيَّةُ اللّهِ خَيْرٌ لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ وَمَا أَنَاْ عَلَيْكُم بِحَفِيظٍ", "قَالُواْ يَا شُعَيْبُ أَصَلاَتُكَ تَأْمُرُكَ أَن نَّتْرُكَ مَا يَعْبُدُ آبَاؤُنَا أَوْ أَن نَّفْعَلَ فِي أَمْوَالِنَا مَا نَشَاء إِنَّكَ لَأَنتَ الْحَلِيمُ الرَّشِيدُ", "قَالَ يَا قَوْمِ أَرَأَيْتُمْ إِن كُنتُ عَلَىَ بَيِّنَةٍ مِّن رَّبِّي وَرَزَقَنِي مِنْهُ رِزْقًا حَسَنًا وَمَا أُرِيدُ أَنْ أُخَالِفَكُمْ إِلَى مَا أَنْهَاكُمْ عَنْهُ إِنْ أُرِيدُ إِلاَّ الإِصْلاَحَ مَا اسْتَطَعْتُ وَمَا تَوْفِيقِي إِلاَّ بِاللّهِ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ", "وَيَا قَوْمِ لاَ يَجْرِمَنَّكُمْ شِقَاقِي أَن يُصِيبَكُم مِّثْلُ مَا أَصَابَ قَوْمَ نُوحٍ أَوْ قَوْمَ هُودٍ أَوْ قَوْمَ صَالِحٍ وَمَا قَوْمُ لُوطٍ مِّنكُم بِبَعِيدٍ", "وَاسْتَغْفِرُواْ رَبَّكُمْ ثُمَّ تُوبُواْ إِلَيْهِ إِنَّ رَبِّي رَحِيمٌ وَدُودٌ", "قَالُواْ يَا شُعَيْبُ مَا نَفْقَهُ كَثِيرًا مِّمَّا تَقُولُ وَإِنَّا لَنَرَاكَ فِينَا ضَعِيفًا وَلَوْلاَ رَهْطُكَ لَرَجَمْنَاكَ وَمَا أَنتَ عَلَيْنَا بِعَزِيزٍ", "قَالَ يَا قَوْمِ أَرَهْطِي أَعَزُّ عَلَيْكُم مِّنَ اللّهِ وَاتَّخَذْتُمُوهُ وَرَاءكُمْ ظِهْرِيًّا إِنَّ رَبِّي بِمَا تَعْمَلُونَ مُحِيطٌ", "وَيَا قَوْمِ اعْمَلُواْ عَلَى مَكَانَتِكُمْ إِنِّي عَامِلٌ سَوْفَ تَعْلَمُونَ مَن يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَمَنْ هُوَ كَاذِبٌ وَارْتَقِبُواْ إِنِّي مَعَكُمْ رَقِيبٌ", "وَلَمَّا جَاء أَمْرُنَا نَجَّيْنَا شُعَيْبًا وَالَّذِينَ آمَنُواْ مَعَهُ بِرَحْمَةٍ مَّنَّا وَأَخَذَتِ الَّذِينَ ظَلَمُواْ الصَّيْحَةُ فَأَصْبَحُواْ فِي دِيَارِهِمْ جَاثِمِينَ", "كَأَن لَّمْ يَغْنَوْاْ فِيهَا أَلاَ بُعْدًا لِّمَدْيَنَ كَمَا بَعِدَتْ ثَمُودُ", "وَلَقَدْ أَرْسَلْنَا مُوسَى بِآيَاتِنَا وَسُلْطَانٍ مُّبِينٍ", "إِلَى فِرْعَوْنَ وَمَلَئِهِ فَاتَّبَعُواْ أَمْرَ فِرْعَوْنَ وَمَا أَمْرُ فِرْعَوْنَ بِرَشِيدٍ", "يَقْدُمُ قَوْمَهُ يَوْمَ الْقِيَامَةِ فَأَوْرَدَهُمُ النَّارَ وَبِئْسَ الْوِرْدُ الْمَوْرُودُ", "وَأُتْبِعُواْ فِي هَـذِهِ لَعْنَةً وَيَوْمَ الْقِيَامَةِ بِئْسَ الرِّفْدُ الْمَرْفُودُ", "ذَلِكَ مِنْ أَنبَاء الْقُرَى نَقُصُّهُ عَلَيْكَ مِنْهَا قَآئِمٌ وَحَصِيدٌ", "وَمَا ظَلَمْنَاهُمْ وَلَـكِن ظَلَمُواْ أَنفُسَهُمْ فَمَا أَغْنَتْ عَنْهُمْ آلِهَتُهُمُ الَّتِي يَدْعُونَ مِن دُونِ اللّهِ مِن شَيْءٍ لِّمَّا جَاء أَمْرُ رَبِّكَ وَمَا زَادُوهُمْ غَيْرَ تَتْبِيبٍ", "وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَى وَهِيَ ظَالِمَةٌ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ", "إِنَّ فِي ذَلِكَ لآيَةً لِّمَنْ خَافَ عَذَابَ الآخِرَةِ ذَلِكَ يَوْمٌ مَّجْمُوعٌ لَّهُ النَّاسُ وَذَلِكَ يَوْمٌ مَّشْهُودٌ", "وَمَا نُؤَخِّرُهُ إِلاَّ لِأَجَلٍ مَّعْدُودٍ", "يَوْمَ يَأْتِ لاَ تَكَلَّمُ نَفْسٌ إِلاَّ بِإِذْنِهِ فَمِنْهُمْ شَقِيٌّ وَسَعِيدٌ", "فَأَمَّا الَّذِينَ شَقُواْ فَفِي النَّارِ لَهُمْ فِيهَا زَفِيرٌ وَشَهِيقٌ", "خَالِدِينَ فِيهَا مَا دَامَتِ السَّمَاوَاتُ وَالأَرْضُ إِلاَّ مَا شَاء رَبُّكَ إِنَّ رَبَّكَ فَعَّالٌ لِّمَا يُرِيدُ", "وَأَمَّا الَّذِينَ سُعِدُواْ فَفِي الْجَنَّةِ خَالِدِينَ فِيهَا مَا دَامَتِ السَّمَاوَاتُ وَالأَرْضُ إِلاَّ مَا شَاء رَبُّكَ عَطَاء غَيْرَ مَجْذُوذٍ", "فَلاَ تَكُ فِي مِرْيَةٍ مِّمَّا يَعْبُدُ هَـؤُلاء مَا يَعْبُدُونَ إِلاَّ كَمَا يَعْبُدُ آبَاؤُهُم مِّن قَبْلُ وَإِنَّا لَمُوَفُّوهُمْ نَصِيبَهُمْ غَيْرَ مَنقُوصٍ", "وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ فَاخْتُلِفَ فِيهِ وَلَوْلاَ كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ لَقُضِيَ بَيْنَهُمْ وَإِنَّهُمْ لَفِي شَكٍّ مِّنْهُ مُرِيبٍ", "وَإِنَّ كُـلاًّ لَّمَّا لَيُوَفِّيَنَّهُمْ رَبُّكَ أَعْمَالَهُمْ إِنَّهُ بِمَا يَعْمَلُونَ خَبِيرٌ", "فَاسْتَقِمْ كَمَا أُمِرْتَ وَمَن تَابَ مَعَكَ وَلاَ تَطْغَوْاْ إِنَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ", "وَلاَ تَرْكَنُواْ إِلَى الَّذِينَ ظَلَمُواْ فَتَمَسَّكُمُ النَّارُ وَمَا لَكُم مِّن دُونِ اللّهِ مِنْ أَوْلِيَاء ثُمَّ لاَ تُنصَرُونَ", "وَأَقِمِ الصَّلاَةَ طَرَفَيِ النَّهَارِ وَزُلَفًا مِّنَ اللَّيْلِ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّـيِّئَاتِ ذَلِكَ ذِكْرَى لِلذَّاكِرِينَ", "وَاصْبِرْ فَإِنَّ اللّهَ لاَ يُضِيعُ أَجْرَ الْمُحْسِنِينَ", "فَلَوْلاَ كَانَ مِنَ الْقُرُونِ مِن قَبْلِكُمْ أُوْلُواْ بَقِيَّةٍ يَنْهَوْنَ عَنِ الْفَسَادِ فِي الأَرْضِ إِلاَّ قَلِيلاً مِّمَّنْ أَنجَيْنَا مِنْهُمْ وَاتَّبَعَ الَّذِينَ ظَلَمُواْ مَا أُتْرِفُواْ فِيهِ وَكَانُواْ مُجْرِمِينَ", "وَمَا كَانَ رَبُّكَ لِيُهْلِكَ الْقُرَى بِظُلْمٍ وَأَهْلُهَا مُصْلِحُونَ", "وَلَوْ شَاء رَبُّكَ لَجَعَلَ النَّاسَ أُمَّةً وَاحِدَةً وَلاَ يَزَالُونَ مُخْتَلِفِينَ", "إِلاَّ مَن رَّحِمَ رَبُّكَ وَلِذَلِكَ خَلَقَهُمْ وَتَمَّتْ كَلِمَةُ رَبِّكَ لأَمْلأنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ أَجْمَعِينَ", "وَكُـلاًّ نَّقُصُّ عَلَيْكَ مِنْ أَنبَاء الرُّسُلِ مَا نُثَبِّتُ بِهِ فُؤَادَكَ وَجَاءكَ فِي هَـذِهِ الْحَقُّ وَمَوْعِظَةٌ وَذِكْرَى لِلْمُؤْمِنِينَ", "وَقُل لِّلَّذِينَ لاَ يُؤْمِنُونَ اعْمَلُواْ عَلَى مَكَانَتِكُمْ إِنَّا عَامِلُونَ", "وَانتَظِرُوا إِنَّا مُنتَظِرُونَ", "وَلِلّهِ غَيْبُ السَّمَاوَاتِ وَالأَرْضِ وَإِلَيْهِ يُرْجَعُ الأَمْرُ كُلُّهُ فَاعْبُدْهُ وَتَوَكَّلْ عَلَيْهِ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُونَ"], "name_en": "Hud", "ayahs_en": ["Alif-Lâm-Râ. [These letters are one of  the miracles of the Qur’ân and none but Allâh (Alone) knows their  meanings]. (This is) a Book, the Verses whereof are perfected (in every  sphere of knowledge, etc.), and then explained in detail from One  (Allâh), Who is All-Wise and Well-Acquainted (with all things).", "(Saying) worship none but Allâh. Verily, I (Muhammad SAW) am unto you from Him a warner and a bringer of glad tidings.", "And (commanding you): ”Seek the  forgiveness of your Lord, and turn to Him in repentance, that He may  grant you good enjoyment, for a term appointed, and bestow His  abounding Grace to every owner of grace (i.e. the one who helps and  serves needy and deserving, physically and with his wealth, and even  with good words). But if you turn away, then I fear for you the torment  of a Great Day (i.e. the Day of Resurrection).", "To Allâh is your return, and He is Able to do all things.”", "No doubt! They did fold up their  breasts, that they may hide from Him. Surely, even when they cover  themselves with their garments, He knows what they conceal and what  they reveal. Verily, He is the All-Knower of the (innermost secrets) of  the breasts.", "And no (moving) living creature is there  on earth but its provision is due from Allâh. And He knows its dwelling  place and its deposit (in the uterous, grave, etc.). all is in a Clear  Book (Al-Lauh Al-Mahfûz - the Book of Decrees with Allâh).", "And He it is Who has created the heavens  and the earth in six Days and His Throne was on the water, that He  might try you, which of you is the best in deeds. But if you were to  say to them: ”You shall indeed be raised up after death,” those who  disbelieve would be sure to say, ”This is nothing but obvious magic.”", "And if We delay the torment for them  till a determined term, they are sure to say, ”What keeps it back?”  Verily, on the day it reaches them, nothing will turn it away from  them, and they will be surrounded by (fall in) that at which they used  to mock!", "And if We give man a taste of Mercy from Us, and then withdraw it from him, verily! He is despairing, ungrateful.", "But if We let him taste good (favour)  after evil (poverty and harm) has touched him, he is sure to say: ”Ills  have departed from me.” Surely, he is exultant, and boastful  (ungrateful to Allâh).", "Except those who show patience and do righteous good deeds, those: theirs will be forgiveness and a great reward (Paradise).", "So perchance you (Muhammad SAW) may give  up a part of what is revealed unto you, and that your breast feels  straitened for it because they say, ”Why has not a treasure been sent  down unto him, or an angel has come with him?” But you are only a  warner. And Allâh is a Wakîl (Disposer of affairs, Trustee, Guardian,  etc.) over all things.", "Or they say, ”He (Prophet Muhammad SAW)  forged it (the Qur’an).” Say: ”Bring you then ten forged Sûrah  (chapters) like unto it, and call whomsoever you can, other than Allâh  (to your help), if you speak the truth!”", "If then they answer you not, know then  that the Revelation (this Qur’ân) is sent down with the Knowledge of  Allâh and that Lâ ilâha illa Huwa: (none has the right to be worshipped  but He)! Will you then be Muslims (those who submit to Islâm)?", "Whosoever desires the life of the world  and its glitter; to them We shall pay in full (the wages of) their  deeds therein, and they will have no diminution therein.", "They are those for whom there is nothing  in the Hereafter but Fire; and vain are the deeds they did therein. And  of no effect is that which they used to do.", "Can they (Muslims) who rely on a clear  proof (the Qur’ân) from their Lord, and whom a witness [Prophet  Muhammad SAW through Jibrael (Gabriel ÓáÇã)] from Him follows it (can  they be equal with the disbelievers); and before it, came the Book of  Mûsa (Moses), a guidance and a mercy, they believe therein, but those  of the sects (Jews, Christians and all the other non-Muslim nations)  that reject it (the Qur’ân), the Fire will be their promised  meeting-place. So be not in doubt about it (i.e. those who denied  Prophet Muhammad SAW and also denied all that which he brought from  Allâh, surely, they will enter Hell). Verily, it is the truth from your  Lord, but most of the mankind believe not.", "And who does more wrong than he who  invents a lie against Allâh. Such wi,l be brought before their Lord,  and the witnesses will say, ”These are the ones who lied against their  Lord!” No doubt! the curse of Allâh is on the Zâlimûn (polytheists,  wrong-doers, oppressors, etc.).", "Those who hinder (others) from the Path  of Allâh (Islâmic Monotheism), and seek a crookedness therein, while  they are disbelievers in the Hereafter.", "By no means will they escape (from  Allâh’s Torment) on earth, nor have they protectors besides Allâh!  Their torment will be doubled! They could not bear to hear (the  preachers of the truth) and they used not to see (the truth because of  their severe aversin, inspite of the fact that they had the sense of  hearing and sight).", "They are those who have lost their ownselves, and their invented false deities will vanish from them.", "Certainly, they are those who will be the greatest losers in the Hereafter.", "Verily, those who believe (in the  Oneness of Allâh - Islâmic Monotheism) and do righteous good deeds, and  humble themselves (in repentance and obedience) before their Lord, -  they will be dwellers of Paradise to dwell therein forever.", "The likeness of the two parties is as  the blind and the deaf and the seer and the hearer. Are they equal when  compared? Will you not then take heed?", "And indeed We sent Nûh (Noah) to his people (and he said): ”I have come to you as a plain warner.”", "”That you worship none but Allâh, surely, I fear for you the torment of a painful Day.”", "The chiefs of the disbelievers among his  people said: ”We see you but a man like ourselves, nor do we see any  follow you but the meanest among us and they (too) followed you without  thinking. And we do not see in you any merit above us, in fact we think  you are liars.”", "He said: ”O my people! Tell me, if I  have a clear proof from my Lord, and a Mercy (Prophethood, etc.) has  come to me from Him, but that (Mercy) has been obscured from your  sight. Shall we compel you to accept it (Islâmic Monotheism) when you  have a strong hatred for it?", "”And O my people! I ask of you no wealth  for it, my reward is from none but Allâh. I am not going to drive away  those who have believed. Surely, they are going to meet their Lord, but  I see that you are a people that are ignorant.", "”And O my people! Who will help me against Allâh, if I drove them away? Will you not then give a thought?", "”And I do not say to you that with me  are the Treasures of Allâh, ”Nor that I know the Ghaib (unseen); ”nor  do I say I am an angel, and I do not say of those whom your eyes look  down upon that Allâh will not bestow any good on them. Allâh knows what  is in their inner-selves (as regards belief, etc.). In that case, I  should, indeed be one of the Zâlimûn (wrong-doers, oppressors, etc.).”", "They said: ”O Nûh (Noah)! You have  disputed with us and much have you prolonged the dispute with us, now  bring upon us what you threaten us with, if you are of the truthful.”", "He said: ”Only Allâh will bring it (the punishment) on you, if He will, and then you will escape not.", "”And my advice will not profit you, even  if I wish to give you good counsel, if Allâh’s Will is to keep you  astray. He is your Lord! and to Him you shall return.”", "Or they (the pagans of Makkah) say: ”He  (Muhammad SAW) has fabricated it (the Qur’ân).” Say: ”If I have  fabricated it, upon me be my crimes, but I am innocent of (all) those  crimes which you commit.”", "And it was inspired to Nûh (Noah): ”None  of your people will believe except those who have believed already. So  be not sad because of what they used to do.", "”And construct the ship under Our Eyes  and with Our Inspiration, and address Me not on behalf of those who did  wrong; they are surely to be drowned.”", "And as he was constructing the ship,  whenever the chiefs of his people passed by him, they made a mockery of  him. He said: ”If you mock at us, so do we mock at you likewise for  your mocking.", "”And you will know who it is on whom  will come a torment that will cover him with disgrace and on whom will  fall a lasting torment.”", "(So it was) till then there came Our  Command and the oven gushed forth (water like fountains from the  earth). We said: ”Embark therein, of each kind two (male and female),  and your family, except him against whom the Word has already gone  forth, and those who believe. And none believed with him, except a few.”", "And he [Nûh (Noah) ] said: ”Embark  therein, in the Name of Allâh will be its moving course and its resting  anchorage. Surely, my Lord is Oft-Forgiving, Most Merciful.” (Tafsir  At-Tabarî, Vol. 12, Page 43)", "So it (the ship) sailed with them amidst  the waves like mountains, and Nûh (Noah) called out to his son, who had  separated himself (apart), ”O my son! Embark with us and be not with  the disbelievers.”", "The son replied: ”I will betake myself  to a mountain, it will save me from the water.” Nûh (Noah) said: ”This  day there is no saviour from the Decree of Allâh except him on whom He  has mercy.” And a wave came in between them, so he (the son) was among  the drowned.", "And it was said: ”O earth! Swallow up  your water, and O sky! Withhold (your rain).” And the water was  diminished (made to subside) and the Decree (of Allâh) was fulfilled  (i.e. the destruction of the people of Nûh (Noah). And it (the ship)  rested on Mount Judi, and it was said: ”Away with the people who are  Zalimûn (polytheists and wrong-doing)!”", "And Nûh (Noah) called upon his Lord and  said, ”O my Lord! Verily, my son is of my family! And certainly, Your  Promise is true, and You are the Most Just of the judges.”", "He said: ”O Nûh (Noah)! Surely, he is  not of your family; verily, his work is unrighteous, so ask not of Me  that of which you have no knowledge! I admonish you, lest you be one of  the ignorants.”", "Nûh (Noah) said: ”O my Lord! I seek  refuge with You from asking You that of which I have no knowledge. And  unless You forgive me and have Mercy on me, I would indeed be one of  the losers.”", "It was said: ”O Nûh (Noah)! Come down  (from the ship) with peace from Us and blessings on you and on the  people who are with you (and on some of their off spring), but (there  will be other) people to whom We shall grant their pleasures (for a  time), but in the end a painful torment will reach them from Us.”", "This is of the news of the unseen which  We reveal unto you (O Muhammad SAW), neither you nor your people knew  them before this. So be patient. Surely, the (good) end is for the  Muttaqûn (pious - see V.2:2)", "And to ’Ad (people We sent) their  brother Hûd. He said, ”O my people! Worship Allâh! You have no other  Ilâh (God) but Him. Certainly, you do nothing but invent (lies)!", "”O my people I ask of you no reward for  it (the Message). My reward is only from Him, Who created me. Will you  not then understand?", "”And O my people! Ask forgiveness of  your Lord and then repent to Him, He will send you (from the sky)  abundant rain, and add strength to your strength, so do not turn away  as Mujrimûn (criminals, disbelievers in the Oneness of Allâh).”", "They said: ”O Hûd! No evidence have you  brought us, and we shall not leave our gods for your (mere) saying! And  we are not believers in you.", "”All that we say is that some of our  gods (false deities) have seized you with evil (madness).” He said: ”I  call Allâh to witness and bear you witness that I am free from that  which you ascribe as partners in worship, -", "With Him (Allâh). So plot against me, all of you, and give me no respite.", "”I put my trust in Allâh, my Lord and  your Lord! There is not a moving (living) creature but He has grasp of  its forelock. Verily, my Lord is on the Straight Path (the truth).", "”So if you turn away, still I have  conveyed the Message with which I was sent to you. My Lord will make  another people succeed you, and you will not harm Him in the least.  Surely, my Lord is Guardian over all things.”", "And when Our Commandment came, We saved  Hûd and those who believed with him by a Mercy from Us, and We saved  them from a severe torment.", "Such were ’Ad (people). They rejected  the Ayât (proofs, evidences, verses, lessons, signs, revelations, etc.)  of their Lord and disobeyed His Messengers, and followed the command of  every proud obstinate (oppressor of the truth, from their leaders).", "And they were pursued by a curse in this  world and (so they will be) on the Day of Resurrection. No doubt!  Verily, ’Ad disbelieved in their Lord. So away with ’Ad, the people of  Hûd.", "And to Thamûd (people, We sent) their  brother Sâlih (Saleh). He said: ”O my people! Worship Allâh, you have  no other Ilâh (God) but Him. He brought you forth from the earth and  settled you therein, then ask forgiveness of Him and turn to Him in  repentance. Certainly, my Lord is Near (to all by His Knowledge),  Responsive.”", "They said: ”O Sâlih (Saleh)! You have  been among us as a figure of good hope (and we wished for you to be our  chief), till this [new thing which you have brought; that we leave our  gods and worship your God (Allâh) Alone]! Do you (now) forbid us the  worship of what our fathers have worshipped? But we are really in grave  doubt as to that which you invite us to (monotheism).”", "He said: ”O my people! Tell me, if I  have a clear proof from my Lord, and there has come to me a Mercy  (Prophethood, etc.) from Him, who then can help me against Allâh, if I  were to disobey Him? Then you increase me not but in loss.", "”And O my people! This she-camel of  Allâh is a sign to you, leave her to feed on Allâh’s earth, and touch  her not with evil, lest a near torment will seize you.”", "But they killed her. So he said: ”Enjoy  yourselves in your homes for three days. This is a promise (i.e. a  threat) that will not be belied.”", "So when Our Commandment came, We saved  Sâlih (Saleh) and those who believed with him by a Mercy from Us, and  from the disgrace of that Day. Verily, your Lord, He is the All-Strong,  the All-Mighty.", "And As-Saîhah (torment - awful cry, etc.) overtook the wrong-doers, so they lay (dead), prostrate in their homes, -", "As if they had never lived there. No doubt! Verily, Thamûd disbelieved in their Lord. So away with Thamûd!", "And verily, there came Our Messengers to  Ibrahîm (Abraham) with glad tidings.They said: Salâm (greetings or  peace!) He answered, Salâm (greetings or peace!) and he hastened to  entertain them with a roasted calf.", "But when he saw their hands went not  towards it (the meal), he felt some mistrust of them, and conceived a  fear of them. They said: ”Fear not, we have been sent against the  people of Lout (Lot).”", "And his wife was standing (there), and  she laughed (either, because the Messengers did not eat their food or  for being glad for the destruction of the people of Lout (Lot). But We  gave her glad tidings of Ishâque (Isaac), and after him, of Ya’qûb  (Jacob).", "She said (in astonishment): ”Woe unto  me! Shall I bear a child while I am an old woman, and here is my  husband, an old man? Verily! This is a strange thing!”", "They said: ”Do you wonder at the Decree  of Allâh? The Mercy of Allâh and His Blessings be on you, O the family  [of Ibrahîm (Abraham)]. Surely, He (Allâh) is All-Praiseworthy,  All-Glorious.”", "Then when the fear had gone away from  (the mind of) Ibrahîm (Abraham), and the glad tidings had reached him,  he began to plead with Us (Our Messengers) for the people of Lout (Lot).", "Verily, Ibrahîm (Abraham) was, without  doubt, forbearing, used to invoke Allâh with humility, and was  repentant (to Allâh all the time, again and again).", "”O Ibrahîm (Abraham)! Forsake this.  Indeed, the Commandment of your Lord has gone forth. Verily, there will  come a torment for them which cannot be turned back.”", "And when Our Messengers came to Lout  (Lot), he was grieved on their account and felt himself straitened for  them (lest the town people should approach them to commit sodomy with  them). He said: ”This is a distressful day.”", "And his people came rushing towards him,  and since aforetime they used to commit crimes (sodomy, etc.), he said:  ”O my people! Here are my daughters (i.e. the daughters of my nation),  they are purer for you (if you marry them lawfully). So fear Allâh and  degrade me not as regards my guests! Is there not among you a single  right-minded man?”", "They said: ”Surely you know that we have  neither any desire nor in need of your daughters, and indeed you know  well what we want!”", "He said: ”Would that I had strength  (men) to overpower you, or that I could betake myself to some powerful  support (to resist you).”", "They (Messengers) said: ”O Lout (Lot)!  Verily, we are the Messengers from your Lord! They shall not reach you!  So travel with your family in a part of the night, and let not any of  you look back, but your wife (will remain behind), verily, the  punishment which will afflict them, will afflict her. Indeed, morning  is their appointed time. Is not the morning near?”", "So when Our Commandment came, We turned  (the towns of Sodom in Palestine) upside down, and rained on them  stones of baked clay, piled up;", "Marked from your Lord, and they are not ever far from the Zâlimûn (polytheists, evil-doers, etc.).", "And to the Madyan (Midian) people (We  sent) their brother Shu’aib. He said: ”O my people! Worship Allâh, you  have no other Ilâh (God) but Him, and give not short measure or weight,  I see you in prosperity; and verily I fear for you the torment of a Day  encompassing.", "”And O my people! Give full measure and  weight in justice and reduce not the things that are due to the people,  and do not commit mischief in the land, causing corruption.", "”That which is left by Allâh for you  (after giving the rights of the people) is better for you, if you are  believers. And I am not set over you as a guardian.", "They said: ”O Shu’aib! Does your Salât  (prayer) (i.e. the prayers which you offer has spoiled your mind, so  you) command that we leave off what our fathers used to worship, or  that we leave off doing what we like with our property? Verily, you are  the forbearer, right-minded!” (They said this sarcastically).", "He said: ”O my people! Tell me, if I  have a clear evidence from my Lord, and He has given me a good  sustenance from Himself (shall I corrupt it by mixing it with the  unlawfully earned money). I wish not, in contradiction to you, to do  that which I forbid you. I only desire reform so far as I am able, to  the best of my power. And my guidance cannot come except from Allâh, in  Him I trust and unto Him I repent.", "”And O my people! Let not my Shiqâq  cause you to suffer the fate similar to that of the people of Nûh  (Noah) or of Hûd or of Sâlih (Saleh), and the people of Lout (Lot) are  not far off from you!", "”And ask forgiveness of your Lord and turn unto Him in repentance. Verily, my Lord is Most Merciful, Most Loving.”", "They said: ”O Shu’aib! We do not  understand much of what you say, and we see you a weak (man, it is said  that he was a blind man) among us. Were it not for your family, we  should certainly have stoned you and you are not powerful against us.”", "He said: ”O my people! Is then my family  of more weight with you than Allâh? And you have cast Him away behind  your backs. Verily, my Lord is surrounding all that you do.", "”And O my people! Act according to your  ability and way, and I am acting (on my way). You will come to know who  it is on whom descends the torment that will cover him with ignominy,  and who is a liar! And watch you! Verily, I too am watching with you.”", "And when Our Commandment came, We saved  Shu’aib and those who believed with him by a Mercy from Us. And  As-Saîhah (torment - awful cry, etc.) seized the wrong-doers, and they  lay (dead) prostrate in their homes.", "As if they had never lived there! So away with Madyan (Midian)! As away with Thamud! (All these nations were destroyed).", "And indeed We sent Mûsa (Moses) with Our  Ayât (proofs, evidences, verses, lessons, signs, revelations, etc.) and  a manifest authority;", "To Fir’aun (Pharaoh) and his chiefs, but  they followed the command of Fir’aun (Pharaoh), and the command of  Fir’aun (Pharaoh) was no right guide.", "He will go ahead of his people on the  Day of Resurrection, and will lead them into the Fire, and evil indeed  is the place to which they are led.", "They were pursued by a curse in this  (deceiving life of this world) and (so they will be pursued by a curse)  on the Day of Resurrection. How bad is the curse (in this world)  pursued by another curse (in the Hereafter).", "These are some of the news of the  (population of) towns which We relate unto you (O Muhammad SAW); of  them, some are standing, and some have been (already) reaped.", "We wronged them not, but they wronged  themselves. So their âliha (gods), other than Allâh, whom they invoked,  profited them naught when there came the Command of your Lord, nor did  they add aught (to their lot) but destruction.", "Such is the Seizure of your Lord when He  seizes the (population of) towns while they are doing wrong. Verily,  His Seizure is painful, and severe.", "Indeed in that (there) is a sure lesson  for those who fear the torment of the Hereafter. That is a Day whereon  mankind will be gathered together, and that is a Day when all (the  dwellers of the heavens and the earth) will be present.", "And We delay it only for a term (already) fixed.", "On the Day when it comes, no person  shall speak except by His (Allâh’s) Leave. Some among them will be  wretched and (others) blessed.", "As for those who are wretched, they will be in the Fire, sighing in a high and low tone.", "They will dwell therein for all the time  that the heavens and the earth endure, except as your Lord wills.  Verily, your Lord is the doer of what He wills.", "And those who are blessed, they will be  in Paradise, abiding therein for all the time that the heavens and the  earth endure, except as your Lord will, a gift without an end.", "So be not in doubt (O Muhammad SAW) as  to what these (pagans and polytheists) men worship. They worship  nothing but what their fathers worshipped before (them). And verily, We  shall repay them in full their portion without diminution.", "Indeed, We gave the Book to Mûsa  (Moses), but differences arose therein, and had it not been for a Word  that had gone forth before from your Lord, the case would have been  judged between them, and indeed they are in grave doubt concerning it  (this Qur’ân).", "And verily, to each of them your Lord will repay their works in full. Surely, He is All-Aware of what they do.", "So stand (ask Allâh to make) you  (Muhammad SAW) firm and straight (on the religion of Islâmic  Monotheism) as you are commanded and those (your companions) who turn  in repentance (unto Allâh) with you, and transgress not (Allâh’s legal  limits). Verily, He is All-Seer of what you do.", "And incline not toward those who do  wrong, lest the Fire should touch you, and you have no protectors other  than Allâh, nor you would then be helped.", "And perform As-Salât (Iqâmat-as-Salât),  at the two ends of the day and in some hours of the night [i.e. the  five compulsory Salât (prayers)]. Verily, the good deeds remove the  evil deeds (i.e. small sins). That is a reminder (an advice) for the  mindful (those who accept advice).", "And be patient; verily, Allâh loses not the reward of the good-doers.", "If only there had been among the  generations before you, persons having wisdom, prohibiting (others)  from Al-Fasâd (disbelief, polytheism, and all kinds of crimes and sins)  in the earth, except a few of those whom We saved from among them.  Those who did wrong pursued the enjoyment of good things of (this  worldly) life, and were Mujrimûn (criminals, disbelievers in Allâh,  polytheists, sinners, etc.).", ". And your Lord would never destroy the towns wrongfully, while their people were right-doers.", "And if your Lord had so willed, He could  surely have made mankind one Ummah [nation or community (following one  religion only i.e. Islâm)], but they will not cease to disagree,-", "Except him on whom your Lord has  bestowed His Mercy (the follower of truth - Islâmic Monotheism) and for  that did He create them. And the Word of your Lord has been fulfilled  (i.e. His Saying): ”Surely, I shall fill Hell with jinns and men all  together.”", "And all that We relate to you (O  Muhammad SAW) of the news of the Messengers is in order that We may  make strong and firm your heart thereby. And in this (chapter of the  Qur’an) has come to you the truth, as well as an admonition and a  reminder for the believers.", "And say to those who do not believe: ”Act according to your ability and way, We are acting (in our way).", "And you wait ! We (too) are waiting.”", "And to Allâh belongs the Ghaib (unseen)  of the heavens and the earth, and to Him return all affairs (for  decision). So worship Him (O Muhammad SAW) and put your trust in Him.  And your Lord is not unaware of what you (people) do.”"]}