{"name_ar": "سورة يوسف", "ayahs_ar": ["الر تِلْكَ آيَاتُ الْكِتَابِ الْمُبِينِ", "إِنَّا أَنزَلْنَاهُ قُرْآنًا عَرَبِيًّا لَّعَلَّكُمْ تَعْقِلُونَ", "نَحْنُ نَقُصُّ عَلَيْكَ أَحْسَنَ الْقَصَصِ بِمَا أَوْحَيْنَا إِلَيْكَ هَـذَا الْقُرْآنَ وَإِن كُنتَ مِن قَبْلِهِ لَمِنَ الْغَافِلِينَ", "إِذْ قَالَ يُوسُفُ لِأَبِيهِ يَا أَبتِ إِنِّي رَأَيْتُ أَحَدَ عَشَرَ كَوْكَبًا وَالشَّمْسَ وَالْقَمَرَ رَأَيْتُهُمْ لِي سَاجِدِينَ", "قَالَ يَا بُنَيَّ لاَ تَقْصُصْ رُؤْيَاكَ عَلَى إِخْوَتِكَ فَيَكِيدُواْ لَكَ كَيْدًا إِنَّ الشَّيْطَانَ لِلإِنسَانِ عَدُوٌّ مُّبِينٌ", "وَكَذَلِكَ يَجْتَبِيكَ رَبُّكَ وَيُعَلِّمُكَ مِن تَأْوِيلِ الأَحَادِيثِ وَيُتِمُّ نِعْمَتَهُ عَلَيْكَ وَعَلَى آلِ يَعْقُوبَ كَمَا أَتَمَّهَا عَلَى أَبَوَيْكَ مِن قَبْلُ إِبْرَاهِيمَ وَإِسْحَقَ إِنَّ رَبَّكَ عَلِيمٌ حَكِيمٌ", "لَّقَدْ كَانَ فِي يُوسُفَ وَإِخْوَتِهِ آيَاتٌ لِّلسَّائِلِينَ", "إِذْ قَالُواْ لَيُوسُفُ وَأَخُوهُ أَحَبُّ إِلَى أَبِينَا مِنَّا وَنَحْنُ عُصْبَةٌ إِنَّ أَبَانَا لَفِي ضَلاَلٍ مُّبِينٍ", "اقْتُلُواْ يُوسُفَ أَوِ اطْرَحُوهُ أَرْضًا يَخْلُ لَكُمْ وَجْهُ أَبِيكُمْ وَتَكُونُواْ مِن بَعْدِهِ قَوْمًا صَالِحِينَ", "قَالَ قَآئِلٌ مَّنْهُمْ لاَ تَقْتُلُواْ يُوسُفَ وَأَلْقُوهُ فِي غَيَابَةِ الْجُبِّ يَلْتَقِطْهُ بَعْضُ السَّيَّارَةِ إِن كُنتُمْ فَاعِلِينَ", "قَالُواْ يَا أَبَانَا مَا لَكَ لاَ تَأْمَنَّا عَلَى يُوسُفَ وَإِنَّا لَهُ لَنَاصِحُونَ", "أَرْسِلْهُ مَعَنَا غَدًا يَرْتَعْ وَيَلْعَبْ وَإِنَّا لَهُ لَحَافِظُونَ", "قَالَ إِنِّي لَيَحْزُنُنِي أَن تَذْهَبُواْ بِهِ وَأَخَافُ أَن يَأْكُلَهُ الذِّئْبُ وَأَنتُمْ عَنْهُ غَافِلُونَ", "قَالُواْ لَئِنْ أَكَلَهُ الذِّئْبُ وَنَحْنُ عُصْبَةٌ إِنَّا إِذًا لَّخَاسِرُونَ", "فَلَمَّا ذَهَبُواْ بِهِ وَأَجْمَعُواْ أَن يَجْعَلُوهُ فِي غَيَابَةِ الْجُبِّ وَأَوْحَيْنَآ إِلَيْهِ لَتُنَبِّئَنَّهُم بِأَمْرِهِمْ هَـذَا وَهُمْ لاَ يَشْعُرُونَ", "وَجَاؤُواْ أَبَاهُمْ عِشَاء يَبْكُونَ", "قَالُواْ يَا أَبَانَا إِنَّا ذَهَبْنَا نَسْتَبِقُ وَتَرَكْنَا يُوسُفَ عِندَ مَتَاعِنَا فَأَكَلَهُ الذِّئْبُ وَمَا أَنتَ بِمُؤْمِنٍ لِّنَا وَلَوْ كُنَّا صَادِقِينَ", "وَجَآؤُوا عَلَى قَمِيصِهِ بِدَمٍ كَذِبٍ قَالَ بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا فَصَبْرٌ جَمِيلٌ وَاللّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ", "وَجَاءتْ سَيَّارَةٌ فَأَرْسَلُواْ وَارِدَهُمْ فَأَدْلَى دَلْوَهُ قَالَ يَا بُشْرَى هَـذَا غُلاَمٌ وَأَسَرُّوهُ بِضَاعَةً وَاللّهُ عَلِيمٌ بِمَا يَعْمَلُونَ", "وَشَرَوْهُ بِثَمَنٍ بَخْسٍ دَرَاهِمَ مَعْدُودَةٍ وَكَانُواْ فِيهِ مِنَ الزَّاهِدِينَ", "وَقَالَ الَّذِي اشْتَرَاهُ مِن مِّصْرَ لاِمْرَأَتِهِ أَكْرِمِي مَثْوَاهُ عَسَى أَن يَنفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا وَكَذَلِكَ مَكَّنِّا لِيُوسُفَ فِي الأَرْضِ وَلِنُعَلِّمَهُ مِن تَأْوِيلِ الأَحَادِيثِ وَاللّهُ غَالِبٌ عَلَى أَمْرِهِ وَلَـكِنَّ أَكْثَرَ النَّاسِ لاَ يَعْلَمُونَ", "وَلَمَّا بَلَغَ أَشُدَّهُ آتَيْنَاهُ حُكْمًا وَعِلْمًا وَكَذَلِكَ نَجْزِي الْمُحْسِنِينَ", "وَرَاوَدَتْهُ الَّتِي هُوَ فِي بَيْتِهَا عَن نَّفْسِهِ وَغَلَّقَتِ الأَبْوَابَ وَقَالَتْ هَيْتَ لَكَ قَالَ مَعَاذَ اللّهِ إِنَّهُ رَبِّي أَحْسَنَ مَثْوَايَ إِنَّهُ لاَ يُفْلِحُ الظَّالِمُونَ", "وَلَقَدْ هَمَّتْ بِهِ وَهَمَّ بِهَا لَوْلا أَن رَّأَى بُرْهَانَ رَبِّهِ كَذَلِكَ لِنَصْرِفَ عَنْهُ السُّوءَ وَالْفَحْشَاء إِنَّهُ مِنْ عِبَادِنَا الْمُخْلَصِينَ", "وَاسُتَبَقَا الْبَابَ وَقَدَّتْ قَمِيصَهُ مِن دُبُرٍ وَأَلْفَيَا سَيِّدَهَا لَدَى الْبَابِ قَالَتْ مَا جَزَاء مَنْ أَرَادَ بِأَهْلِكَ سُوَءًا إِلاَّ أَن يُسْجَنَ أَوْ عَذَابٌ أَلِيمٌ", "قَالَ هِيَ رَاوَدَتْنِي عَن نَّفْسِي وَشَهِدَ شَاهِدٌ مِّنْ أَهْلِهَا إِن كَانَ قَمِيصُهُ قُدَّ مِن قُبُلٍ فَصَدَقَتْ وَهُوَ مِنَ الكَاذِبِينَ", "وَإِنْ كَانَ قَمِيصُهُ قُدَّ مِن دُبُرٍ فَكَذَبَتْ وَهُوَ مِن الصَّادِقِينَ", "فَلَمَّا رَأَى قَمِيصَهُ قُدَّ مِن دُبُرٍ قَالَ إِنَّهُ مِن كَيْدِكُنَّ إِنَّ كَيْدَكُنَّ عَظِيمٌ", "يُوسُفُ أَعْرِضْ عَنْ هَـذَا وَاسْتَغْفِرِي لِذَنبِكِ إِنَّكِ كُنتِ مِنَ الْخَاطِئِينَ", "وَقَالَ نِسْوَةٌ فِي الْمَدِينَةِ امْرَأَةُ الْعَزِيزِ تُرَاوِدُ فَتَاهَا عَن نَّفْسِهِ قَدْ شَغَفَهَا حُبًّا إِنَّا لَنَرَاهَا فِي ضَلاَلٍ مُّبِينٍ", "فَلَمَّا سَمِعَتْ بِمَكْرِهِنَّ أَرْسَلَتْ إِلَيْهِنَّ وَأَعْتَدَتْ لَهُنَّ مُتَّكَأً وَآتَتْ كُلَّ وَاحِدَةٍ مِّنْهُنَّ سِكِّينًا وَقَالَتِ اخْرُجْ عَلَيْهِنَّ فَلَمَّا رَأَيْنَهُ أَكْبَرْنَهُ وَقَطَّعْنَ أَيْدِيَهُنَّ وَقُلْنَ حَاشَ لِلّهِ مَا هَـذَا بَشَرًا إِنْ هَـذَا إِلاَّ مَلَكٌ كَرِيمٌ", "قَالَتْ فَذَلِكُنَّ الَّذِي لُمْتُنَّنِي فِيهِ وَلَقَدْ رَاوَدتُّهُ عَن نَّفْسِهِ فَاسَتَعْصَمَ وَلَئِن لَّمْ يَفْعَلْ مَا آمُرُهُ لَيُسْجَنَنَّ وَلَيَكُونًا مِّنَ الصَّاغِرِينَ", "قَالَ رَبِّ السِّجْنُ أَحَبُّ إِلَيَّ مِمَّا يَدْعُونَنِي إِلَيْهِ وَإِلاَّ تَصْرِفْ عَنِّي كَيْدَهُنَّ أَصْبُ إِلَيْهِنَّ وَأَكُن مِّنَ الْجَاهِلِينَ", "فَاسْتَجَابَ لَهُ رَبُّهُ فَصَرَفَ عَنْهُ كَيْدَهُنَّ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ", "ثُمَّ بَدَا لَهُم مِّن بَعْدِ مَا رَأَوُاْ الآيَاتِ لَيَسْجُنُنَّهُ حَتَّى حِينٍ", "وَدَخَلَ مَعَهُ السِّجْنَ فَتَيَانَ قَالَ أَحَدُهُمَآ إِنِّي أَرَانِي أَعْصِرُ خَمْرًا وَقَالَ الآخَرُ إِنِّي أَرَانِي أَحْمِلُ فَوْقَ رَأْسِي خُبْزًا تَأْكُلُ الطَّيْرُ مِنْهُ نَبِّئْنَا بِتَأْوِيلِهِ إِنَّا نَرَاكَ مِنَ الْمُحْسِنِينَ", "قَالَ لاَ يَأْتِيكُمَا طَعَامٌ تُرْزَقَانِهِ إِلاَّ نَبَّأْتُكُمَا بِتَأْوِيلِهِ قَبْلَ أَن يَأْتِيكُمَا ذَلِكُمَا مِمَّا عَلَّمَنِي رَبِّي إِنِّي تَرَكْتُ مِلَّةَ قَوْمٍ لاَّ يُؤْمِنُونَ بِاللّهِ وَهُم بِالآخِرَةِ هُمْ كَافِرُونَ", "وَاتَّبَعْتُ مِلَّةَ آبَآئِـي إِبْرَاهِيمَ وَإِسْحَقَ وَيَعْقُوبَ مَا كَانَ لَنَا أَن نُّشْرِكَ بِاللّهِ مِن شَيْءٍ ذَلِكَ مِن فَضْلِ اللّهِ عَلَيْنَا وَعَلَى النَّاسِ وَلَـكِنَّ أَكْثَرَ النَّاسِ لاَ يَشْكُرُونَ", "يَا صَاحِبَيِ السِّجْنِ أَأَرْبَابٌ مُّتَفَرِّقُونَ خَيْرٌ أَمِ اللّهُ الْوَاحِدُ الْقَهَّارُ", "مَا تَعْبُدُونَ مِن دُونِهِ إِلاَّ أَسْمَاء سَمَّيْتُمُوهَا أَنتُمْ وَآبَآؤُكُم مَّا أَنزَلَ اللّهُ بِهَا مِن سُلْطَانٍ إِنِ الْحُكْمُ إِلاَّ لِلّهِ أَمَرَ أَلاَّ تَعْبُدُواْ إِلاَّ إِيَّاهُ ذَلِكَ الدِّينُ الْقَيِّمُ وَلَـكِنَّ أَكْثَرَ النَّاسِ لاَ يَعْلَمُونَ", "يَا صَاحِبَيِ السِّجْنِ أَمَّا أَحَدُكُمَا فَيَسْقِي رَبَّهُ خَمْرًا وَأَمَّا الآخَرُ فَيُصْلَبُ فَتَأْكُلُ الطَّيْرُ مِن رَّأْسِهِ قُضِيَ الأَمْرُ الَّذِي فِيهِ تَسْتَفْتِيَانِ", "وَقَالَ لِلَّذِي ظَنَّ أَنَّهُ نَاجٍ مِّنْهُمَا اذْكُرْنِي عِندَ رَبِّكَ فَأَنسَاهُ الشَّيْطَانُ ذِكْرَ رَبِّهِ فَلَبِثَ فِي السِّجْنِ بِضْعَ سِنِينَ", "وَقَالَ الْمَلِكُ إِنِّي أَرَى سَبْعَ بَقَرَاتٍ سِمَانٍ يَأْكُلُهُنَّ سَبْعٌ عِجَافٌ وَسَبْعَ سُنبُلاَتٍ خُضْرٍ وَأُخَرَ يَابِسَاتٍ يَا أَيُّهَا الْمَلأُ أَفْتُونِي فِي رُؤْيَايَ إِن كُنتُمْ لِلرُّؤْيَا تَعْبُرُونَ", "قَالُواْ أَضْغَاثُ أَحْلاَمٍ وَمَا نَحْنُ بِتَأْوِيلِ الأَحْلاَمِ بِعَالِمِينَ", "وَقَالَ الَّذِي نَجَا مِنْهُمَا وَادَّكَرَ بَعْدَ أُمَّةٍ أَنَاْ أُنَبِّئُكُم بِتَأْوِيلِهِ فَأَرْسِلُونِ", "يُوسُفُ أَيُّهَا الصِّدِّيقُ أَفْتِنَا فِي سَبْعِ بَقَرَاتٍ سِمَانٍ يَأْكُلُهُنَّ سَبْعٌ عِجَافٌ وَسَبْعِ سُنبُلاَتٍ خُضْرٍ وَأُخَرَ يَابِسَاتٍ لَّعَلِّي أَرْجِعُ إِلَى النَّاسِ لَعَلَّهُمْ يَعْلَمُونَ", "قَالَ تَزْرَعُونَ سَبْعَ سِنِينَ دَأَبًا فَمَا حَصَدتُّمْ فَذَرُوهُ فِي سُنبُلِهِ إِلاَّ قَلِيلاً مِّمَّا تَأْكُلُونَ", "ثُمَّ يَأْتِي مِن بَعْدِ ذَلِكَ سَبْعٌ شِدَادٌ يَأْكُلْنَ مَا قَدَّمْتُمْ لَهُنَّ إِلاَّ قَلِيلاً مِّمَّا تُحْصِنُونَ", "ثُمَّ يَأْتِي مِن بَعْدِ ذَلِكَ عَامٌ فِيهِ يُغَاثُ النَّاسُ وَفِيهِ يَعْصِرُونَ", "وَقَالَ الْمَلِكُ ائْتُونِي بِهِ فَلَمَّا جَاءهُ الرَّسُولُ قَالَ ارْجِعْ إِلَى رَبِّكَ فَاسْأَلْهُ مَا بَالُ النِّسْوَةِ اللاَّتِي قَطَّعْنَ أَيْدِيَهُنَّ إِنَّ رَبِّي بِكَيْدِهِنَّ عَلِيمٌ", "قَالَ مَا خَطْبُكُنَّ إِذْ رَاوَدتُّنَّ يُوسُفَ عَن نَّفْسِهِ قُلْنَ حَاشَ لِلّهِ مَا عَلِمْنَا عَلَيْهِ مِن سُوءٍ قَالَتِ امْرَأَةُ الْعَزِيزِ الآنَ حَصْحَصَ الْحَقُّ أَنَاْ رَاوَدتُّهُ عَن نَّفْسِهِ وَإِنَّهُ لَمِنَ الصَّادِقِينَ", "ذَلِكَ لِيَعْلَمَ أَنِّي لَمْ أَخُنْهُ بِالْغَيْبِ وَأَنَّ اللّهَ لاَ يَهْدِي كَيْدَ الْخَائِنِينَ", "وَمَا أُبَرِّىءُ نَفْسِي إِنَّ النَّفْسَ لأَمَّارَةٌ بِالسُّوءِ إِلاَّ مَا رَحِمَ رَبِّيَ إِنَّ رَبِّي غَفُورٌ رَّحِيمٌ", "وَقَالَ الْمَلِكُ ائْتُونِي بِهِ أَسْتَخْلِصْهُ لِنَفْسِي فَلَمَّا كَلَّمَهُ قَالَ إِنَّكَ الْيَوْمَ لَدَيْنَا مِكِينٌ أَمِينٌ", "قَالَ اجْعَلْنِي عَلَى خَزَآئِنِ الأَرْضِ إِنِّي حَفِيظٌ عَلِيمٌ", "وَكَذَلِكَ مَكَّنِّا لِيُوسُفَ فِي الأَرْضِ يَتَبَوَّأُ مِنْهَا حَيْثُ يَشَاء نُصِيبُ بِرَحْمَتِنَا مَن نَّشَاء وَلاَ نُضِيعُ أَجْرَ الْمُحْسِنِينَ", "وَلَأَجْرُ الآخِرَةِ خَيْرٌ لِّلَّذِينَ آمَنُواْ وَكَانُواْ يَتَّقُونَ", "وَجَاء إِخْوَةُ يُوسُفَ فَدَخَلُواْ عَلَيْهِ فَعَرَفَهُمْ وَهُمْ لَهُ مُنكِرُونَ", "وَلَمَّا جَهَّزَهُم بِجَهَازِهِمْ قَالَ ائْتُونِي بِأَخٍ لَّكُم مِّنْ أَبِيكُمْ أَلاَ تَرَوْنَ أَنِّي أُوفِي الْكَيْلَ وَأَنَاْ خَيْرُ الْمُنزِلِينَ", "فَإِن لَّمْ تَأْتُونِي بِهِ فَلاَ كَيْلَ لَكُمْ عِندِي وَلاَ تَقْرَبُونِ", "قَالُواْ سَنُرَاوِدُ عَنْهُ أَبَاهُ وَإِنَّا لَفَاعِلُونَ", "وَقَالَ لِفِتْيَانِهِ اجْعَلُواْ بِضَاعَتَهُمْ فِي رِحَالِهِمْ لَعَلَّهُمْ يَعْرِفُونَهَا إِذَا انقَلَبُواْ إِلَى أَهْلِهِمْ لَعَلَّهُمْ يَرْجِعُونَ", "فَلَمَّا رَجِعُوا إِلَى أَبِيهِمْ قَالُواْ يَا أَبَانَا مُنِعَ مِنَّا الْكَيْلُ فَأَرْسِلْ مَعَنَا أَخَانَا نَكْتَلْ وَإِنَّا لَهُ لَحَافِظُونَ", "قَالَ هَلْ آمَنُكُمْ عَلَيْهِ إِلاَّ كَمَا أَمِنتُكُمْ عَلَى أَخِيهِ مِن قَبْلُ فَاللّهُ خَيْرٌ حَافِظًا وَهُوَ أَرْحَمُ الرَّاحِمِينَ", "وَلَمَّا فَتَحُواْ مَتَاعَهُمْ وَجَدُواْ بِضَاعَتَهُمْ رُدَّتْ إِلَيْهِمْ قَالُواْ يَا أَبَانَا مَا نَبْغِي هَـذِهِ بِضَاعَتُنَا رُدَّتْ إِلَيْنَا وَنَمِيرُ أَهْلَنَا وَنَحْفَظُ أَخَانَا وَنَزْدَادُ كَيْلَ بَعِيرٍ ذَلِكَ كَيْلٌ يَسِيرٌ", "قَالَ لَنْ أُرْسِلَهُ مَعَكُمْ حَتَّى تُؤْتُونِ مَوْثِقًا مِّنَ اللّهِ لَتَأْتُنَّنِي بِهِ إِلاَّ أَن يُحَاطَ بِكُمْ فَلَمَّا آتَوْهُ مَوْثِقَهُمْ قَالَ اللّهُ عَلَى مَا نَقُولُ وَكِيلٌ", "وَقَالَ يَا بَنِيَّ لاَ تَدْخُلُواْ مِن بَابٍ وَاحِدٍ وَادْخُلُواْ مِنْ أَبْوَابٍ مُّتَفَرِّقَةٍ وَمَا أُغْنِي عَنكُم مِّنَ اللّهِ مِن شَيْءٍ إِنِ الْحُكْمُ إِلاَّ لِلّهِ عَلَيْهِ تَوَكَّلْتُ وَعَلَيْهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ", "وَلَمَّا دَخَلُواْ مِنْ حَيْثُ أَمَرَهُمْ أَبُوهُم مَّا كَانَ يُغْنِي عَنْهُم مِّنَ اللّهِ مِن شَيْءٍ إِلاَّ حَاجَةً فِي نَفْسِ يَعْقُوبَ قَضَاهَا وَإِنَّهُ لَذُو عِلْمٍ لِّمَا عَلَّمْنَاهُ وَلَـكِنَّ أَكْثَرَ النَّاسِ لاَ يَعْلَمُونَ", "وَلَمَّا دَخَلُواْ عَلَى يُوسُفَ آوَى إِلَيْهِ أَخَاهُ قَالَ إِنِّي أَنَاْ أَخُوكَ فَلاَ تَبْتَئِسْ بِمَا كَانُواْ يَعْمَلُونَ", "فَلَمَّا جَهَّزَهُم بِجَهَازِهِمْ جَعَلَ السِّقَايَةَ فِي رَحْلِ أَخِيهِ ثُمَّ أَذَّنَ مُؤَذِّنٌ أَيَّتُهَا الْعِيرُ إِنَّكُمْ لَسَارِقُونَ", "قَالُواْ وَأَقْبَلُواْ عَلَيْهِم مَّاذَا تَفْقِدُونَ", "قَالُواْ نَفْقِدُ صُوَاعَ الْمَلِكِ وَلِمَن جَاء بِهِ حِمْلُ بَعِيرٍ وَأَنَاْ بِهِ زَعِيمٌ", "قَالُواْ تَاللّهِ لَقَدْ عَلِمْتُم مَّا جِئْنَا لِنُفْسِدَ فِي الأَرْضِ وَمَا كُنَّا سَارِقِينَ", "قَالُواْ فَمَا جَزَآؤُهُ إِن كُنتُمْ كَاذِبِينَ", "قَالُواْ جَزَآؤُهُ مَن وُجِدَ فِي رَحْلِهِ فَهُوَ جَزَاؤُهُ كَذَلِكَ نَجْزِي الظَّالِمِينَ", "فَبَدَأَ بِأَوْعِيَتِهِمْ قَبْلَ وِعَاء أَخِيهِ ثُمَّ اسْتَخْرَجَهَا مِن وِعَاء أَخِيهِ كَذَلِكَ كِدْنَا لِيُوسُفَ مَا كَانَ لِيَأْخُذَ أَخَاهُ فِي دِينِ الْمَلِكِ إِلاَّ أَن يَشَاء اللّهُ نَرْفَعُ دَرَجَاتٍ مِّن نَّشَاء وَفَوْقَ كُلِّ ذِي عِلْمٍ عَلِيمٌ", "قَالُواْ إِن يَسْرِقْ فَقَدْ سَرَقَ أَخٌ لَّهُ مِن قَبْلُ فَأَسَرَّهَا يُوسُفُ فِي نَفْسِهِ وَلَمْ يُبْدِهَا لَهُمْ قَالَ أَنتُمْ شَرٌّ مَّكَانًا وَاللّهُ أَعْلَمْ بِمَا تَصِفُونَ", "قَالُواْ يَا أَيُّهَا الْعَزِيزُ إِنَّ لَهُ أَبًا شَيْخًا كَبِيرًا فَخُذْ أَحَدَنَا مَكَانَهُ إِنَّا نَرَاكَ مِنَ الْمُحْسِنِينَ", "قَالَ مَعَاذَ اللّهِ أَن نَّأْخُذَ إِلاَّ مَن وَجَدْنَا مَتَاعَنَا عِندَهُ إِنَّـآ إِذًا لَّظَالِمُونَ", "فَلَمَّا اسْتَيْأَسُواْ مِنْهُ خَلَصُواْ نَجِيًّا قَالَ كَبِيرُهُمْ أَلَمْ تَعْلَمُواْ أَنَّ أَبَاكُمْ قَدْ أَخَذَ عَلَيْكُم مَّوْثِقًا مِّنَ اللّهِ وَمِن قَبْلُ مَا فَرَّطتُمْ فِي يُوسُفَ فَلَنْ أَبْرَحَ الأَرْضَ حَتَّىَ يَأْذَنَ لِي أَبِي أَوْ يَحْكُمَ اللّهُ لِي وَهُوَ خَيْرُ الْحَاكِمِينَ", "ارْجِعُواْ إِلَى أَبِيكُمْ فَقُولُواْ يَا أَبَانَا إِنَّ ابْنَكَ سَرَقَ وَمَا شَهِدْنَا إِلاَّ بِمَا عَلِمْنَا وَمَا كُنَّا لِلْغَيْبِ حَافِظِينَ", "وَاسْأَلِ الْقَرْيَةَ الَّتِي كُنَّا فِيهَا وَالْعِيْرَ الَّتِي أَقْبَلْنَا فِيهَا وَإِنَّا لَصَادِقُونَ", "قَالَ بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا فَصَبْرٌ جَمِيلٌ عَسَى اللّهُ أَن يَأْتِيَنِي بِهِمْ جَمِيعًا إِنَّهُ هُوَ الْعَلِيمُ الْحَكِيمُ", "وَتَوَلَّى عَنْهُمْ وَقَالَ يَا أَسَفَى عَلَى يُوسُفَ وَابْيَضَّتْ عَيْنَاهُ مِنَ الْحُزْنِ فَهُوَ كَظِيمٌ", "قَالُواْ تَالله تَفْتَأُ تَذْكُرُ يُوسُفَ حَتَّى تَكُونَ حَرَضًا أَوْ تَكُونَ مِنَ الْهَالِكِينَ", "قَالَ إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللّهِ وَأَعْلَمُ مِنَ اللّهِ مَا لاَ تَعْلَمُونَ", "يَا بَنِيَّ اذْهَبُواْ فَتَحَسَّسُواْ مِن يُوسُفَ وَأَخِيهِ وَلاَ تَيْأَسُواْ مِن رَّوْحِ اللّهِ إِنَّهُ لاَ يَيْأَسُ مِن رَّوْحِ اللّهِ إِلاَّ الْقَوْمُ الْكَافِرُونَ", "فَلَمَّا دَخَلُواْ عَلَيْهِ قَالُواْ يَا أَيُّهَا الْعَزِيزُ مَسَّنَا وَأَهْلَنَا الضُّرُّ وَجِئْنَا بِبِضَاعَةٍ مُّزْجَاةٍ فَأَوْفِ لَنَا الْكَيْلَ وَتَصَدَّقْ عَلَيْنَآ إِنَّ اللّهَ يَجْزِي الْمُتَصَدِّقِينَ", "قَالَ هَلْ عَلِمْتُم مَّا فَعَلْتُم بِيُوسُفَ وَأَخِيهِ إِذْ أَنتُمْ جَاهِلُونَ", "قَالُواْ أَإِنَّكَ لَأَنتَ يُوسُفُ قَالَ أَنَاْ يُوسُفُ وَهَـذَا أَخِي قَدْ مَنَّ اللّهُ عَلَيْنَا إِنَّهُ مَن يَتَّقِ وَيِصْبِرْ فَإِنَّ اللّهَ لاَ يُضِيعُ أَجْرَ الْمُحْسِنِينَ", "قَالُواْ تَاللّهِ لَقَدْ آثَرَكَ اللّهُ عَلَيْنَا وَإِن كُنَّا لَخَاطِئِينَ", "قَالَ لاَ تَثْرَيبَ عَلَيْكُمُ الْيَوْمَ يَغْفِرُ اللّهُ لَكُمْ وَهُوَ أَرْحَمُ الرَّاحِمِينَ", "اذْهَبُواْ بِقَمِيصِي هَـذَا فَأَلْقُوهُ عَلَى وَجْهِ أَبِي يَأْتِ بَصِيرًا وَأْتُونِي بِأَهْلِكُمْ أَجْمَعِينَ", "وَلَمَّا فَصَلَتِ الْعِيرُ قَالَ أَبُوهُمْ إِنِّي لَأَجِدُ رِيحَ يُوسُفَ لَوْلاَ أَن تُفَنِّدُونِ", "قَالُواْ تَاللّهِ إِنَّكَ لَفِي ضَلاَلِكَ الْقَدِيمِ", "فَلَمَّا أَن جَاء الْبَشِيرُ أَلْقَاهُ عَلَى وَجْهِهِ فَارْتَدَّ بَصِيرًا قَالَ أَلَمْ أَقُل لَّكُمْ إِنِّي أَعْلَمُ مِنَ اللّهِ مَا لاَ تَعْلَمُونَ", "قَالُواْ يَا أَبَانَا اسْتَغْفِرْ لَنَا ذُنُوبَنَا إِنَّا كُنَّا خَاطِئِينَ", "قَالَ سَوْفَ أَسْتَغْفِرُ لَكُمْ رَبِّيَ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ", "فَلَمَّا دَخَلُواْ عَلَى يُوسُفَ آوَى إِلَيْهِ أَبَوَيْهِ وَقَالَ ادْخُلُواْ مِصْرَ إِن شَاء اللّهُ آمِنِينَ", "وَرَفَعَ أَبَوَيْهِ عَلَى الْعَرْشِ وَخَرُّواْ لَهُ سُجَّدًا وَقَالَ يَا أَبَتِ هَـذَا تَأْوِيلُ رُؤْيَايَ مِن قَبْلُ قَدْ جَعَلَهَا رَبِّي حَقًّا وَقَدْ أَحْسَنَ بَي إِذْ أَخْرَجَنِي مِنَ السِّجْنِ وَجَاء بِكُم مِّنَ الْبَدْوِ مِن بَعْدِ أَن نَّزغَ الشَّيْطَانُ بَيْنِي وَبَيْنَ إِخْوَتِي إِنَّ رَبِّي لَطِيفٌ لِّمَا يَشَاء إِنَّهُ هُوَ الْعَلِيمُ الْحَكِيمُ", "رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِن تَأْوِيلِ الأَحَادِيثِ فَاطِرَ السَّمَاوَاتِ وَالأَرْضِ أَنتَ وَلِيِّي فِي الدُّنُيَا وَالآخِرَةِ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ", "ذَلِكَ مِنْ أَنبَاء الْغَيْبِ نُوحِيهِ إِلَيْكَ وَمَا كُنتَ لَدَيْهِمْ إِذْ أَجْمَعُواْ أَمْرَهُمْ وَهُمْ يَمْكُرُونَ", "وَمَا أَكْثَرُ النَّاسِ وَلَوْ حَرَصْتَ بِمُؤْمِنِينَ", "وَمَا تَسْأَلُهُمْ عَلَيْهِ مِنْ أَجْرٍ إِنْ هُوَ إِلاَّ ذِكْرٌ لِّلْعَالَمِينَ", "وَكَأَيِّن مِّن آيَةٍ فِي السَّمَاوَاتِ وَالأَرْضِ يَمُرُّونَ عَلَيْهَا وَهُمْ عَنْهَا مُعْرِضُونَ", "وَمَا يُؤْمِنُ أَكْثَرُهُمْ بِاللّهِ إِلاَّ وَهُم مُّشْرِكُونَ", "أَفَأَمِنُواْ أَن تَأْتِيَهُمْ غَاشِيَةٌ مِّنْ عَذَابِ اللّهِ أَوْ تَأْتِيَهُمُ السَّاعَةُ بَغْتَةً وَهُمْ لاَ يَشْعُرُونَ", "قُلْ هَـذِهِ سَبِيلِي أَدْعُو إِلَى اللّهِ عَلَى بَصِيرَةٍ أَنَاْ وَمَنِ اتَّبَعَنِي وَسُبْحَانَ اللّهِ وَمَا أَنَاْ مِنَ الْمُشْرِكِينَ", "وَمَا أَرْسَلْنَا مِن قَبْلِكَ إِلاَّ رِجَالاً نُّوحِي إِلَيْهِم مِّنْ أَهْلِ الْقُرَى أَفَلَمْ يَسِيرُواْ فِي الأَرْضِ فَيَنظُرُواْ كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِن قَبْلِهِمْ وَلَدَارُ الآخِرَةِ خَيْرٌ لِّلَّذِينَ اتَّقَواْ أَفَلاَ تَعْقِلُونَ", "حَتَّى إِذَا اسْتَيْأَسَ الرُّسُلُ وَظَنُّواْ أَنَّهُمْ قَدْ كُذِبُواْ جَاءهُمْ نَصْرُنَا فَنُجِّيَ مَن نَّشَاء وَلاَ يُرَدُّ بَأْسُنَا عَنِ الْقَوْمِ الْمُجْرِمِينَ", "لَقَدْ كَانَ فِي قَصَصِهِمْ عِبْرَةٌ لِّأُوْلِي الأَلْبَابِ مَا كَانَ حَدِيثًا يُفْتَرَى وَلَـكِن تَصْدِيقَ الَّذِي بَيْنَ يَدَيْهِ وَتَفْصِيلَ كُلَّ شَيْءٍ وَهُدًى وَرَحْمَةً لِّقَوْمٍ يُؤْمِنُونَ"], "name_en": "Yusuf", "ayahs_en": ["Alif-Lâm-Râ. [These letters are one of  the miracles of the Qur’an, and none but Allâh (Alone) knows their  meanings]. These are the Verses of the Clear Book (the Qur’ân that  makes clear the legal and illegal things, legal laws, a guidance and a  blessing).", "Verily, We have sent it down as an Arabic Qur’ân in order that you may understand.", "We relate unto you (Muhammad SAW) the  best of stories through Our Revelations unto you, of this Qur’ân. And  before this (i.e. before the coming of Divine Inspiration to you), you  were among those who knew nothing about it (the Qur’ân).", "(Remember) when Yûsuf (Joseph) said to  his father: ”O my father! Verily, I saw (in a dream) eleven stars and  the sun and the moon, I saw them prostrating themselves to me.”", "He (the father) said: ”O my son! Relate  not your vision to your brothers, lest they arrange a plot against you.  Verily! Shaitân (Satan) is to man an open enemy!", "”Thus will your Lord choose you and  teach you the interpretation of dreams (and other things) and perfect  His Favour on you and on the offspring of Ya’qûb (Jacob), as He  perfected it on your fathers, Ibrahîm (Abraham) and Ishâque (Isaac)  aforetime! Verily, your Lord is All-Knowing, All-Wise.”", "Verily, in Yûsuf (Joseph) and his  brethren, there were Ayât (proofs, evidences, verses, lessons, signs,  revelations, etc.) for those who ask.", "When they said: ”Truly, Yûsuf (Joseph)  and his brother (Benjamin) are loved more by our father than we, but we  are ’Usbah (a strong group). Really, our father is in a plain error.", "”Kill Yûsuf (Joseph) or cast him out to  some (other) land, so that the favour of your father may be given to  you alone, and after that you will be righteous folk (by intending  repentance before committing the sin).”", "One from among them said: ”Kill not  Yûsuf (Joseph), but if you must do something, throw him down to the  bottom of a well, he will be picked up by some caravan of travellers.”", "They said: ”O our father! Why do you not trust us with Yûsuf (Joseph), - when we are indeed his well-wishers?”", "”Send him with us tomorrow to enjoy himself and play, and verily, we will take care of him.”", "He [Ya’qûb (Jacob)] said: ”Truly, it  saddens me that you should take him away. I fear lest a wolf should  devour him, while you are careless of him.”", "They said: ”If a wolf devours him, while we are ’Usbah (a strong group) (to guard him), then surely, we are the losers.”", "So, when they took him away, they all  agreed to throw him down to the bottom of the well, and We inspired in  him:”Indeed, you shall (one day) inform them of this their affair, when  they know (you) not.”", "And they came to their father in the early part of the night weeping.", "They said:”O our father! We went racing  with one another, and left Yûsuf (Joseph) by our belongings and a wolf  devoured him; but you will never believe us even when we speak the  truth.”", "And they brought his shirt stained with  false blood. He said: ”Nay, but your ownselves have made up a tale. So  (for me) patience is most fitting. And it is Allâh (Alone) Whose help  can be sought against that which you assert.”", "And there came a caravan of travellers;  they sent their water-drawer, and he let down his bucket (into the  well). He said: ”What good news! Here is a boy.” So they hid him as  merchandise (a slave). And Allâh was the All-Knower of what they did.", "And they sold him for a low price, - for  a few Dirhams (i.e. for a few silver coins). And they were of those who  regarded him insignificant.", "And he (the man) from Egypt who bought  him, said to his wife: ”Make his stay comfortable, may be he will  profit us or we shall adopt him as a son.” Thus did We establish Yûsuf  (Joseph) in the land, that We might teach him the interpretation of  events. And Allâh has full power and control over His Affairs, but most  of men know not.", "And when he [Yûsuf (Joseph)] attained  his full manhood, We gave him wisdom and knowledge (the Prophethood),  thus We reward the Muhsinûn (doers of good - see V.2:112).", "And she, in whose house he was, sought  to seduce him (to do an evil act), she closed the doors and said: ”Come  on, O you.” He said: ”I seek refuge in Allâh (or Allâh forbid)! Truly,  he (your husband) is my master! He made my stay agreeable! (So I will  never betray him). Verily, the Zâlimûn (wrong and evil-doers) will  never be successful.”", "And indeed she did desire him and he  would have inclined to her desire, had he not seen the evidence of his  Lord. Thus it was, that We might turn away from him evil and illegal  sexual intercourse. Surely, he was one of Our chosen, guided slaves.", "So they raced with one another to the  door, and she tore his shirt from the back. They both found her lord  (i.e. her husband) at the door. She said: ”What is the recompense  (punishment) for him who intended an evil design against your wife,  except that he be put in prison or a painful torment?”", "He [Yûsuf (Joseph)] said: ”It was she  that sought to seduce me,” - and a witness of her household bore  witness (saying): ”If it be that his shirt is torn from the front, then  her tale is true and he is a liar!", "”But if it be that his shirt is torn from the back, then she has told a lie and he is speaking the truth!”", "So when he (her husband) saw his  [(Yûsuf’s (Joseph)] shirt torn at the back; (her husband) said:  ”Surely, it is a plot of you women! Certainly mighty is your plot!", "”O Yûsuf (Joseph)! Turn away from this! (O woman!) Ask forgiveness for your sin. Verily, you were of the sinful.”", "And women in the city said: ”The wife of  Al-’Azîz is seeking to seduce her (slave) young man, indeed she loves  him violently; verily we see her in plain error.”", "So when she heard of their accusation,  she sent for them and prepared a banquet for them; she gave each one of  them a knife (to cut the foodstuff with), and she said [(to Yûsuf  (Joseph)]: ”Come out before them.” Then, when they saw him, they  exalted him (at his beauty) and (in their astonishment) cut their  hands. They said: ”How perfect is Allâh (or Allâh forbid)! No man is  this! This is none other than a noble angel!”", "She said: ”This is he (the young man)  about whom you did blame me (for his love), and I did seek to seduce  him, but he refused. And now if he refuses to obey my order, he shall  certainly be cast into prison, and will be one of those who are  disgraced.”", "He said:”O my Lord! Prison is more to my  liking than that to which they invite me. Unless You turn away their  plot from me, I will feel inclined towards them and be one (of those  who commit sin and deserve blame or those who do deeds) of the  ignorants.”", "So his Lord answered his invocation and turned away from him their plot. Verily, He is the All-Hearer, the All-Knower.", "Then it appeared to them, after they had seen the proofs (of his innocence) to imprison him for a time.", "And there entered with him two young men  in the prison. One of them said: ”Verily, I saw myself (in a dream)  pressing wine.” The other said: ”Verily, I saw myself (in a dream)  carrying bread on my head and birds were eating thereof.” (They said):  ”Inform us of the interpretation of this. Verily, we think you are one  of the Muhsinûn (doers of good - see V.2:112).”", "He said: ”No food will come to you (in  wakefulness or in dream) as your provision, but I will inform (in  wakefulness) its interpretation before it (the food) comes. This is of  that which my Lord has taught me. Verily, I have abandoned the religion  of a people that believe not in Allâh and are disbelievers in the  Hereafter (i.e. the Kan’âniûn of Egypt who were polytheists and used to  worship sun and other false deities).", "”And I have followed the religion of my  fathers, - Ibrahîm (Abraham), Ishâque (Isaac) and Ya’qûb (Jacob) [ã ],  and never could we attribute any partners whatsoever to Allâh. This is  from the Grace of Allâh to us and to mankind, but most men thank not  (i.e. they neither believe in Allâh, nor worship Him).", "”O two companions of the prison! Are many different lords (gods) better or Allâh, the One, the Irresistible?", "”You do not worship besides Him but only  names which you have named (forged), you and your fathers, for which  Allâh has sent down no authority. The command (or the judgement) is for  none but Allâh. He has commanded that you worship none but Him (i.e.  His Monotheism), that is the (true) straight religion, but most men  know not.", "”O two companions of the prison! As for  one of you, he (as a servant) will pour out wine for his lord (king or  master) to drink; and as for the other, he will be crucified and birds  will eat from his head. Thus is the case judged concerning which you  both did inquire.”", "And he said to the one whom he knew to  be saved: ”Mention me to your lord (i.e. your king, so as to get me out  of the prison).” But Shaitân (Satan) made him forget to mention it to  his Lord [or Satan made [(Yûsuf (Joseph)] to forget the remembrance of  his Lord (Allâh) as to ask for His Help, instead of others]. So [Yûsuf  (Joseph)] stayed in prison a few (more) years.", "And the king (of Egypt) said: ”Verily, I  saw (in a dream) seven fat cows, whom seven lean ones were devouring -  and of seven green ears of corn, and (seven) others dry. O notables!  Explain to me my dream, if it be that you can interpret dreams.”", "They said: ”Mixed up false dreams and we are not skilled in the interpretation of dreams.”", "Then the man who was released (one of  the two who were in prison), now at length remembered and said: ”I will  tell you its interpretation, so send me forth.”", "(He said): ”O Yûsuf (Joseph), the man of  truth! Explain to us (the dream) of seven fat cows whom seven lean ones  were devouring, and of seven green ears of corn, and (seven) others  dry, that I may return to the people, and that they may know.”", "[(Yûsuf (Joseph)] said: ”For seven  consecutive years, you shall sow as usual and that (the harvest) which  you reap you shall leave in ears, (all) - except a little of it which  you may eat.", "”Then will come after that, seven hard  (years), which will devour what you have laid by in advance for them,  (all) except a little of that which you have guarded (stored).", "”Then thereafter will come a year in which people will have abundant rain and in which they will press (wine and oil).”", "And the king said: ”Bring him to me.”  But when the messenger came to him, [Yûsuf (Joseph)] said: ”Return to  your lord and ask him, ’What happened to the women who cut their hands?  Surely, my Lord (Allâh) is Well-Aware of their plot.’”", "(The King) said (to the women): ”What  was your affair when you did seek to seduce Yûsuf (Joseph)?” The women  said: ”Allâh forbid! No evil know we against him!” The wife of Al-’Azîz  said: ”Now the truth is manifest (to all), it was I who sought to  seduce him, and he is surely of the truthful.”", "[Then Yûsuf (Joseph) said: ”I asked for  this enquiry] in order that he (Al-’Azîz) may know that I betrayed him  not in secret. And, verily! Allâh guides not the plot of the betrayers.", "”And I free not myself (from the blame).  Verily, the (human) self is inclined to evil, except when my Lord  bestows His Mercy (upon whom He wills). Verily, my Lord is  Oft-Forgiving, Most Merciful.”", "And the king said: ”Bring him to me that  I may attach him to my person.” Then, when he spoke to him, he said:  ”Verily, this day, you are with us high in rank and fully trusted.”", "[Yûsuf (Joseph)] said: ”Set me over the  storehouses of the land; I will indeed guard them with full knowledge”  (as a minister of finance in Egypt, in place of Al-’Aziz who was dead  at that time).", "Thus did We give full authority to Yûsuf  (Joseph) in the land, to take possession therein, as when or where he  likes. We bestow of Our Mercy on whom We please, and We make not to be  lost the reward of Al-Muhsinûn (the good doers - see V.2:112).", "And verily, the reward of the Hereafter  is better for those who believe and used to fear Allâh and keep their  duty to Him (by abstaining from all kinds of sins and evil deeds and by  performing all kinds of righteous good deeds).", "And Yûsuf’s (Joseph) brethren came and they entered unto him, and he recognized them, but they recognized him not.", "And when he had furnished them forth  with provisions (according to their need), he said: ”Bring me a brother  of yours from your father; (he meant Benjamin). See you not that I give  full measure, and that I am the best of the hosts?", "”But if you bring him not to me, there shall be no measure (of corn) for you with me, nor shall you come near me.”", "They said: ”We shall try to get permission (for him) from his father, and verily, we shall do it.”", "And [Yûsuf (Joseph)] told his servants  to put their money (with which they had bought the corn) into their  bags, so that they might know it when they go back to their people, in  order that they might come back.", "So, when they returned to their father,  they said: ”O our father! No more measure of grain shall we get (unless  we take our brother). So send our brother with us, and we shall get our  measure and truly we will guard him.”", "He said: ”Can I entrust him to you  except as I entrusted his brother [Yûsuf (Joseph)] to you aforetime?  But Allâh is the Best to guard, and He is the Most Merciful of those  who show mercy.”", "And when they opened their bags, they  found their money had been returned to them. They said: ”O our father!  What (more) can we desire? This, our money has been returned to us, so  we shall get (more) food for our family, and we shall guard our brother  and add one more measure of a camel’s load. This quantity is easy (for  the king to give).”", "He [Ya’qûb (Jacob)] said: ”I will not  send him with you until you swear a solemn oath to me in Allâh’s Name,  that you will bring him back to me unless you are yourselves surrounded  (by enemies, etc.),” And when they had sworn their solemn oath, he  said: ”Allâh is the Witness over what we have said.”", "And he said: ”O my sons! Do not enter by  one gate, but enter by different gates, and I cannot avail you against  Allâh at all. Verily! The decision rests only with Allâh. In him, I put  my trust and let all those that trust, put their trust in Him.”", "And when they entered according to their  father’s advice, it did not avail them in the least against (the Will  of) Allâh, it was but a need of Ya’qûb’s (Jacob) inner-self which he  discharged. And verily, he was endowed with knowledge because We had  taught him, but most men know not.", "And when they went in before Yûsuf  (Joseph), he betook his brother (Benjamin) to himself and said:  ”Verily!I am your brother, so grieve not for what they used to do.”", "So when he had furnished them forth with  their provisions, he put the (golden) bowl into his brother’s bag, then  a crier cried: ”O you (in) the caravan! Surely, you are thieves!”", "They, turning towards them, said: ”What is it that you have missed?”", "They said: ”We have missed the (golden)  bowl of the king and for him who produces it is (the reward of) a camel  load; I will be bound by it.”", "They said: ”By Allâh! Indeed you know that we came not to make mischief in the land, and we are no thieves!”", "They [Yûsuf’s (Joseph) men] said: ”What then shall be the penalty of him, if you are (proved to be) liars.”", "They [Yûsuf’s (Joseph) brothers] said:  ”The penalty should be that he, in whose bag it is found, should be  held for the punishment (of the crime). Thus we punish the Zâlimûn  (wrong-doers, etc.)!”", "So he [Yûsuf (Joseph)] began (the  search) in their bags before the bag of his brother. Then he brought it  out of his brother’s bag. Thus did We plan for Yûsuf (Joseph). He could  not take his brother by the law of the king (as a slave), except that  Allâh willed it. (So Allâh made the brothers to bind themselves with  their way of ”punishment, i.e. enslaving of a thief.”) We raise to  degrees whom We please, but over all those endowed with knowledge is  the All-Knowing (Allâh).", "They [(Yûsuf’s (Joseph) brothers] said:  ”If he steals, there was a brother of his [Yûsuf (Joseph)] who did  steal before (him).” But these things did Yûsuf (Joseph) keep in  himself, revealing not the secrets to them. He said (within himself):  ”You are in worst case, and Allâh knows best the truth of what you  assert!”", "They said: ”O ruler of the land! Verily,  he has an old father (who will grieve for him); so take one of us in  his place. Indeed we think that you are one of the Muhsinûn (good-doers  - see V.2:112).”", "He said: ”Allâh forbid, that we should  take anyone but him with whom we found our property. Indeed (if we did  so), we should be Zâlimûn (wrong-doers).”", "So, when they despaired of him, they  held a conference in private. The eldest among them said: ”Know you not  that your father did take an oath from you in Allâh’s Name, and before  this you did fail in your duty with Yûsuf (Joseph)? Therefore I will  not leave this land until my father permits me, or Allâh decides my  case (by releasing Benjamin) and He is the Best of the judges.", "”Return to your father and say, ’O our  father! Verily, your son (Benjamin) has stolen, and we testify not  except according to what we know, and we could not know the unseen!", "”And ask (the people of) the town where  we have been, and the caravan in which we returned, and indeed we are  telling the truth.”", "He [Ya’qûb (Jacob)] said: ”Nay, but your  ownselves have beguiled you into something. So patience is most fitting  (for me). May be Allâh will bring them (back) all to me. Truly He! only  He is All-Knowing, All-Wise.”", "And he turned away from them and said:  ”Alas, my grief for Yûsuf (Joseph)!” And he lost his sight because of  the sorrow that he was suppressing.", "They said: ”By Allâh! You will never  cease remembering Yûsuf (Joseph) until you become weak with old age, or  until you be of the dead.”", "He said: ”I only complain of my grief and sorrow to Allâh, and I know from Allâh that which you know not.", "”O my sons! Go you and enquire about  Yûsuf (Joseph) and his brother, and never give up hope of Allâh’s  Mercy. Certainly no one despairs of Allâh’s Mercy, except the people  who disbelieve.”", "Then, when they entered unto him [Yûsuf  (Joseph)], they said: ”O ruler of the land! A hard time has hit us and  our family, and we have brought but poor capital, so pay us full  measure and be charitable to us. Truly, Allâh does reward the  charitable.”", "He said: ”Do you know what you did with Yûsuf (Joseph) and his brother, when you were ignorant?”", "They said: ”Are you indeed Yûsuf  (Joseph)?” He said: ”I am Yûsuf (Joseph), and this is my brother  (Benjamin). Allâh has indeed been gracious to us. Verily, he who fears  Allâh with obedience to Him (by abstaining from sins and evil deeds,  and by performing righteous good deeds), and is patient, then surely,  Allâh makes not the reward of the Muhsinûn (good-doers - see V.2:112)  to be lost.”", "They said: ”By Allâh! Indeed Allâh has preferred you above us, and we certainly have been sinners.”", "He said: ”No reproach on you this day, may Allâh forgive you, and He is the Most Merciful of those who show mercy!", "”Go with this shirt of mine, and cast it  over the face of my father, he will become clear-sighted, and bring to  me all your family.”", "And when the caravan departed, their  father said: ”I do indeed feel the smell of Yûsuf (Joseph), if only you  think me not a dotard (a person who has weakness of mind because of old  age).”", "They said: ”By Allâh! Certainly, you are in your old error.”", "Then, when the bearer of the glad  tidings arrived, he cast it (the shirt) over his face, and he became  clear-sighted. He said: ”Did I not say to you, ’I know from Allâh that  which you know not.’ ”", "They said: ”O our father! Ask forgiveness (from Allâh) for our sins, indeed we have been sinners.”", "He said: ”I will ask my Lord for forgiveness for you, verily He! Only He is the Oft-Forgiving, the Most Merciful.”", "Then, when they entered unto Yûsuf  (Joseph), he betook his parents to himself and said: ”Enter Egypt, if  Allâh wills, in security.”", "And he raised his parents to the throne  and they fell down before him prostrate. And he said: ”O my father!  This is the interpretation of my dream aforetime! My Lord has made it  come true! He was indeed good to me, when He took me out of the prison,  and brought you (all here) out of the bedouin-life, after Shaitân  (Satan) had sown enmity between me and my brothers. Certainly, my Lord  is the Most Courteous and Kind unto whom He will. Truly He! Only He is  the All-Knowing, the All-Wise.", "”My Lord! You have indeed bestowed on me  of the sovereignty, and taught me the interpretation of dreams; The  (only) Creator of the heavens and the earth! You are my Walî  (Protector, Helper, Supporter, Guardian, etc.) in this world and in the  Hereafter, cause me to die as a Muslim (the one submitting to Your  Will), and join me with the righteous.”", "This is of the news of the Ghaib  (unseen) which We reveal by Inspiration to you (O Muhammad SAW ). You  were not (present) with them when they arranged their plan together,  and (also, while) they were plotting.", "And most of mankind will not believe even if you desire it eagerly.", "And no reward you (O Muhammad SAW) ask  of them (those who deny your Prophethood) for it, it(the Qur’ân) is no  less than a Reminder and an advice unto the ’Alamîn (men and jinns).", "And how many a sign in the heavens and the earth they pass by, while they are averse therefrom.", "And most of them believe not in Allâh  except that they attribute partners unto Him [i.e. they are Mushrikûn  -polytheists - see Verse 6: 121].", "Do they then feel secure from the coming  against them of the covering veil of the Torment of Allâh, or of the  coming against them of the (Final) Hour, all of a sudden while they  perceive not?", "Say (O Muhammad SAW): ”This is my way; I  invite unto Allâh (i.e. to the Oneness of Allâh - Islâmic Monotheism)  with sure knowledge, I and whosoever follows me (also must invite  others to Allâh i.e to the Oneness of Allâh - Islâmic Monotheism) with  sure knowledge. And Glorified and Exalted be Allâh (above all that they  associate as partners with Him). And I am not of the Mushrikûn  (polytheists, pagans, idolaters and disbelievers in the Oneness of  Allâh; those who worship others along with Allâh or set up rivals or  partners to Allâh).”", "And We sent not before you (as  Messengers) any but men, whom We inspired from among the people of  townships. Have they not travelled through the earth and seen what was  the end of those who were before them? And verily, the home of the  Hereafter is the best for those who fear Allâh and obey Him (by  abstaining from sins and evil deeds, and by performing righteous good  deeds). Do you not then understand?", "(They were reprieved) until, when the  Messengers gave up hope and thought that they were denied (by their  people), then came to them Our Help, and whomsoever We willed were  delivered. And Our Punishment cannot be warded off from the people who  are Mujrimûn (criminals, disobedients to Allâh, sinners, disbelievers,  polytheists).", "Indeed in their stories, there is a  lesson for men of understanding. It (the Qur’an) is not a forged  statement but a confirmation of the Allâh’s existing Books [the Taurât  (Torah), the Injeel (Gospel) and other Scriptures of Allâh] and a  detailed explanation of everything and a guide and a Mercy for the  people who believe."]}