{"name_ar": "سورة إبراهيم", "ayahs_ar": ["الَر كِتَابٌ أَنزَلْنَاهُ إِلَيْكَ لِتُخْرِجَ النَّاسَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ بِإِذْنِ رَبِّهِمْ إِلَى صِرَاطِ الْعَزِيزِ الْحَمِيدِ", "اللّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ وَوَيْلٌ لِّلْكَافِرِينَ مِنْ عَذَابٍ شَدِيدٍ", "الَّذِينَ يَسْتَحِبُّونَ الْحَيَاةَ الدُّنْيَا عَلَى الآخِرَةِ وَيَصُدُّونَ عَن سَبِيلِ اللّهِ وَيَبْغُونَهَا عِوَجًا أُوْلَـئِكَ فِي ضَلاَلٍ بَعِيدٍ", "وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلاَّ بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ فَيُضِلُّ اللّهُ مَن يَشَاء وَيَهْدِي مَن يَشَاء وَهُوَ الْعَزِيزُ الْحَكِيمُ", "وَلَقَدْ أَرْسَلْنَا مُوسَى بِآيَاتِنَا أَنْ أَخْرِجْ قَوْمَكَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ وَذَكِّرْهُمْ بِأَيَّامِ اللّهِ إِنَّ فِي ذَلِكَ لآيَاتٍ لِّكُلِّ صَبَّارٍ شَكُورٍ", "وَإِذْ قَالَ مُوسَى لِقَوْمِهِ اذْكُرُواْ نِعْمَةَ اللّهِ عَلَيْكُمْ إِذْ أَنجَاكُم مِّنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ وَيُذَبِّحُونَ أَبْنَاءكُمْ وَيَسْتَحْيُونَ نِسَاءكُمْ وَفِي ذَلِكُم بَلاء مِّن رَّبِّكُمْ عَظِيمٌ", "وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِن شَكَرْتُمْ لأَزِيدَنَّكُمْ وَلَئِن كَفَرْتُمْ إِنَّ عَذَابِي لَشَدِيدٌ", "وَقَالَ مُوسَى إِن تَكْفُرُواْ أَنتُمْ وَمَن فِي الأَرْضِ جَمِيعًا فَإِنَّ اللّهَ لَغَنِيٌّ حَمِيدٌ", "أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ مِن قَبْلِكُمْ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ وَالَّذِينَ مِن بَعْدِهِمْ لاَ يَعْلَمُهُمْ إِلاَّ اللّهُ جَاءتْهُمْ رُسُلُهُم بِالْبَيِّنَاتِ فَرَدُّواْ أَيْدِيَهُمْ فِي أَفْوَاهِهِمْ وَقَالُواْ إِنَّا كَفَرْنَا بِمَا أُرْسِلْتُم بِهِ وَإِنَّا لَفِي شَكٍّ مِّمَّا تَدْعُونَنَا إِلَيْهِ مُرِيبٍ", "قَالَتْ رُسُلُهُمْ أَفِي اللّهِ شَكٌّ فَاطِرِ السَّمَاوَاتِ وَالأَرْضِ يَدْعُوكُمْ لِيَغْفِرَ لَكُم مِّن ذُنُوبِكُمْ وَيُؤَخِّرَكُمْ إِلَى أَجَلٍ مُّسَـمًّى قَالُواْ إِنْ أَنتُمْ إِلاَّ بَشَرٌ مِّثْلُنَا تُرِيدُونَ أَن تَصُدُّونَا عَمَّا كَانَ يَعْبُدُ آبَآؤُنَا فَأْتُونَا بِسُلْطَانٍ مُّبِينٍ", "قَالَتْ لَهُمْ رُسُلُهُمْ إِن نَّحْنُ إِلاَّ بَشَرٌ مِّثْلُكُمْ وَلَـكِنَّ اللّهَ يَمُنُّ عَلَى مَن يَشَاء مِنْ عِبَادِهِ وَمَا كَانَ لَنَا أَن نَّأْتِيَكُم بِسُلْطَانٍ إِلاَّ بِإِذْنِ اللّهِ وَعلَى اللّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ", "وَمَا لَنَا أَلاَّ نَتَوَكَّلَ عَلَى اللّهِ وَقَدْ هَدَانَا سُبُلَنَا وَلَنَصْبِرَنَّ عَلَى مَا آذَيْتُمُونَا وَعَلَى اللّهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ", "وَقَالَ الَّذِينَ كَفَرُواْ لِرُسُلِهِمْ لَنُخْرِجَنَّـكُم مِّنْ أَرْضِنَآ أَوْ لَتَعُودُنَّ فِي مِلَّتِنَا فَأَوْحَى إِلَيْهِمْ رَبُّهُمْ لَنُهْلِكَنَّ الظَّالِمِينَ", "وَلَنُسْكِنَنَّـكُمُ الأَرْضَ مِن بَعْدِهِمْ ذَلِكَ لِمَنْ خَافَ مَقَامِي وَخَافَ وَعِيدِ", "وَاسْتَفْتَحُواْ وَخَابَ كُلُّ جَبَّارٍ عَنِيدٍ", "مِّن وَرَآئِهِ جَهَنَّمُ وَيُسْقَى مِن مَّاء صَدِيدٍ", "يَتَجَرَّعُهُ وَلاَ يَكَادُ يُسِيغُهُ وَيَأْتِيهِ الْمَوْتُ مِن كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ وَمِن وَرَآئِهِ عَذَابٌ غَلِيظٌ", "مَّثَلُ الَّذِينَ كَفَرُواْ بِرَبِّهِمْ أَعْمَالُهُمْ كَرَمَادٍ اشْتَدَّتْ بِهِ الرِّيحُ فِي يَوْمٍ عَاصِفٍ لاَّ يَقْدِرُونَ مِمَّا كَسَبُواْ عَلَى شَيْءٍ ذَلِكَ هُوَ الضَّلاَلُ الْبَعِيدُ", "أَلَمْ تَرَ أَنَّ اللّهَ خَلَقَ السَّمَاوَاتِ وَالأَرْضَ بِالْحقِّ إِن يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ", "وَمَا ذَلِكَ عَلَى اللَّهِ بِعَزِيزٍ", "وَبَرَزُواْ لِلّهِ جَمِيعًا فَقَالَ الضُّعَفَاء لِلَّذِينَ اسْتَكْبَرُواْ إِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ أَنتُم مُّغْنُونَ عَنَّا مِنْ عَذَابِ اللّهِ مِن شَيْءٍ قَالُواْ لَوْ هَدَانَا اللّهُ لَهَدَيْنَاكُمْ سَوَاء عَلَيْنَآ أَجَزِعْنَا أَمْ صَبَرْنَا مَا لَنَا مِن مَّحِيصٍ", "وَقَالَ الشَّيْطَانُ لَمَّا قُضِيَ الأَمْرُ إِنَّ اللّهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَوَعَدتُّكُمْ فَأَخْلَفْتُكُمْ وَمَا كَانَ لِيَ عَلَيْكُم مِّن سُلْطَانٍ إِلاَّ أَن دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي فَلاَ تَلُومُونِي وَلُومُواْ أَنفُسَكُم مَّا أَنَاْ بِمُصْرِخِكُمْ وَمَا أَنتُمْ بِمُصْرِخِيَّ إِنِّي كَفَرْتُ بِمَآ أَشْرَكْتُمُونِ مِن قَبْلُ إِنَّ الظَّالِمِينَ لَهُمْ عَذَابٌ أَلِيمٌ", "وَأُدْخِلَ الَّذِينَ آمَنُواْ وَعَمِلُواْ الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا بِإِذْنِ رَبِّهِمْ تَحِيَّتُهُمْ فِيهَا سَلاَمٌ", "أَلَمْ تَرَ كَيْفَ ضَرَبَ اللّهُ مَثَلاً كَلِمَةً طَيِّبَةً كَشَجَرةٍ طَيِّبَةٍ أَصْلُهَا ثَابِتٌ وَفَرْعُهَا فِي السَّمَاء", "تُؤْتِي أُكُلَهَا كُلَّ حِينٍ بِإِذْنِ رَبِّهَا وَيَضْرِبُ اللّهُ الأَمْثَالَ لِلنَّاسِ لَعَلَّهُمْ يَتَذَكَّرُونَ", "وَمَثلُ كَلِمَةٍ خَبِيثَةٍ كَشَجَرَةٍ خَبِيثَةٍ اجْتُثَّتْ مِن فَوْقِ الأَرْضِ مَا لَهَا مِن قَرَارٍ", "يُثَبِّتُ اللّهُ الَّذِينَ آمَنُواْ بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الآخِرَةِ وَيُضِلُّ اللّهُ الظَّالِمِينَ وَيَفْعَلُ اللّهُ مَا يَشَاء", "أَلَمْ تَرَ إِلَى الَّذِينَ بَدَّلُواْ نِعْمَةَ اللّهِ كُفْرًا وَأَحَلُّواْ قَوْمَهُمْ دَارَ الْبَوَارِ", "جَهَنَّمَ يَصْلَوْنَهَا وَبِئْسَ الْقَرَارُ", "وَجَعَلُواْ لِلّهِ أَندَادًا لِّيُضِلُّواْ عَن سَبِيلِهِ قُلْ تَمَتَّعُواْ فَإِنَّ مَصِيرَكُمْ إِلَى النَّارِ", "قُل لِّعِبَادِيَ الَّذِينَ آمَنُواْ يُقِيمُواْ الصَّلاَةَ وَيُنفِقُواْ مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلانِيَةً مِّن قَبْلِ أَن يَأْتِيَ يَوْمٌ لاَّ بَيْعٌ فِيهِ وَلاَ خِلاَلٌ", "اللّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالأَرْضَ وَأَنزَلَ مِنَ السَّمَاء مَاء فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقًا لَّكُمْ وَسَخَّرَ لَكُمُ الْفُلْكَ لِتَجْرِيَ فِي الْبَحْرِ بِأَمْرِهِ وَسَخَّرَ لَكُمُ الأَنْهَارَ", "وَسَخَّر لَكُمُ الشَّمْسَ وَالْقَمَرَ دَآئِبَينَ وَسَخَّرَ لَكُمُ اللَّيْلَ وَالنَّهَارَ", "وَآتَاكُم مِّن كُلِّ مَا سَأَلْتُمُوهُ وَإِن تَعُدُّواْ نِعْمَتَ اللّهِ لاَ تُحْصُوهَا إِنَّ الإِنسَانَ لَظَلُومٌ كَفَّارٌ", "وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَـذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَن نَّعْبُدَ الأَصْنَامَ", "رَبِّ إِنَّهُنَّ أَضْلَلْنَ كَثِيرًا مِّنَ النَّاسِ فَمَن تَبِعَنِي فَإِنَّهُ مِنِّي وَمَنْ عَصَانِي فَإِنَّكَ غَفُورٌ رَّحِيمٌ", "رَّبَّنَا إِنِّي أَسْكَنتُ مِن ذُرِّيَّتِي بِوَادٍ غَيْرِ ذِي زَرْعٍ عِندَ بَيْتِكَ الْمُحَرَّمِ رَبَّنَا لِيُقِيمُواْ الصَّلاَةَ فَاجْعَلْ أَفْئِدَةً مِّنَ النَّاسِ تَهْوِي إِلَيْهِمْ وَارْزُقْهُم مِّنَ الثَّمَرَاتِ لَعَلَّهُمْ يَشْكُرُونَ", "رَبَّنَا إِنَّكَ تَعْلَمُ مَا نُخْفِي وَمَا نُعْلِنُ وَمَا يَخْفَى عَلَى اللّهِ مِن شَيْءٍ فَي الأَرْضِ وَلاَ فِي السَّمَاء", "الْحَمْدُ لِلّهِ الَّذِي وَهَبَ لِي عَلَى الْكِبَرِ إِسْمَاعِيلَ وَإِسْحَقَ إِنَّ رَبِّي لَسَمِيعُ الدُّعَاء", "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاء", "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ", "وَلاَ تَحْسَبَنَّ اللّهَ غَافِلاً عَمَّا يَعْمَلُ الظَّالِمُونَ إِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيهِ الأَبْصَارُ", "مُهْطِعِينَ مُقْنِعِي رُءُوسِهِمْ لاَ يَرْتَدُّ إِلَيْهِمْ طَرْفُهُمْ وَأَفْئِدَتُهُمْ هَوَاء", "وَأَنذِرِ النَّاسَ يَوْمَ يَأْتِيهِمُ الْعَذَابُ فَيَقُولُ الَّذِينَ ظَلَمُواْ رَبَّنَا أَخِّرْنَا إِلَى أَجَلٍ قَرِيبٍ نُّجِبْ دَعْوَتَكَ وَنَتَّبِعِ الرُّسُلَ أَوَلَمْ تَكُونُواْ أَقْسَمْتُم مِّن قَبْلُ مَا لَكُم مِّن زَوَالٍ", "وَسَكَنتُمْ فِي مَسَـاكِنِ الَّذِينَ ظَلَمُواْ أَنفُسَهُمْ وَتَبَيَّنَ لَكُمْ كَيْفَ فَعَلْنَا بِهِمْ وَضَرَبْنَا لَكُمُ الأَمْثَالَ", "وَقَدْ مَكَرُواْ مَكْرَهُمْ وَعِندَ اللّهِ مَكْرُهُمْ وَإِن كَانَ مَكْرُهُمْ لِتَزُولَ مِنْهُ الْجِبَالُ", "فَلاَ تَحْسَبَنَّ اللّهَ مُخْلِفَ وَعْدِهِ رُسُلَهُ إِنَّ اللّهَ عَزِيزٌ ذُو انْتِقَامٍ", "يَوْمَ تُبَدَّلُ الأَرْضُ غَيْرَ الأَرْضِ وَالسَّمَاوَاتُ وَبَرَزُواْ للّهِ الْوَاحِدِ الْقَهَّارِ", "وَتَرَى الْمُجْرِمِينَ يَوْمَئِذٍ مُّقَرَّنِينَ فِي الأَصْفَادِ", "سَرَابِيلُهُم مِّن قَطِرَانٍ وَتَغْشَى وُجُوهَهُمْ النَّارُ", "لِيَجْزِي اللّهُ كُلَّ نَفْسٍ مَّا كَسَبَتْ إِنَّ اللّهَ سَرِيعُ الْحِسَابِ", "هَـذَا بَلاَغٌ لِّلنَّاسِ وَلِيُنذَرُواْ بِهِ وَلِيَعْلَمُواْ أَنَّمَا هُوَ إِلَـهٌ وَاحِدٌ وَلِيَذَّكَّرَ أُوْلُواْ الأَلْبَابِ"], "name_en": "'Ibrahim", "ayahs_en": ["Alif-Lâm-Râ. [These letters are one of  the miracles of the Qur’ân, and none but Allâh (Alone) knows their  meanings]. (This is) a Book which We have revealed unto you (O Muhammad  SAW) in order that you might lead mankind out of darkness (of disbelief  and polytheism) into light (of belief in the Oneness of Allâh and  Islâmic Monotheism) by their Lord’s Leave to the Path of the  All-Mighty, the Owner of all Praise.", "Allâh to Whom belongs all that is in the  heavens and all that is in the earth! And woe unto the disbelievers  from a severe torment.", "Those who prefer the life of this world  instead of the Hereafter, and hinder (men) from the Path of Allâh  (i.e.Islâm) and seek crookedness therein - They are far astray.", "And We sent not a Messenger except with  the language of his people, in order that he might make (the Message)  clear for them. Then Allâh misleads whom He wills and guides whom He  wills. And He is the All-Mighty, the All-Wise.", "And indeed We sent Mûsa (Moses) with Our  Ayât (signs, proofs, and evidences) (saying): ”Bring out your people  from darkness into light, and make them remember the annals of Allâh.  Truly, therein are evidences, proofs and signs for every patient,  thankful (person).”", "And (remember) when Mûsa (Moses) said to  his people: ”Call to mind Allâh’s Favour to you, when He delivered you  from Fir’aun’s (Pharaoh) people who were afflicting you with horrible  torment, and were slaughtering your sons and letting your women alive,  and in it was a tremendous trial from your Lord.”", "And (remember) when your Lord  proclaimed: ”If you give thanks (by accepting Faith and worshipping  none but Allâh), I will give you more (of My Blessings), but if you are  thankless (i.e. disbelievers), verily! My Punishment is indeed severe.”", "And Mûsa (Moses) said: ”If you  disbelieve, you and all on earth together, then verily! Allâh is Rich  (Free of all wants), Owner of all Praise.”", "Has not the news reached you, of those  before you, the people of Nûh (Noah), and ’Ad, and Thamud? And those  after them? None knows them but Allâh. To them came their Messengers  with clear proofs, but they put their hands in their mouths (biting  them from anger) and said: ”Verily, we disbelieve in that with which  you have been sent, and we are really in grave doubt as to that to  which you invite us (i.e. Islâmic Monotheism).”", "Their Messengers said: ”What! Can there  be a doubt about Allâh, the Creator of the heavens and the earth? He  calls you (to Monotheism and to be obedient to Allâh) that He may  forgive you of your sins and give you respite for a term appointed.”  They said: ”You are no more than human beings like us! You wish to turn  us away from what our fathers used to worship. Then bring us a clear  authority i.e. a clear proof of what you say).”", "Their Messengers said to them: ”We are  no more than human beings like you, but Allâh bestows His Grace to whom  He wills of His slaves. It is not ours to bring you an authority  (proof) except by the Permission of Allâh. And in Allâh (Alone) let the  believers put their trust.", "”And why should we not put our trust in  Allâh while He indeed has guided us our ways. And we shall certainly  bear with patience all the hurt you may cause us, and in Allâh (Alone)  let those who trust, put their trust.”", "And those who disbelieved, said to their  Messengers: ”Surely, we shall drive you out of our land, or you shall  return to our religion.” So their Lord inspired them: ”Truly, We shall  destroy the Zâlimûn (polytheists, disbelievers and wrong-doers.).", "”And indeed, We shall make you dwell in  the land after them. This is for him who fears standing before Me (on  the Day of Resurrection or fears My Punishment) and also fears My  Threat.”", "But they (the Messengers) sought victory  and help [from their Lord (Allâh)], and every obstinate, arrogant  dictator (who refuses to believe in the Oneness of Allâh) was brought  to a complete loss and destruction.", "In front of him (every obstinate, arrogant dictator) is Hell, and he will be made to drink boiling, festering water.", "He will sip it unwillingly, and he will  find a great difficulty to swallow it down his throat, and death will  come to him from every side, yet he will not die and in front of him,  will be a great torment.", "The parable of those who disbelieve in  their Lord is that their works are as ashes, on which the wind blows  furiously on a stormy day, they shall not be able to get aught of what  they have earned. That is the straying, far away (from the Right Path).", "Do you not see that Allâh has created  the heavens and the earth with truth? If He will, He can remove you and  bring (in your place) a new creation!", "And for Allâh that is not hard or difficult (i.e. very easy for Allâh).", "And they all shall appear before Allâh  (on the Day of Resurrection) then the weak will say to those who were  arrogant (chiefs): ”Verily, we were following you; can you avail us  anything from Allâh’s Torment?” They will say: ”Had Allâh guided us, we  would have guided you. It makes no difference to us (now) whether we  rage, or bear (these torments) with patience, there is no place of  refuge for us.”", "And Shaitân (Satan) will say when the  matter has been decided: ”Verily, Allâh promised you a promise of  truth. And I too promised you, but I betrayed you. I had no authority  over you except that I called you, so you responded to me. So blame me  not, but blame yourselves. I cannot help you, nor can you help me. I  deny your former act in associating me (Satan) as a partner with Allâh  (by obeying me in the life of the world). Verily, there is a painful  torment for the Zâlimûn (polytheists and wrong-doers, etc.).”", "And those who believed (in the Oneness  of Allâh and His Messengers and whatever they brought) and did  righteous deeds, will be made to enter Gardens under which rivers flow,  - to dwell therein forever (i.e.in Paradise), with the permission of  their Lord. Their greeting therein will be: Salâm (peace!).", "See you not how Allâh sets forth a  parable? - A goodly word as a goodly tree, whose root is firmly fixed,  and its branches (reach) to the sky (i.e. very high).", "Giving its fruit at all times, by the  Leave of its Lord and Allâh sets forth parables for mankind in order  that they may remember.", "And the parable of an evil word is that of an evil tree uprooted from the surface of earth having no stability.", "Allâh will keep firm those who believe,  with the word that stands firm in this world (i.e. they will keep on  worshipping Allâh Alone and none else), and in the Hereafter. And Allâh  will cause to go astray those who are Zâlimûn (polytheists and  wrong-doers, etc.), and Allâh does what He wills.", "Have you not seen those who have changed  the Blessings of Allâh into disbelief (by denying Prophet Muhammad SAW  and his Message of Islâm), and caused their people to dwell in the  house of destruction?", "Hell, in which they will burn, - and what an evil place to settle in!", "And they set up rivals to Allâh, to  mislead (men) from His Path! Say: ”Enjoy (your brief life)! But  certainly, your destination is the (Hell) Fire!”", "Say (O Muhammad SAW) to ’Ibâdî (My  slaves) who have believed, that they should perform As-Salât  (Iqâmat-as-Salât), and spend in charity out of the sustenance We have  given them, secretly and openly, before the coming of a Day on which  there will be neither mutual bargaining nor befriending.", "Allâh is He Who has created the heavens  and the earth and sends down water (rain) from the sky, and thereby  brought forth fruits as provision for you; and He has made the ships to  be of service to you, that they may sail through the sea by His  Command; and He has made rivers (also) to be of service to you.", "And He has made the sun and the moon,  both constantly pursuing their courses, to be of service to you; and He  has made the night and the day, to be of service to you.", "And He gave you of all that you asked  for, and if you count the Blessings of Allâh, never will you be able to  count them. Verily! Man is indeed an extreme wrong-doer, - a  disbeliever (an extreme ingrate, denies Allâh’s Blessings by disbelief,  and by worshipping others besides Allâh, and by disobeying Allâh and  His Prophet Muhammad SAW).", "And (remember) when Ibrâhim (Abraham)  said: ”O my Lord! Make this city (Makkah) one of peace and security,  and keep me and my sons away from worshipping idols.", "”O my Lord! They have indeed led astray  many among mankind. But whoso follows me, he verily is of me. And whoso  disobeys me, - still You are indeed Oft-Forgiving, Most Merciful.", "”O our Lord! I have made some of my  offspring to dwell in an uncultivable valley by Your Sacred House (the  Ka’bah at Makkah); in order, O our Lord, that they may perform As-Salât  (Iqâmat-as-Salât), so fill some hearts among men with love towards  them, and (O Allâh) provide them with fruits so that they may give  thanks.", "”O our Lord! Certainly, You know what we conceal and what we reveal. Nothing on the earth or in the heaven is hidden from Allâh.", "”All the praises and thanks be to Allâh,  Who has given me in old age Ismâ’il (Ishmael) and Ishâque (Isaac).  Verily! My Lord is indeed the All-Hearer of invocations.", "”O my Lord! Make me one who performs  As-Salât (Iqâmat-as-Salât), and (also) from my offspring, our Lord! And  accept my invocation.", "”Our Lord! Forgive me and my parents, and (all) the believers on the Day when the reckoning will be established.”", "Consider not that Allâh is unaware of  that which the Zâlimûn (polytheists, wrong-doers, etc.) do, but He  gives them respite up to a Day when the eyes will stare in horror.", "(They will be) hastening forward with  necks outstretched, their heads raised up (towards the sky), their gaze  returning not towards them and their hearts empty (from thinking  because of extreme fear).", "And warn (O Muhammad SAW) mankind of the  Day when the torment will come unto them; then the wrong-doers will  say: ”Our Lord! Respite us for a little while, we will answer Your Call  and follow the Messengers!” (It will be said): ”Had you not sworn  aforetime that you would not leave (the world for the Hereafter).", "”And you dwelt in the dwellings of men  who wronged themselves, and it was clear to you how We had dealt with  them. And We put forth (many) parables for you.”", "Indeed, they planned their plot, and  their plot was with Allâh, though their plot was a great (one, still)  it would never be able to remove the mountains (real mountains or the  Islâmic law) from their places (as it is of no importance) [Tafsir Ibn  Kathir, Vol. 2, Page 597]. [It is said by some interpreters regarding  this Verse that the Quraish pagans plotted against Prophet Muhammad SAW  to kill him but they failed and were unable to carry out their plot  which they plotted].", "So think not that Allâh will fail to  keep His Promise to His Messengers. Certainly, Allâh is All-Mighty, -  All-Able of Retribution.", "On the Day when the earth will be  changed to another earth and so will be the heavens, and they (all  creatures) will appear before Allâh, the One, the Irresistible.", "And you will see the Mujrimûn  (criminals, disbelievers in the Oneness of Allâh Islâmic Monotheism,  polytheists, disobedient to Allâh, etc.) that Day bound together in  fetters; [Muqarranûn in fetters; mean:- with their hands and feet tied  to their necks with chains.]", "Their garments will be of pitch, and fire will cover their faces.", "That Allâh may requite each person according to what he has earned. Truly, Allâh is Swift at reckoning.", "This (Qur’ân) is a Message for mankind  (and a clear proof against them), in order that they may be warned  thereby, and that they may know that He is the only One Ilâh (God -  Allâh) - (none has the right to be worshipped but Allâh), and that men  of understanding may take heed."]}