{"name_ar": "سورة الإسراء", "ayahs_ar": ["سُبْحَانَ الَّذِي أَسْرَى بِعَبْدِهِ لَيْلاً مِّنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الأَقْصَى الَّذِي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ آيَاتِنَا إِنَّهُ هُوَ السَّمِيعُ البَصِيرُ", "وَآتَيْنَا مُوسَى الْكِتَابَ وَجَعَلْنَاهُ هُدًى لِّبَنِي إِسْرَائِيلَ أَلاَّ تَتَّخِذُواْ مِن دُونِي وَكِيلاً", "ذُرِّيَّةَ مَنْ حَمَلْنَا مَعَ نُوحٍ إِنَّهُ كَانَ عَبْدًا شَكُورًا", "وَقَضَيْنَا إِلَى بَنِي إِسْرَائِيلَ فِي الْكِتَابِ لَتُفْسِدُنَّ فِي الأَرْضِ مَرَّتَيْنِ وَلَتَعْلُنَّ عُلُوًّا كَبِيرًا", "فَإِذَا جَاء وَعْدُ أُولاهُمَا بَعَثْنَا عَلَيْكُمْ عِبَادًا لَّنَا أُوْلِي بَأْسٍ شَدِيدٍ فَجَاسُواْ خِلاَلَ الدِّيَارِ وَكَانَ وَعْدًا مَّفْعُولاً", "ثُمَّ رَدَدْنَا لَكُمُ الْكَرَّةَ عَلَيْهِمْ وَأَمْدَدْنَاكُم بِأَمْوَالٍ وَبَنِينَ وَجَعَلْنَاكُمْ أَكْثَرَ نَفِيرًا", "إِنْ أَحْسَنتُمْ أَحْسَنتُمْ لِأَنفُسِكُمْ وَإِنْ أَسَأْتُمْ فَلَهَا فَإِذَا جَاء وَعْدُ الآخِرَةِ لِيَسُوؤُواْ وُجُوهَكُمْ وَلِيَدْخُلُواْ الْمَسْجِدَ كَمَا دَخَلُوهُ أَوَّلَ مَرَّةٍ وَلِيُتَبِّرُواْ مَا عَلَوْاْ تَتْبِيرًا", "عَسَى رَبُّكُمْ أَن يَرْحَمَكُمْ وَإِنْ عُدتُّمْ عُدْنَا وَجَعَلْنَا جَهَنَّمَ لِلْكَافِرِينَ حَصِيرًا", "إِنَّ هَـذَا الْقُرْآنَ يِهْدِي لِلَّتِي هِيَ أَقْوَمُ وَيُبَشِّرُ الْمُؤْمِنِينَ الَّذِينَ يَعْمَلُونَ الصَّالِحَاتِ أَنَّ لَهُمْ أَجْرًا كَبِيرًا", "وأَنَّ الَّذِينَ لاَ يُؤْمِنُونَ بِالآخِرَةِ أَعْتَدْنَا لَهُمْ عَذَابًا أَلِيمًا", "وَيَدْعُ الإِنسَانُ بِالشَّرِّ دُعَاءهُ بِالْخَيْرِ وَكَانَ الإِنسَانُ عَجُولاً", "وَجَعَلْنَا اللَّيْلَ وَالنَّهَارَ آيَتَيْنِ فَمَحَوْنَا آيَةَ اللَّيْلِ وَجَعَلْنَا آيَةَ النَّهَارِ مُبْصِرَةً لِتَبْتَغُواْ فَضْلاً مِّن رَّبِّكُمْ وَلِتَعْلَمُواْ عَدَدَ السِّنِينَ وَالْحِسَابَ وَكُلَّ شَيْءٍ فَصَّلْنَاهُ تَفْصِيلاً", "وَكُلَّ إِنسَانٍ أَلْزَمْنَاهُ طَآئِرَهُ فِي عُنُقِهِ وَنُخْرِجُ لَهُ يَوْمَ الْقِيَامَةِ كِتَابًا يَلْقَاهُ مَنشُورًا", "اقْرَأْ كَتَابَكَ كَفَى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا", "مَّنِ اهْتَدَى فَإِنَّمَا يَهْتَدي لِنَفْسِهِ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا وَلاَ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى وَمَا كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولاً", "وَإِذَا أَرَدْنَا أَن نُّهْلِكَ قَرْيَةً أَمَرْنَا مُتْرَفِيهَا فَفَسَقُواْ فِيهَا فَحَقَّ عَلَيْهَا الْقَوْلُ فَدَمَّرْنَاهَا تَدْمِيرًا", "وَكَمْ أَهْلَكْنَا مِنَ الْقُرُونِ مِن بَعْدِ نُوحٍ وَكَفَى بِرَبِّكَ بِذُنُوبِ عِبَادِهِ خَبِيرًَا بَصِيرًا", "مَّن كَانَ يُرِيدُ الْعَاجِلَةَ عَجَّلْنَا لَهُ فِيهَا مَا نَشَاء لِمَن نُّرِيدُ ثُمَّ جَعَلْنَا لَهُ جَهَنَّمَ يَصْلاهَا مَذْمُومًا مَّدْحُورًا", "وَمَنْ أَرَادَ الآخِرَةَ وَسَعَى لَهَا سَعْيَهَا وَهُوَ مُؤْمِنٌ فَأُولَئِكَ كَانَ سَعْيُهُم مَّشْكُورًا", "كُلاًّ نُّمِدُّ هَـؤُلاء وَهَـؤُلاء مِنْ عَطَاء رَبِّكَ وَمَا كَانَ عَطَاء رَبِّكَ مَحْظُورًا", "انظُرْ كَيْفَ فَضَّلْنَا بَعْضَهُمْ عَلَى بَعْضٍ وَلَلآخِرَةُ أَكْبَرُ دَرَجَاتٍ وَأَكْبَرُ تَفْضِيلاً", "لاَّ تَجْعَل مَعَ اللّهِ إِلَـهًا آخَرَ فَتَقْعُدَ مَذْمُومًا مَّخْذُولاً", "وَقَضَى رَبُّكَ أَلاَّ تَعْبُدُواْ إِلاَّ إِيَّاهُ وَبِالْوَالِدَيْنِ إِحْسَانًا إِمَّا يَبْلُغَنَّ عِندَكَ الْكِبَرَ أَحَدُهُمَا أَوْ كِلاَهُمَا فَلاَ تَقُل لَّهُمَآ أُفٍّ وَلاَ تَنْهَرْهُمَا وَقُل لَّهُمَا قَوْلاً كَرِيمًا", "وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ وَقُل رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا", "رَّبُّكُمْ أَعْلَمُ بِمَا فِي نُفُوسِكُمْ إِن تَكُونُواْ صَالِحِينَ فَإِنَّهُ كَانَ لِلأَوَّابِينَ غَفُورًا", "وَآتِ ذَا الْقُرْبَى حَقَّهُ وَالْمِسْكِينَ وَابْنَ السَّبِيلِ وَلاَ تُبَذِّرْ تَبْذِيرًا", "إِنَّ الْمُبَذِّرِينَ كَانُواْ إِخْوَانَ الشَّيَاطِينِ وَكَانَ الشَّيْطَانُ لِرَبِّهِ كَفُورًا", "وَإِمَّا تُعْرِضَنَّ عَنْهُمُ ابْتِغَاء رَحْمَةٍ مِّن رَّبِّكَ تَرْجُوهَا فَقُل لَّهُمْ قَوْلاً مَّيْسُورًا", "وَلاَ تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَى عُنُقِكَ وَلاَ تَبْسُطْهَا كُلَّ الْبَسْطِ فَتَقْعُدَ مَلُومًا مَّحْسُورًا", "إِنَّ رَبَّكَ يَبْسُطُ الرِّزْقَ لِمَن يَشَاء وَيَقْدِرُ إِنَّهُ كَانَ بِعِبَادِهِ خَبِيرًا بَصِيرًا", "وَلاَ تَقْتُلُواْ أَوْلادَكُمْ خَشْيَةَ إِمْلاقٍ نَّحْنُ نَرْزُقُهُمْ وَإِيَّاكُم إنَّ قَتْلَهُمْ كَانَ خِطْءًا كَبِيرًا", "وَلاَ تَقْرَبُواْ الزِّنَى إِنَّهُ كَانَ فَاحِشَةً وَسَاء سَبِيلاً", "وَلاَ تَقْتُلُواْ النَّفْسَ الَّتِي حَرَّمَ اللّهُ إِلاَّ بِالحَقِّ وَمَن قُتِلَ مَظْلُومًا فَقَدْ جَعَلْنَا لِوَلِيِّهِ سُلْطَانًا فَلاَ يُسْرِف فِّي الْقَتْلِ إِنَّهُ كَانَ مَنْصُورًا", "وَلاَ تَقْرَبُواْ مَالَ الْيَتِيمِ إِلاَّ بِالَّتِي هِيَ أَحْسَنُ حَتَّى يَبْلُغَ أَشُدَّهُ وَأَوْفُواْ بِالْعَهْدِ إِنَّ الْعَهْدَ كَانَ مَسْؤُولاً", "وَأَوْفُوا الْكَيْلَ إِذا كِلْتُمْ وَزِنُواْ بِالقِسْطَاسِ الْمُسْتَقِيمِ ذَلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلاً", "وَلاَ تَقْفُ مَا لَيْسَ لَكَ بِهِ عِلْمٌ إِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤَادَ كُلُّ أُولـئِكَ كَانَ عَنْهُ مَسْؤُولاً", "وَلاَ تَمْشِ فِي الأَرْضِ مَرَحًا إِنَّكَ لَن تَخْرِقَ الأَرْضَ وَلَن تَبْلُغَ الْجِبَالَ طُولاً", "كُلُّ ذَلِكَ كَانَ سَيٍّئُهُ عِنْدَ رَبِّكَ مَكْرُوهًا", "ذَلِكَ مِمَّا أَوْحَى إِلَيْكَ رَبُّكَ مِنَ الْحِكْمَةِ وَلاَ تَجْعَلْ مَعَ اللّهِ إِلَهًا آخَرَ فَتُلْقَى فِي جَهَنَّمَ مَلُومًا مَّدْحُورًا", "أَفَأَصْفَاكُمْ رَبُّكُم بِالْبَنِينَ وَاتَّخَذَ مِنَ الْمَلآئِكَةِ إِنَاثًا إِنَّكُمْ لَتَقُولُونَ قَوْلاً عَظِيمًا", "وَلَقَدْ صَرَّفْنَا فِي هَـذَا الْقُرْآنِ لِيَذَّكَّرُواْ وَمَا يَزِيدُهُمْ إِلاَّ نُفُورًا", "قُل لَّوْ كَانَ مَعَهُ آلِهَةٌ كَمَا يَقُولُونَ إِذًا لاَّبْتَغَوْاْ إِلَى ذِي الْعَرْشِ سَبِيلاً", "سُبْحَانَهُ وَتَعَالَى عَمَّا يَقُولُونَ عُلُوًّا كَبِيرًا", "تُسَبِّحُ لَهُ السَّمَاوَاتُ السَّبْعُ وَالأَرْضُ وَمَن فِيهِنَّ وَإِن مِّن شَيْءٍ إِلاَّ يُسَبِّحُ بِحَمْدَهِ وَلَـكِن لاَّ تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كَانَ حَلِيمًا غَفُورًا", "وَإِذَا قَرَأْتَ الْقُرآنَ جَعَلْنَا بَيْنَكَ وَبَيْنَ الَّذِينَ لاَ يُؤْمِنُونَ بِالآخِرَةِ حِجَابًا مَّسْتُورًا", "وَجَعَلْنَا عَلَى قُلُوبِهِمْ أَكِنَّةً أَن يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا وَإِذَا ذَكَرْتَ رَبَّكَ فِي الْقُرْآنِ وَحْدَهُ وَلَّوْاْ عَلَى أَدْبَارِهِمْ نُفُورًا", "نَّحْنُ أَعْلَمُ بِمَا يَسْتَمِعُونَ بِهِ إِذْ يَسْتَمِعُونَ إِلَيْكَ وَإِذْ هُمْ نَجْوَى إِذْ يَقُولُ الظَّالِمُونَ إِن تَتَّبِعُونَ إِلاَّ رَجُلاً مَّسْحُورًا", "انظُرْ كَيْفَ ضَرَبُواْ لَكَ الأَمْثَالَ فَضَلُّواْ فَلاَ يَسْتَطِيعْونَ سَبِيلاً", "وَقَالُواْ أَئِذَا كُنَّا عِظَامًا وَرُفَاتًا أَإِنَّا لَمَبْعُوثُونَ خَلْقًا جَدِيدًا", "قُل كُونُواْ حِجَارَةً أَوْ حَدِيدًا", "أَوْ خَلْقًا مِّمَّا يَكْبُرُ فِي صُدُورِكُمْ فَسَيَقُولُونَ مَن يُعِيدُنَا قُلِ الَّذِي فَطَرَكُمْ أَوَّلَ مَرَّةٍ فَسَيُنْغِضُونَ إِلَيْكَ رُؤُوسَهُمْ وَيَقُولُونَ مَتَى هُوَ قُلْ عَسَى أَن يَكُونَ قَرِيبًا", "يَوْمَ يَدْعُوكُمْ فَتَسْتَجِيبُونَ بِحَمْدِهِ وَتَظُنُّونَ إِن لَّبِثْتُمْ إِلاَّ قَلِيلاً", "وَقُل لِّعِبَادِي يَقُولُواْ الَّتِي هِيَ أَحْسَنُ إِنَّ الشَّيْطَانَ يَنزَغُ بَيْنَهُمْ إِنَّ الشَّيْطَانَ كَانَ لِلإِنْسَانِ عَدُوًّا مُّبِينًا", "رَّبُّكُمْ أَعْلَمُ بِكُمْ إِن يَشَأْ يَرْحَمْكُمْ أَوْ إِن يَشَأْ يُعَذِّبْكُمْ وَمَا أَرْسَلْنَاكَ عَلَيْهِمْ وَكِيلاً", "وَرَبُّكَ أَعْلَمُ بِمَن فِي السَّمَاوَاتِ وَالأَرْضِ وَلَقَدْ فَضَّلْنَا بَعْضَ النَّبِيِّينَ عَلَى بَعْضٍ وَآتَيْنَا دَاوُودَ زَبُورًا", "قُلِ ادْعُواْ الَّذِينَ زَعَمْتُم مِّن دُونِهِ فَلاَ يَمْلِكُونَ كَشْفَ الضُّرِّ عَنكُمْ وَلاَ تَحْوِيلاً", "أُولَـئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمُ الْوَسِيلَةَ أَيُّهُمْ أَقْرَبُ وَيَرْجُونَ رَحْمَتَهُ وَيَخَافُونَ عَذَابَهُ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحْذُورًا", "وَإِن مَّن قَرْيَةٍ إِلاَّ نَحْنُ مُهْلِكُوهَا قَبْلَ يَوْمِ الْقِيَامَةِ أَوْ مُعَذِّبُوهَا عَذَابًا شَدِيدًا كَانَ ذَلِك فِي الْكِتَابِ مَسْطُورًا", "وَمَا مَنَعَنَا أَن نُّرْسِلَ بِالآيَاتِ إِلاَّ أَن كَذَّبَ بِهَا الأَوَّلُونَ وَآتَيْنَا ثَمُودَ النَّاقَةَ مُبْصِرَةً فَظَلَمُواْ بِهَا وَمَا نُرْسِلُ بِالآيَاتِ إِلاَّ تَخْوِيفًا", "وَإِذْ قُلْنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِالنَّاسِ وَمَا جَعَلْنَا الرُّؤيَا الَّتِي أَرَيْنَاكَ إِلاَّ فِتْنَةً لِّلنَّاسِ وَالشَّجَرَةَ الْمَلْعُونَةَ فِي القُرْآنِ وَنُخَوِّفُهُمْ فَمَا يَزِيدُهُمْ إِلاَّ طُغْيَانًا كَبِيرًا", "وَإِذْ قُلْنَا لِلْمَلآئِكَةِ اسْجُدُواْ لآدَمَ فَسَجَدُواْ إَلاَّ إِبْلِيسَ قَالَ أَأَسْجُدُ لِمَنْ خَلَقْتَ طِينًا", "قَالَ أَرَأَيْتَكَ هَـذَا الَّذِي كَرَّمْتَ عَلَيَّ لَئِنْ أَخَّرْتَنِ إِلَى يَوْمِ الْقِيَامَةِ لأَحْتَنِكَنَّ ذُرِّيَّتَهُ إَلاَّ قَلِيلاً", "قَالَ اذْهَبْ فَمَن تَبِعَكَ مِنْهُمْ فَإِنَّ جَهَنَّمَ جَزَآؤُكُمْ جَزَاء مَّوْفُورًا", "وَاسْتَفْزِزْ مَنِ اسْتَطَعْتَ مِنْهُمْ بِصَوْتِكَ وَأَجْلِبْ عَلَيْهِم بِخَيْلِكَ وَرَجِلِكَ وَشَارِكْهُمْ فِي الأَمْوَالِ وَالأَوْلادِ وَعِدْهُمْ وَمَا يَعِدُهُمُ الشَّيْطَانُ إِلاَّ غُرُورًا", "إِنَّ عِبَادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطَانٌ وَكَفَى بِرَبِّكَ وَكِيلاً", "رَّبُّكُمُ الَّذِي يُزْجِي لَكُمُ الْفُلْكَ فِي الْبَحْرِ لِتَبْتَغُواْ مِن فَضْلِهِ إِنَّهُ كَانَ بِكُمْ رَحِيمًا", "وَإِذَا مَسَّكُمُ الْضُّرُّ فِي الْبَحْرِ ضَلَّ مَن تَدْعُونَ إِلاَّ إِيَّاهُ فَلَمَّا نَجَّاكُمْ إِلَى الْبَرِّ أَعْرَضْتُمْ وَكَانَ الإِنْسَانُ كَفُورًا", "أَفَأَمِنتُمْ أَن يَخْسِفَ بِكُمْ جَانِبَ الْبَرِّ أَوْ يُرْسِلَ عَلَيْكُمْ حَاصِبًا ثُمَّ لاَ تَجِدُواْ لَكُمْ وَكِيلاً", "أَمْ أَمِنتُمْ أَن يُعِيدَكُمْ فِيهِ تَارَةً أُخْرَى فَيُرْسِلَ عَلَيْكُمْ قَاصِفا مِّنَ الرِّيحِ فَيُغْرِقَكُم بِمَا كَفَرْتُمْ ثُمَّ لاَ تَجِدُواْ لَكُمْ عَلَيْنَا بِهِ تَبِيعًا", "وَلَقَدْ كَرَّمْنَا بَنِي آدَمَ وَحَمَلْنَاهُمْ فِي الْبَرِّ وَالْبَحْرِ وَرَزَقْنَاهُم مِّنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَى كَثِيرٍ مِّمَّنْ خَلَقْنَا تَفْضِيلاً", "يَوْمَ نَدْعُو كُلَّ أُنَاسٍ بِإِمَامِهِمْ فَمَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ فَأُوْلَـئِكَ يَقْرَؤُونَ كِتَابَهُمْ وَلاَ يُظْلَمُونَ فَتِيلاً", "وَمَن كَانَ فِي هَـذِهِ أَعْمَى فَهُوَ فِي الآخِرَةِ أَعْمَى وَأَضَلُّ سَبِيلاً", "وَإِن كَادُواْ لَيَفْتِنُونَكَ عَنِ الَّذِي أَوْحَيْنَا إِلَيْكَ لِتفْتَرِيَ عَلَيْنَا غَيْرَهُ وَإِذًا لاَّتَّخَذُوكَ خَلِيلاً", "وَلَوْلاَ أَن ثَبَّتْنَاكَ لَقَدْ كِدتَّ تَرْكَنُ إِلَيْهِمْ شَيْئًا قَلِيلاً", "إِذاً لَّأَذَقْنَاكَ ضِعْفَ الْحَيَاةِ وَضِعْفَ الْمَمَاتِ ثُمَّ لاَ تَجِدُ لَكَ عَلَيْنَا نَصِيرًا", "وَإِن كَادُواْ لَيَسْتَفِزُّونَكَ مِنَ الأَرْضِ لِيُخْرِجوكَ مِنْهَا وَإِذًا لاَّ يَلْبَثُونَ خِلافَكَ إِلاَّ قَلِيلاً", "سُنَّةَ مَن قَدْ أَرْسَلْنَا قَبْلَكَ مِن رُّسُلِنَا وَلاَ تَجِدُ لِسُنَّتِنَا تَحْوِيلاً", "أَقِمِ الصَّلاَةَ لِدُلُوكِ الشَّمْسِ إِلَى غَسَقِ اللَّيْلِ وَقُرْآنَ الْفَجْرِ إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا", "وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَّكَ عَسَى أَن يَبْعَثَكَ رَبُّكَ مَقَامًا مَّحْمُودًا", "وَقُل رَّبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا", "وَقُلْ جَاء الْحَقُّ وَزَهَقَ الْبَاطِلُ إِنَّ الْبَاطِلَ كَانَ زَهُوقًا", "وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاء وَرَحْمَةٌ لِّلْمُؤْمِنِينَ وَلاَ يَزِيدُ الظَّالِمِينَ إَلاَّ خَسَارًا", "وَإِذَآ أَنْعَمْنَا عَلَى الإِنسَانِ أَعْرَضَ وَنَأَى بِجَانِبِهِ وَإِذَا مَسَّهُ الشَّرُّ كَانَ يَؤُوسًا", "قُلْ كُلٌّ يَعْمَلُ عَلَى شَاكِلَتِهِ فَرَبُّكُمْ أَعْلَمُ بِمَنْ هُوَ أَهْدَى سَبِيلاً", "وَيَسْأَلُونَكَ عَنِ الرُّوحِ قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتِيتُم مِّن الْعِلْمِ إِلاَّ قَلِيلاً", "وَلَئِن شِئْنَا لَنَذْهَبَنَّ بِالَّذِي أَوْحَيْنَا إِلَيْكَ ثُمَّ لاَ تَجِدُ لَكَ بِهِ عَلَيْنَا وَكِيلاً", "إِلاَّ رَحْمَةً مِّن رَّبِّكَ إِنَّ فَضْلَهُ كَانَ عَلَيْكَ كَبِيرًا", "قُل لَّئِنِ اجْتَمَعَتِ الإِنسُ وَالْجِنُّ عَلَى أَن يَأْتُواْ بِمِثْلِ هَـذَا الْقُرْآنِ لاَ يَأْتُونَ بِمِثْلِهِ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا", "وَلَقَدْ صَرَّفْنَا لِلنَّاسِ فِي هَـذَا الْقُرْآنِ مِن كُلِّ مَثَلٍ فَأَبَى أَكْثَرُ النَّاسِ إِلاَّ كُفُورًا", "وَقَالُواْ لَن نُّؤْمِنَ لَكَ حَتَّى تَفْجُرَ لَنَا مِنَ الأَرْضِ يَنبُوعًا", "أَوْ تَكُونَ لَكَ جَنَّةٌ مِّن نَّخِيلٍ وَعِنَبٍ فَتُفَجِّرَ الأَنْهَارَ خِلالَهَا تَفْجِيرًا", "أَوْ تُسْقِطَ السَّمَاء كَمَا زَعَمْتَ عَلَيْنَا كِسَفًا أَوْ تَأْتِيَ بِاللّهِ وَالْمَلآئِكَةِ قَبِيلاً", "أَوْ يَكُونَ لَكَ بَيْتٌ مِّن زُخْرُفٍ أَوْ تَرْقَى فِي السَّمَاء وَلَن نُّؤْمِنَ لِرُقِيِّكَ حَتَّى تُنَزِّلَ عَلَيْنَا كِتَابًا نَّقْرَؤُهُ قُلْ سُبْحَانَ رَبِّي هَلْ كُنتُ إَلاَّ بَشَرًا رَّسُولاً", "وَمَا مَنَعَ النَّاسَ أَن يُؤْمِنُواْ إِذْ جَاءهُمُ الْهُدَى إِلاَّ أَن قَالُواْ أَبَعَثَ اللّهُ بَشَرًا رَّسُولاً", "قُل لَّوْ كَانَ فِي الأَرْضِ مَلآئِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنَا عَلَيْهِم مِّنَ السَّمَاء مَلَكًا رَّسُولاً", "قُلْ كَفَى بِاللّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ إِنَّهُ كَانَ بِعِبَادِهِ خَبِيرًا بَصِيرًا", "وَمَن يَهْدِ اللّهُ فَهُوَ الْمُهْتَدِ وَمَن يُضْلِلْ فَلَن تَجِدَ لَهُمْ أَوْلِيَاء مِن دُونِهِ وَنَحْشُرُهُمْ يَوْمَ الْقِيَامَةِ عَلَى وُجُوهِهِمْ عُمْيًا وَبُكْمًا وَصُمًّا مَّأْوَاهُمْ جَهَنَّمُ كُلَّمَا خَبَتْ زِدْنَاهُمْ سَعِيرًا", "ذَلِكَ جَزَآؤُهُم بِأَنَّهُمْ كَفَرُواْ بِآيَاتِنَا وَقَالُواْ أَئِذَا كُنَّا عِظَامًا وَرُفَاتًا أَإِنَّا لَمَبْعُوثُونَ خَلْقًا جَدِيدًا", "أَوَلَمْ يَرَوْاْ أَنَّ اللّهَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالأَرْضَ قَادِرٌ عَلَى أَن يَخْلُقَ مِثْلَهُمْ وَجَعَلَ لَهُمْ أَجَلاً لاَّ رَيْبَ فِيهِ فَأَبَى الظَّالِمُونَ إَلاَّ كُفُورًا", "قُل لَّوْ أَنتُمْ تَمْلِكُونَ خَزَآئِنَ رَحْمَةِ رَبِّي إِذًا لَّأَمْسَكْتُمْ خَشْيَةَ الإِنفَاقِ وَكَانَ الإنسَانُ قَتُورًا", "وَلَقَدْ آتَيْنَا مُوسَى تِسْعَ آيَاتٍ بَيِّنَاتٍ فَاسْأَلْ بَنِي إِسْرَائِيلَ إِذْ جَاءهُمْ فَقَالَ لَهُ فِرْعَونُ إِنِّي لَأَظُنُّكَ يَا مُوسَى مَسْحُورًا", "قَالَ لَقَدْ عَلِمْتَ مَا أَنزَلَ هَـؤُلاء إِلاَّ رَبُّ السَّمَاوَاتِ وَالأَرْضِ بَصَآئِرَ وَإِنِّي لَأَظُنُّكَ يَا فِرْعَونُ مَثْبُورًا", "فَأَرَادَ أَن يَسْتَفِزَّهُم مِّنَ الأَرْضِ فَأَغْرَقْنَاهُ وَمَن مَّعَهُ جَمِيعًا", "وَقُلْنَا مِن بَعْدِهِ لِبَنِي إِسْرَائِيلَ اسْكُنُواْ الأَرْضَ فَإِذَا جَاء وَعْدُ الآخِرَةِ جِئْنَا بِكُمْ لَفِيفًا", "وَبِالْحَقِّ أَنزَلْنَاهُ وَبِالْحَقِّ نَزَلَ وَمَا أَرْسَلْنَاكَ إِلاَّ مُبَشِّرًا وَنَذِيرًا", "وَقُرْآناً فَرَقْنَاهُ لِتَقْرَأَهُ عَلَى النَّاسِ عَلَى مُكْثٍ وَنَزَّلْنَاهُ تَنزِيلاً", "قُلْ آمِنُواْ بِهِ أَوْ لاَ تُؤْمِنُواْ إِنَّ الَّذِينَ أُوتُواْ الْعِلْمَ مِن قَبْلِهِ إِذَا يُتْلَى عَلَيْهِمْ يَخِرُّونَ لِلأَذْقَانِ سُجَّدًا", "وَيَقُولُونَ سُبْحَانَ رَبِّنَا إِن كَانَ وَعْدُ رَبِّنَا لَمَفْعُولاً", "وَيَخِرُّونَ لِلأَذْقَانِ يَبْكُونَ وَيَزِيدُهُمْ خُشُوعًا", "قُلِ ادْعُواْ اللّهَ أَوِ ادْعُواْ الرَّحْمَـنَ أَيًّا مَّا تَدْعُواْ فَلَهُ الأَسْمَاء الْحُسْنَى وَلاَ تَجْهَرْ بِصَلاَتِكَ وَلاَ تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذَلِكَ سَبِيلاً", "وَقُلِ الْحَمْدُ لِلّهِ الَّذِي لَمْ يَتَّخِذْ وَلَدًا وَلَم يَكُن لَّهُ شَرِيكٌ فِي الْمُلْكِ وَلَمْ يَكُن لَّهُ وَلِيٌّ مِّنَ الذُّلَّ وَكَبِّرْهُ تَكْبِيرًا"], "name_en": "Al-'Isra'", "ayahs_en": ["Glorified (and Exalted) be He (Allâh)  [above all that (evil) they associate with Him] [Tafsir Qurtubî, Vol.  10, Page 204]. Who took His slave (Muhammad SAW) for a journey by night  from Al-Masjid-al-Harâm (at Makkah) to the farthest mosque (in  Jerusalem), the neighbourhood whereof We have blessed, in order that We  might show him (Muhammad SAW) of Our Ayât (proofs, evidences, lessons,  signs, etc.). Verily, He is the All-Hearer, the All-Seer.", "And We gave Mûsa (Moses) the Scripture  and made it a guidance for the Children of Israel (saying): ”Take not  other than Me as (your) Wakîl (Protector, Lord, or Disposer of your  affairs, etc).", "”O offspring of those whom We carried (in the ship) with Nûh (Noah)! Verily, he was a grateful slave.”", "And We decreed for the Children of  Israel in the Scripture, that indeed you would do mischief on the earth  twice and you will become tyrants and extremely arrogant!", "So, when the promise came for the first  of the two, We sent against you slaves of Ours given to terrible  warfare. They entered the very innermost parts of your homes. And it  was a promise (completely) fulfilled.", "Then We gave you once again, a return of  victory over them. And We helped you with wealth and children and made  you more numerous in man power.", "(And We said): ”If you do good, you do  good for your ownselves, and if you do evil (you do it) against  yourselves.” Then, when the second promise came to pass, (We permitted  your enemies) to make your faces sorrowful and to enter the mosque (of  Jerusalem) as they had entered it before, and to destroy with utter  destruction all that fell in their hands.", "[And We said in the Taurât (Torah)]: ”It  may be that your Lord may show mercy unto you, but if you return (to  sins), We shall return (to Our Punishment). And We have made Hell a  prison for the disbelievers.", "Verily, this Qur’ân guides to that which  is most just and right and gives glad tidings to the believers (in the  Oneness of Allâh and His Messenger, Muhammad SAW, etc.). who work deeds  of righteousness, that they shall have a great reward (Paradise).", "And that those who believe not in the  Hereafter (i.e. they disbelieve that they will be recompensed for what  they did in this world, good or bad, etc.), for them We have prepared a  painful torment (Hell).", "And man invokes (Allâh) for evil as he  invokes (Allâh) for good and man is ever hasty [i.e., if he is angry  with somebody, he invokes (saying): ”O Allâh! Curse him, etc.” and that  one should not do, but one should be patient].", "And We have appointed the night and the  day as two Ayât (signs etc.). Then, We have made dark the sign of the  night while We have made the sign of day illuminating, that you may  seek bounty from your Lord, and that you may know the number of the  years and the reckoning. And We have explained everything (in detail)  with full explanation.", "And We have fastened every man’s deeds  to his neck, and on the Day of Resurrection, We shall bring out for him  a book which he will find wide open.", "(It will be said to him): ”Read your book. You yourself are sufficient as a reckoner against you this Day.”", "Whoever goes right, then he goes right  only for the benefit of his ownself. And whoever goes astray, then he  goes astray to his own loss. No one laden with burdens can bear  another’s burden. And We never punish until We have sent a Messenger  (to give warning).", "And when We decide to destroy a town  (population), We (first) send a definite order (to obey Allâh and be  righteous) to those among them [or We (first) increase in number those  of its population] who are given the good things of this life. Then,  they transgress therein, and thus the word (of torment) is justified  against it (them). Then We destroy it with complete destruction.", "And how many generations have We  destroyed after Nûh (Noah)! And Sufficient is your Lord as an  All-Knower and All-Beholder of the sins of His slaves.", "Whoever wishes for the quick-passing  (transitory enjoyment of this world), We readily grant him what We will  for whom We like. Then, afterwards, We have appointed for him Hell, he  will burn therein disgraced and rejected, ( far away from Allâh’s  Mercy).", "And whoever desires the Hereafter and  strives for it, with the necessary effort due for it (i.e. do righteous  deeds of Allâh’s Obedience) while he is a believer (in the Oneness of  Allâh Islâmic Monotheism), then such are the ones whose striving shall  be appreciated, thanked and rewarded (by Allâh).", "To each these as well as those We bestow from the Bounties of your Lord. And the Bounties of your Lord can never be forbidden.", "See how We prefer one above another (in  this world) and verily, the Hereafter will be greater in degrees and  greater in preference.", "Set not up with Allâh any other ilâh  (god), (O man)! (This verse is addressed to Prophet Muhammad SAW , but  its implication is general to all mankind), or you will sit down  reproved, forsaken (in the Hell-fire).", "And your Lord has decreed that you  worship none but Him. And that you be dutiful to your parents. If one  of them or both of them attain old age in your life, say not to them a  word of disrespect, nor shout at them but address them in terms of  honour.", "And lower unto them the wing of  submission and humility through mercy, and say: ”My Lord! Bestow on  them Your Mercy as they did bring me up when I was small.”", "Your Lord knows best what is in your  inner-selves. If you are righteous, then, verily, He is Ever Most  Forgiving to those who turn unto Him again and again in obedience, and  in repentance.", "And give to the kindred his due and to  the Miskîn (poor) and to the wayfarer. But spend not wastefully (your  wealth) in the manner of a spendthrift . [Tafsir. At-Tabarî, Vol. 10,  Page 158 (Verse 9: 60)].", "Verily, spendthrifts are brothers of the Shayatîn (devils), and the Shaitân (Devil ­ Satan) is ever ungrateful to his Lord.", "And if you (O Muhammad SAW) turn away  from them (kindred, poor, wayfarer, etc. whom We have ordered you to  give their rights, but if you have no money at the time they ask you  for it) and you are awaiting a mercy from your Lord for which you hope,  then, speak unto them a soft kind word (i.e. Allâh will give me and I  shall give you).", "And let not your hand be tied (like a  miser) to your neck, nor stretch it forth to its utmost reach (like a  spendthrift), so that you become blameworthy and in severe poverty.", "Truly, your Lord enlarges the provision  for whom He wills and straitens (for whom He wills). Verily, He is Ever  All-Knower, All-Seer of His slaves.", "And kill not your children for fear of poverty. We provide for them and for you. Surely, the killing of them is a great sin.", "And come not near to the unlawful sexual  intercourse. Verily, it is a Fâhishah [i.e. anything that transgresses  its limits (a great sin)], and an evil way (that leads one to Hell  unless Allâh forgives him).", "And do not kill anyone which Allâh has  forbidden, except for a just cause. And whoever is killed  (intentionally with hostility and oppression and not by mistake), We  have given his heir the authority [(to demand Qisâs, Law of Equality in  punishment or to forgive, or to take Diya (blood money)]. But let him  not exceed limits in the matter of taking life (i.e he should not kill  except the killer only). Verily, he is helped (by the Islâmic law).", "And come not near to the orphan’s  property except to improve it, until he attains the age of full  strength. And fulfil (every) covenant. Verily! the covenant, will be  questioned about.", "And give full measure when you measure,  and weigh with a balance that is straight. That is good (advantageous)  and better in the end.", "And follow not (O man i.e., say not, or  do not or witness not, etc.) that of which you have no knowledge (e.g.  one’s saying: ”I have seen,” while in fact he has not seen, or ”I have  heard,” while he has not heard). Verily! The hearing, and the sight,  and the heart, of each of those you will be questioned (by Allâh).", "And walk not on the earth with conceit  and arrogance. Verily, you can neither rend nor penetrate the earth,  nor can you attain a stature like the mountains in height.", "All the bad aspects of these (the above mentioned things) are hateful to your Lord.", "This is (part) of Al-Hikmah (wisdom,  good manners and high character, etc.) which your Lord has inspired to  you (O Muhammad SAW ). And set not up with Allâh any other ilâh (god)  lest you should be thrown into Hell, blameworthy and rejected, (from  Allâh’s Mercy).", "Has then your Lord (O pagans of Makkah)  preferred for you sons, and taken for Himself from among the angels  daughters. Verily! You utter an awful saying, indeed.", "And surely, We have explained [Our  Promises, Warnings and (set forth many) examples] in this Qur’ân that  they (the disbelievers) may take heed, but it increases them in naught  save aversion.", "Say (O Muhammad SAW to these  polytheists, pagans, etc.): ”If there had been other âliha (gods) along  with Him as they assert, then they would certainly have sought out a  way to the Lord of the Throne (seeking His Pleasures and to be near to  Him).", "Glorified and High be He! From ’Uluwan  Kabîra (the great falsehood) that they say! (i.e.forged statements that  there are other gods along with Allâh, but He is Allâh, the One, the  Self-Sufficient Master, whom all creatures need. He begets not, nor was  He begotten, and there is none comparable or coequal unto Him).", "The seven heavens and the earth and all  that is therein, glorify Him and there is not a thing but glorifies His  Praise. But you understand not their glorification. Truly, He is Ever  Forbearing, Oft-Forgiving.", "And when you (Muhammad SAW) recite the  Qur’ân, We put between you and those who believe not in the Hereafter,  an invisible veil (or screen their hearts, so they hear or understand  it not).", "And We have put coverings over their  hearts lest, they should understand it (the Qur’ân), and in their ears  deafness. And when you make mention of your Lord Alone [Lâ ilâha  ill-Allâh (none has the right to be worshipped but Allâh) Islâmic  Monotheism ()] in the Qur’ân, they turn on their backs, fleeing in  extreme dislikeness.", "We know best of what they listen to,  when they listen to you. And when they take secret counsel, behold, the  Zâlimûn (polytheists and wrong-doers, etc.) say: ”You follow none but a  bewitched man.”", "See what examples they have put forward for you. So they have gone astray, and never can they find a way.", "And they say: ”When we are bones and fragments (destroyed), should we really be resurrected (to be) a new creation?”", "Say (O Muhammad SAW) ”Be you stones or iron,”", "”Or some created thing that is yet  greater (or harder) in your breasts (thoughts to be resurrected, even  then you shall be resurrected)” Then, they will say: ”Who shall bring  us back (to life)?” Say: ”He Who created you first!” Then, they will  shake their heads at you and say: ”When will that be ?” Say: ”Perhaps  it is near!”", "On the Day when He will call you, and  you will answer (His Call) with (words of) His Praise and Obedience,  and you will think that you have stayed (in this world) but a little  while!", "And say to My slaves (i.e. the true  believers of Islâmic Monotheism) that they should (only) say those  words that are the best. (Because) Shaitân (Satan) verily, sows  disagreements among them. Surely, Shaitân (Satan) is to man a plain  enemy.", "Your Lord knows you best, if He will, He  will have mercy on you, or if He will, He will punish you. And We have  not sent you (O Muhammad SAW) as a guardian over them.", "And your Lord knows best all who are in  the heavens and the earth. And indeed, We have preferred some of the  Prophets above others, and to Dawûd (David) We gave the Zabûr (Psalms).", "Say (O Muhammad SAW): ”Call unto those  besides Him whom you pretend [to be gods like angels, Iesâ (Jesus),  ’Uzair (Ezra), etc.]. They have neither the power to remove the  adversity from you nor even to shift it from you to another person.”", "Those whom they call upon [like ’Iesa  (Jesus) ­ son of Maryam (Mary), ’Uzair (Ezra), angel, etc.] desire (for  themselves) means of access to their Lord (Allâh), as to which of them  should be the nearest and they [’Iesa (Jesus), ’Uzair (Ezra), angels,  etc.] hope for His Mercy and fear His Torment. Verily, the Torment of  your Lord is something to be afraid of!", "And there is not a town (population) but  We shall destroy it before the Day of Resurrection, or punish it with a  severe torment. That is written in the Book (of our Decrees)", "And nothing stops Us from sending the  Ayât (proofs, evidences, signs) but that the people of old denied them.  And We sent the she-camel to Thamûd as a clear sign, but they did her  wrong. And We sent not the signs except to warn, and to make them  afraid (of destruction).", "And (remember) when We told you:  ”Verily! Your Lord has encompassed mankind (i.e. they are in His  Grip).” And We made not the vision which we showed you (O Muhammad as  an actual eye-witness and not as a dream on the night of Al-Isrâ’) but  a trial for mankind, and likewise the accursed tree (Zaqqûm, mentioned)  in the Qur’ân. We warn and make them afraid but it only increases them  in naught save great disbelief, oppression and disobedience to Allâh.", "And (remember) when We said to the  angels: ”Prostrate unto Adam.” They prostrated except Iblîs (Satan). He  said: ”Shall I prostrate to one whom You created from clay?”", "[Iblîs (Satan)] said: ”See? This one  whom You have honoured above me, if You give me respite (keep me alive)  to the Day of Resurrection, I will surely seize and mislead his  offspring (by sending them astray) all but a few!”", "(Allâh) said: ”Go, and whosoever of them follows you, surely! Hell will be the recompense of you (all) an ample recompense.", "”And Istafziz [literally means: befool  them gradually] those whom you can among them with your voice (i.e.  songs, music, and any other call for Allâh’s disobedience), make  assaults on them with your cavalry and your infantry, mutually share  with them wealth and children (by tempting them to earn money by  illegal ways usury, etc., or by committing illegal sexual intercourse,  etc.), and make promises to them.” But Satan promises them nothing but  deceit.", "”Verily! My slaves (i.e the true  believers of Islâmic Monotheism), you have no authority over them. And  All-Sufficient is your Lord as a Guardian.”", "Your Lord is He Who drives the ship for  you through the sea, in order that you may seek of His Bounty. Truly!  He is Ever Most Merciful towards you.", "And when harm touches you upon the sea,  those that you call upon besides Him vanish from you except Him (Allâh  Alone). But when He brings you safely to land, you turn away (from  Him). And man is ever ungrateful.", "Do you then feel secure that He will not  cause a side of the land to swallow you up, or that He will not send  against you a violent sand-storm? Then, you shall find no Wakîl  (guardian one to guard you from the torment).", "Or do you feel secure that He will not  send you back a second time to sea and send against you a hurricane of  wind and drown you because of your disbelief, then you will not find  any avenger therein against Us?", "And indeed We have honoured the Children  of Adam, and We have carried them on land and sea, and have provided  them with At-Taiyibât (lawful good things), and have preferred them  above many of those whom We have created with a marked preference.", "(And remember) the Day when We shall  call together all human beings with their (respective) Imâm [their  Prophets, or their records of good and bad deeds, or their Holy Books  like the Qur’ân, the Taurât (Torah), the Injeel (Gospel), etc.]. So  whosoever is given his record in his right hand, such will read their  records, and they will not be dealt with unjustly in the least.", "And whoever is blind in this world  (i.e., does not see Allâh’s Signs and believes not in Him), will be  blind in the Hereafter, and more astray from the Path.", "Verily, they were about to tempt you  away from that which We have revealed (the Qur’ân) unto you (O Muhammad  SAW), to fabricate something other than it against Us, and then they  would certainly have taken you a friend!", "And had We not made you stand firm, you would nearly have inclined to them a little.", "In that case, We would have made you  taste a double portion (of punishment) in this life and a double  portion (of punishment) after death. And then you would have found none  to help you against Us.", "And Verily, they were about to frighten  you so much as to drive you out from the land. But in that case they  would not have stayed (therein) after you, expcept for a little while.", "(This was Our) Sunnah (rule or way) with  the Messengers We sent before you (O Muhammad SAW), and you will not  find any alteration in Our Sunnah (rule or way, etc.).", "Perform As­Salât (Iqamât-as-Salât) from  mid-day till the darkness of the night (i.e. the Zuhr, ’Asr, Maghrib,  and ’Ishâ’ prayers), and recite the Qur’ân in the early dawn (i.e. the  morning prayer). Verily, the recitation of the Qur’ân in the early dawn  is ever witnessed (attended by the angels in charge of mankind of the  day and the night).", "And in some parts of the night (also)  offer the Salât (prayer) with it (i.e. recite the Qur’an in the  prayer), as an additional prayer (Tahajjud optional prayer Nawâfil) for  you (O Muhammad SAW). It may be that your Lord will raise you to  Maqâman Mahmûda (a station of praise and glory, i.e. the highest degree  in Paradise!).", "And say (O Muhammad SAW): My Lord! Let  my entry (to the city of Al-Madinah) be good, and likewise my exit  (from the city of Makkah) be good. And grant me from You an authority  to help me (or a firm sign or a proof).", "And say: ”Truth (i.e. Islâmic Monotheism  or this Qur’ân or Jihâd against polytheists) has come and Bâtil  (falsehood, i.e. Satan or polytheism, etc.) has vanished. Surely! Bâtil  is ever bound to vanish.”", "And We send down from the Qur’ân that  which is a healing and a mercy to those who believe (in Islâmic  Monotheism and act on it), and it increases the Zâlimûn (polytheists  and wrong-doers) nothing but loss.", "And when We bestow Our Grace on man (the  disbeliever), he turns away and becomes arrogant, far away from the  Right Path. And when evil touches him he is in great despair.", "Say (O Muhammad SAW to mankind): ”Each  one does according to Shakilatihi (i.e. his way or his religion or his  intentions, etc.), and your Lord knows best of him whose path  (religion, etc.) is right.”", "And they ask you (O Muhammad SAW)  concerning the Rûh (the Spirit); Say: ”The Rûh (the Spirit): it is one  of the things, the knowledge of which is only with my Lord. And of  knowledge, you (mankind) have been given only a little.”", "And if We willed We could surely take  away that which We have revealed to you by inspiration (i.e. this  Qur’ân). Then you would find no protector for you against Us in that  respect.", "Except as a Mercy from your Lord. Verily! His Grace unto you (O Muhammad SAW) is ever great.", "Say: ”If the mankind and the jinns were  together to produce the like of this Qur’ân, they could not produce the  like thereof, even if they helped one another.”", "And indeed We have fully explained to  mankind, in this Qur’ân, every kind of similitude, but most mankind  refuse (the truth and accept nothing) but disbelief.", "And they say: ”We shall not believe in you (O Muhammad SAW), until you cause a spring to gush forth from the earth for us;", "”Or you have a garden of date-palms and grapes, and cause rivers to gush forth in their midst abundantly;", "”Or you cause the heaven to fall upon us  in pieces, as you have pretended, or you bring Allâh and the angels  before (us) face to face;", "”Or you have a house of adornable  materials (like silver and pure gold, etc.), or you ascend up into the  sky, and even then we will put no faith in your ascension until you  bring down for us a Book that we would read.” Say (O Muhammad SAW):  ”Glorified (and Exalted) be my Lord (Allâh) above all that evil they  (polytheists) associate with Him! Am I anything but a man, sent as a  Messenger?”", "And nothing prevented men from believing  when the guidance came to them, except that they said: ”Has Allâh sent  a man as (His) Messenger?”", "Say: ”If there were on the earth, angels  walking about in peace and security, We should certainly have sent down  for them from the heaven an angel as a Messenger.”", "Say: ”Sufficient is Allâh for a witness between me and you. Verily! He is the All-Knower, the All-Seer of His slaves.”", "And he whom Allâh guides, he is led  aright; but he whom He sends astray for such you will find no Auliyâ’  (helpers and protectors, etc.), besides Him, and We shall gather them  together on the Day of Resurrection on their faces, blind, dumb and  deaf, their abode will be Hell; whenever it abates, We shall increase  for them the fierceness of the Fire.", "That is their recompense, because they  denied Our Ayât (proofs, evidences, verses, lessons, signs,  revelations, etc.) and said: ”When we are bones and fragments, shall we  really be raised up as a new creation?”", "See they not that Allâh, Who created the  heavens and the earth, is Able to create the like of them. And He has  decreed for them an appointed term, whereof there is not doubt. But the  Zâlimûn (polytheists and wrong-doers, etc.) refuse (the truth the  Message of Islâmic Monotheism, and accept nothing) but disbelief.", "Say (to the disbelievers): ”If you  possessed the treasure of the Mercy of my Lord (wealth, money,  provision, etc.), then you would surely hold back (from spending) for  fear of (being exhausted), and man is ever miserly!”", "And indeed We gave to Mûsa (Moses) nine  clear signs. Ask then the Children of Israel, when he came to them,  then Fir’aun (Pharaoh) said to him: ”O Mûsa (Moses)! I think you are  indeed bewitched.”", "[Mûsa (Moses)] said: ”Verily, you know  that these signs have been sent down by none but the Lord of the  heavens and the earth as clear (evidences i.e. proofs of Allâh’s  Oneness and His Omnipotence, etc.). And I think you are, indeed, O  Fir’aun (Pharaoh) doomed to destruction (away from all good)!”", "So he resolved to turn them out of the land (of Egypt). But We drowned him and all who were with him.", "And We said to the Children of Israel  after him: ”Dwell in the land, then, when the final and the last  promise comes near [i.e. the Day of Resurrection or the descent of  Christ [’Iesa (Jesus), son of Maryam (Mary) on the earth]. We shall  bring you altogether as mixed crowd (gathered out of various  nations).[Tafsir Al-Qurtubî, Vol. 10, Page 338]", "And with truth We have sent it down  (i.e. the Qur’ân), and with truth it has descended. And We have sent  you (O Muhammad SAW) as nothing but a bearer of glad tidings (of  Paradise, for those who follow your Message of Islâmic Monotheism), and  a warner (of Hell-fire for those who refuse to follow your Message of  Islâmic Monotheism).", "And (it is) a Qur’ân which We have  divided (into parts), in order that you might recite it to men at  intervals. And We have revealed it by stages. (in 23 years).", "Say (O Muhammad SAW to them): ”Believe  in it (the Qur’ân) or do not believe (in it). Verily! Those who were  given knowledge before it (the Jews and the Christians like ’Abdullâh  bin Salâm and Salmân Al-Farisî), when it is recited to them, fall down  on their faces in humble prostration.”", "And they say: ”Glory be to our Lord! Truly, the Promise of our Lord must be fulfilled.”", "And they fall down on their faces weeping and it adds to their humility.[ Sajdah ]", "Say (O Muhammad SAW): ”Invoke Allâh or  invoke the Most Beneficent (Allâh), by whatever name you invoke Him (it  is the same), for to Him belong the Best Names. And offer your Salât  (prayer) neither aloud nor in a low voice, but follow a way between.", "And say: ”All the praises and thanks be  to Allâh, Who has not begotten a son (nor an offspring), and Who has no  partner in (His) Dominion, nor He is low to have a Walî (helper,  protector or supporter). And magnify Him with all the magnificence,  [Allâhu-Akbar (Allâh is the Most Great)].”"]}