{"name_ar": "سورة الكهف", "ayahs_ar": ["الْحَمْدُ لِلَّهِ الَّذِي أَنزَلَ عَلَى عَبْدِهِ الْكِتَابَ وَلَمْ يَجْعَل لَّهُ عِوَجَا", "قَيِّمًا لِّيُنذِرَ بَأْسًا شَدِيدًا مِن لَّدُنْهُ وَيُبَشِّرَ الْمُؤْمِنِينَ الَّذِينَ يَعْمَلُونَ الصَّالِحَاتِ أَنَّ لَهُمْ أَجْرًا حَسَنًا", "مَاكِثِينَ فِيهِ أَبَدًا", "وَيُنذِرَ الَّذِينَ قَالُوا اتَّخَذَ اللَّهُ وَلَدًا", "مَّا لَهُم بِهِ مِنْ عِلْمٍ وَلَا لِآبَائِهِمْ كَبُرَتْ كَلِمَةً تَخْرُجُ مِنْ أَفْوَاهِهِمْ إِن يَقُولُونَ إِلَّا كَذِبًا", "فَلَعَلَّكَ بَاخِعٌ نَّفْسَكَ عَلَى آثَارِهِمْ إِن لَّمْ يُؤْمِنُوا بِهَذَا الْحَدِيثِ أَسَفًا", "إِنَّا جَعَلْنَا مَا عَلَى الْأَرْضِ زِينَةً لَّهَا لِنَبْلُوَهُمْ أَيُّهُمْ أَحْسَنُ عَمَلًا", "وَإِنَّا لَجَاعِلُونَ مَا عَلَيْهَا صَعِيدًا جُرُزًا", "أَمْ حَسِبْتَ أَنَّ أَصْحَابَ الْكَهْفِ وَالرَّقِيمِ كَانُوا مِنْ آيَاتِنَا عَجَبًا", "إِذْ أَوَى الْفِتْيَةُ إِلَى الْكَهْفِ فَقَالُوا رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا", "فَضَرَبْنَا عَلَى آذَانِهِمْ فِي الْكَهْفِ سِنِينَ عَدَدًا", "ثُمَّ بَعَثْنَاهُمْ لِنَعْلَمَ أَيُّ الْحِزْبَيْنِ أَحْصَى لِمَا لَبِثُوا أَمَدًا", "نَحْنُ نَقُصُّ عَلَيْكَ نَبَأَهُم بِالْحَقِّ إِنَّهُمْ فِتْيَةٌ آمَنُوا بِرَبِّهِمْ وَزِدْنَاهُمْ هُدًى", "وَرَبَطْنَا عَلَى قُلُوبِهِمْ إِذْ قَامُوا فَقَالُوا رَبُّنَا رَبُّ السَّمَاوَاتِ وَالْأَرْضِ لَن نَّدْعُوَ مِن دُونِهِ إِلَهًا لَقَدْ قُلْنَا إِذًا شَطَطًا", "هَؤُلَاء قَوْمُنَا اتَّخَذُوا مِن دُونِهِ آلِهَةً لَّوْلَا يَأْتُونَ عَلَيْهِم بِسُلْطَانٍ بَيِّنٍ فَمَنْ أَظْلَمُ مِمَّنِ افْتَرَى عَلَى اللَّهِ كَذِبًا", "وَإِذِ اعْتَزَلْتُمُوهُمْ وَمَا يَعْبُدُونَ إِلَّا اللَّهَ فَأْوُوا إِلَى الْكَهْفِ يَنشُرْ لَكُمْ رَبُّكُم مِّن رَّحمته ويُهَيِّئْ لَكُم مِّنْ أَمْرِكُم مِّرْفَقًا", "وَتَرَى الشَّمْسَ إِذَا طَلَعَت تَّزَاوَرُ عَن كَهْفِهِمْ ذَاتَ الْيَمِينِ وَإِذَا غَرَبَت تَّقْرِضُهُمْ ذَاتَ الشِّمَالِ وَهُمْ فِي فَجْوَةٍ مِّنْهُ ذَلِكَ مِنْ آيَاتِ اللَّهِ مَن يَهْدِ اللَّهُ فَهُوَ الْمُهْتَدِي وَمَن يُضْلِلْ فَلَن تَجِدَ لَهُ وَلِيًّا مُّرْشِدًا", "وَتَحْسَبُهُمْ أَيْقَاظًا وَهُمْ رُقُودٌ وَنُقَلِّبُهُمْ ذَاتَ الْيَمِينِ وَذَاتَ الشِّمَالِ وَكَلْبُهُم بَاسِطٌ ذِرَاعَيْهِ بِالْوَصِيدِ لَوِ اطَّلَعْتَ عَلَيْهِمْ لَوَلَّيْتَ مِنْهُمْ فِرَارًا وَلَمُلِئْتَ مِنْهُمْ رُعْبًا", "وَكَذَلِكَ بَعَثْنَاهُمْ لِيَتَسَاءلُوا بَيْنَهُمْ قَالَ قَائِلٌ مِّنْهُمْ كَمْ لَبِثْتُمْ قَالُوا لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ قَالُوا رَبُّكُمْ أَعْلَمُ بِمَا لَبِثْتُمْ فَابْعَثُوا أَحَدَكُم بِوَرِقِكُمْ هَذِهِ إِلَى الْمَدِينَةِ فَلْيَنظُرْ أَيُّهَا أَزْكَى طَعَامًا فَلْيَأْتِكُم بِرِزْقٍ مِّنْهُ وَلْيَتَلَطَّفْ وَلَا يُشْعِرَنَّ بِكُمْ أَحَدًا", "إِنَّهُمْ إِن يَظْهَرُوا عَلَيْكُمْ يَرْجُمُوكُمْ أَوْ يُعِيدُوكُمْ فِي مِلَّتِهِمْ وَلَن تُفْلِحُوا إِذًا أَبَدًا", "وَكَذَلِكَ أَعْثَرْنَا عَلَيْهِمْ لِيَعْلَمُوا أَنَّ وَعْدَ اللَّهِ حَقٌّ وَأَنَّ السَّاعَةَ لَا رَيْبَ فِيهَا إِذْ يَتَنَازَعُونَ بَيْنَهُمْ أَمْرَهُمْ فَقَالُوا ابْنُوا عَلَيْهِم بُنْيَانًا رَّبُّهُمْ أَعْلَمُ بِهِمْ قَالَ الَّذِينَ غَلَبُوا عَلَى أَمْرِهِمْ لَنَتَّخِذَنَّ عَلَيْهِم مَّسْجِدًا", "سَيَقُولُونَ ثَلَاثَةٌ رَّابِعُهُمْ كَلْبُهُمْ وَيَقُولُونَ خَمْسَةٌ سَادِسُهُمْ كَلْبُهُمْ رَجْمًا بِالْغَيْبِ وَيَقُولُونَ سَبْعَةٌ وَثَامِنُهُمْ كَلْبُهُمْ قُل رَّبِّي أَعْلَمُ بِعِدَّتِهِم مَّا يَعْلَمُهُمْ إِلَّا قَلِيلٌ فَلَا تُمَارِ فِيهِمْ إِلَّا مِرَاء ظَاهِرًا وَلَا تَسْتَفْتِ فِيهِم مِّنْهُمْ أَحَدًا", "وَلَا تَقُولَنَّ لِشَيْءٍ إِنِّي فَاعِلٌ ذَلِكَ غَدًا", "إِلَّا أَن يَشَاء اللَّهُ وَاذْكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلْ عَسَى أَن يَهْدِيَنِ رَبِّي لِأَقْرَبَ مِنْ هَذَا رَشَدًا", "وَلَبِثُوا فِي كَهْفِهِمْ ثَلَاثَ مِائَةٍ سِنِينَ وَازْدَادُوا تِسْعًا", "قُلِ اللَّهُ أَعْلَمُ بِمَا لَبِثُوا لَهُ غَيْبُ السَّمَاوَاتِ وَالْأَرْضِ أَبْصِرْ بِهِ وَأَسْمِعْ مَا لَهُم مِّن دُونِهِ مِن وَلِيٍّ وَلَا يُشْرِكُ فِي حُكْمِهِ أَحَدًا", "وَاتْلُ مَا أُوحِيَ إِلَيْكَ مِن كِتَابِ رَبِّكَ لَا مُبَدِّلَ لِكَلِمَاتِهِ وَلَن تَجِدَ مِن دُونِهِ مُلْتَحَدًا", "وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُم بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ وَلَا تَعْدُ عَيْنَاكَ عَنْهُمْ تُرِيدُ زِينَةَ الْحَيَاةِ الدُّنْيَا وَلَا تُطِعْ مَنْ أَغْفَلْنَا قَلْبَهُ عَن ذِكْرِنَا وَاتَّبَعَ هَوَاهُ وَكَانَ أَمْرُهُ فُرُطًا", "وَقُلِ الْحَقُّ مِن رَّبِّكُمْ فَمَن شَاء فَلْيُؤْمِن وَمَن شَاء فَلْيَكْفُرْ إِنَّا أَعْتَدْنَا لِلظَّالِمِينَ نَارًا أَحَاطَ بِهِمْ سُرَادِقُهَا وَإِن يَسْتَغِيثُوا يُغَاثُوا بِمَاء كَالْمُهْلِ يَشْوِي الْوُجُوهَ بِئْسَ الشَّرَابُ وَسَاءتْ مُرْتَفَقًا", "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ إِنَّا لَا نُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا", "أُوْلَئِكَ لَهُمْ جَنَّاتُ عَدْنٍ تَجْرِي مِن تَحْتِهِمُ الْأَنْهَارُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍ وَيَلْبَسُونَ ثِيَابًا خُضْرًا مِّن سُندُسٍ وَإِسْتَبْرَقٍ مُّتَّكِئِينَ فِيهَا عَلَى الْأَرَائِكِ نِعْمَ الثَّوَابُ وَحَسُنَتْ مُرْتَفَقًا", "وَاضْرِبْ لَهُم مَّثَلًا رَّجُلَيْنِ جَعَلْنَا لِأَحَدِهِمَا جَنَّتَيْنِ مِنْ أَعْنَابٍ وَحَفَفْنَاهُمَا بِنَخْلٍ وَجَعَلْنَا بَيْنَهُمَا زَرْعًا", "كِلْتَا الْجَنَّتَيْنِ آتَتْ أُكُلَهَا وَلَمْ تَظْلِمْ مِنْهُ شَيْئًا وَفَجَّرْنَا خِلَالَهُمَا نَهَرًا", "وَكَانَ لَهُ ثَمَرٌ فَقَالَ لِصَاحِبِهِ وَهُوَ يُحَاوِرُهُ أَنَا أَكْثَرُ مِنكَ مَالًا وَأَعَزُّ نَفَرًا", "وَدَخَلَ جَنَّتَهُ وَهُوَ ظَالِمٌ لِّنَفْسِهِ قَالَ مَا أَظُنُّ أَن تَبِيدَ هَذِهِ أَبَدًا", "وَمَا أَظُنُّ السَّاعَةَ قَائِمَةً وَلَئِن رُّدِدتُّ إِلَى رَبِّي لَأَجِدَنَّ خَيْرًا مِّنْهَا مُنقَلَبًا", "قَالَ لَهُ صَاحِبُهُ وَهُوَ يُحَاوِرُهُ أَكَفَرْتَ بِالَّذِي خَلَقَكَ مِن تُرَابٍ ثُمَّ مِن نُّطْفَةٍ ثُمَّ سَوَّاكَ رَجُلًا", "لَّكِنَّا هُوَ اللَّهُ رَبِّي وَلَا أُشْرِكُ بِرَبِّي أَحَدًا", "وَلَوْلَا إِذْ دَخَلْتَ جَنَّتَكَ قُلْتَ مَا شَاء اللَّهُ لَا قُوَّةَ إِلَّا بِاللَّهِ إِن تُرَنِ أَنَا أَقَلَّ مِنكَ مَالًا وَوَلَدًا", "فَعَسَى رَبِّي أَن يُؤْتِيَنِ خَيْرًا مِّن جَنَّتِكَ وَيُرْسِلَ عَلَيْهَا حُسْبَانًا مِّنَ السَّمَاء فَتُصْبِحَ صَعِيدًا زَلَقًا", "أَوْ يُصْبِحَ مَاؤُهَا غَوْرًا فَلَن تَسْتَطِيعَ لَهُ طَلَبًا", "وَأُحِيطَ بِثَمَرِهِ فَأَصْبَحَ يُقَلِّبُ كَفَّيْهِ عَلَى مَا أَنفَقَ فِيهَا وَهِيَ خَاوِيَةٌ عَلَى عُرُوشِهَا وَيَقُولُ يَا لَيْتَنِي لَمْ أُشْرِكْ بِرَبِّي أَحَدًا", "وَلَمْ تَكُن لَّهُ فِئَةٌ يَنصُرُونَهُ مِن دُونِ اللَّهِ وَمَا كَانَ مُنتَصِرًا", "هُنَالِكَ الْوَلَايَةُ لِلَّهِ الْحَقِّ هُوَ خَيْرٌ ثَوَابًا وَخَيْرٌ عُقْبًا", "وَاضْرِبْ لَهُم مَّثَلَ الْحَيَاةِ الدُّنْيَا كَمَاء أَنزَلْنَاهُ مِنَ السَّمَاء فَاخْتَلَطَ بِهِ نَبَاتُ الْأَرْضِ فَأَصْبَحَ هَشِيمًا تَذْرُوهُ الرِّيَاحُ وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ مُّقْتَدِرًا", "الْمَالُ وَالْبَنُونَ زِينَةُ الْحَيَاةِ الدُّنْيَا وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِندَ رَبِّكَ ثَوَابًا وَخَيْرٌ أَمَلًا", "وَيَوْمَ نُسَيِّرُ الْجِبَالَ وَتَرَى الْأَرْضَ بَارِزَةً وَحَشَرْنَاهُمْ فَلَمْ نُغَادِرْ مِنْهُمْ أَحَدًا", "وَعُرِضُوا عَلَى رَبِّكَ صَفًّا لَّقَدْ جِئْتُمُونَا كَمَا خَلَقْنَاكُمْ أَوَّلَ مَرَّةٍ بَلْ زَعَمْتُمْ أَلَّن نَّجْعَلَ لَكُم مَّوْعِدًا", "وَوُضِعَ الْكِتَابُ فَتَرَى الْمُجْرِمِينَ مُشْفِقِينَ مِمَّا فِيهِ وَيَقُولُونَ يَا وَيْلَتَنَا مَالِ هَذَا الْكِتَابِ لَا يُغَادِرُ صَغِيرَةً وَلَا كَبِيرَةً إِلَّا أَحْصَاهَا وَوَجَدُوا مَا عَمِلُوا حَاضِرًا وَلَا يَظْلِمُ رَبُّكَ أَحَدًا", "وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ كَانَ مِنَ الْجِنِّ فَفَسَقَ عَنْ أَمْرِ رَبِّهِ أَفَتَتَّخِذُونَهُ وَذُرِّيَّتَهُ أَوْلِيَاء مِن دُونِي وَهُمْ لَكُمْ عَدُوٌّ بِئْسَ لِلظَّالِمِينَ بَدَلًا", "مَا أَشْهَدتُّهُمْ خَلْقَ السَّمَاوَاتِ وَالْأَرْضِ وَلَا خَلْقَ أَنفُسِهِمْ وَمَا كُنتُ مُتَّخِذَ الْمُضِلِّينَ عَضُدًا", "وَيَوْمَ يَقُولُ نَادُوا شُرَكَائِيَ الَّذِينَ زَعَمْتُمْ فَدَعَوْهُمْ فَلَمْ يَسْتَجِيبُوا لَهُمْ وَجَعَلْنَا بَيْنَهُم مَّوْبِقًا", "وَرَأَى الْمُجْرِمُونَ النَّارَ فَظَنُّوا أَنَّهُم مُّوَاقِعُوهَا وَلَمْ يَجِدُوا عَنْهَا مَصْرِفًا", "وَلَقَدْ صَرَّفْنَا فِي هَذَا الْقُرْآنِ لِلنَّاسِ مِن كُلِّ مَثَلٍ وَكَانَ الْإِنسَانُ أَكْثَرَ شَيْءٍ جَدَلًا", "وَمَا مَنَعَ النَّاسَ أَن يُؤْمِنُوا إِذْ جَاءهُمُ الْهُدَى وَيَسْتَغْفِرُوا رَبَّهُمْ إِلَّا أَن تَأْتِيَهُمْ سُنَّةُ الْأَوَّلِينَ أَوْ يَأْتِيَهُمُ الْعَذَابُ قُبُلًا", "وَمَا نُرْسِلُ الْمُرْسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَ وَيُجَادِلُ الَّذِينَ كَفَرُوا بِالْبَاطِلِ لِيُدْحِضُوا بِهِ الْحَقَّ وَاتَّخَذُوا آيَاتِي وَمَا أُنذِرُوا هُزُوًا", "وَمَنْ أَظْلَمُ مِمَّن ذُكِّرَ بِآيَاتِ رَبِّهِ فَأَعْرَضَ عَنْهَا وَنَسِيَ مَا قَدَّمَتْ يَدَاهُ إِنَّا جَعَلْنَا عَلَى قُلُوبِهِمْ أَكِنَّةً أَن يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا وَإِن تَدْعُهُمْ إِلَى الْهُدَى فَلَن يَهْتَدُوا إِذًا أَبَدًا", "وَرَبُّكَ الْغَفُورُ ذُو الرَّحْمَةِ لَوْ يُؤَاخِذُهُم بِمَا كَسَبُوا لَعَجَّلَ لَهُمُ الْعَذَابَ بَل لَّهُم مَّوْعِدٌ لَّن يَجِدُوا مِن دُونِهِ مَوْئِلًا", "وَتِلْكَ الْقُرَى أَهْلَكْنَاهُمْ لَمَّا ظَلَمُوا وَجَعَلْنَا لِمَهْلِكِهِم مَّوْعِدًا", "وَإِذْ قَالَ مُوسَى لِفَتَاهُ لَا أَبْرَحُ حَتَّى أَبْلُغَ مَجْمَعَ الْبَحْرَيْنِ أَوْ أَمْضِيَ حُقُبًا", "فَلَمَّا بَلَغَا مَجْمَعَ بَيْنِهِمَا نَسِيَا حُوتَهُمَا فَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ سَرَبًا", "فَلَمَّا جَاوَزَا قَالَ لِفَتَاهُ آتِنَا غَدَاءنَا لَقَدْ لَقِينَا مِن سَفَرِنَا هَذَا نَصَبًا", "قَالَ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ وَمَا أَنسَانِيهُ إِلَّا الشَّيْطَانُ أَنْ أَذْكُرَهُ وَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ عَجَبًا", "قَالَ ذَلِكَ مَا كُنَّا نَبْغِ فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا", "فَوَجَدَا عَبْدًا مِّنْ عِبَادِنَا آتَيْنَاهُ رَحْمَةً مِنْ عِندِنَا وَعَلَّمْنَاهُ مِن لَّدُنَّا عِلْمًا", "قَالَ لَهُ مُوسَى هَلْ أَتَّبِعُكَ عَلَى أَن تُعَلِّمَنِ مِمَّا عُلِّمْتَ رُشْدًا", "قَالَ إِنَّكَ لَن تَسْتَطِيعَ مَعِيَ صَبْرًا", "وَكَيْفَ تَصْبِرُ عَلَى مَا لَمْ تُحِطْ بِهِ خُبْرًا", "قَالَ سَتَجِدُنِي إِن شَاء اللَّهُ صَابِرًا وَلَا أَعْصِي لَكَ أَمْرًا", "قَالَ فَإِنِ اتَّبَعْتَنِي فَلَا تَسْأَلْنِي عَن شَيْءٍ حَتَّى أُحْدِثَ لَكَ مِنْهُ ذِكْرًا", "فَانطَلَقَا حَتَّى إِذَا رَكِبَا فِي السَّفِينَةِ خَرَقَهَا قَالَ أَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا لَقَدْ جِئْتَ شَيْئًا إِمْرًا", "قَالَ أَلَمْ أَقُلْ إِنَّكَ لَن تَسْتَطِيعَ مَعِيَ صَبْرًا", "قَالَ لَا تُؤَاخِذْنِي بِمَا نَسِيتُ وَلَا تُرْهِقْنِي مِنْ أَمْرِي عُسْرًا", "فَانطَلَقَا حَتَّى إِذَا لَقِيَا غُلَامًا فَقَتَلَهُ قَالَ أَقَتَلْتَ نَفْسًا زَكِيَّةً بِغَيْرِ نَفْسٍ لَّقَدْ جِئْتَ شَيْئًا نُّكْرًا", "قَالَ أَلَمْ أَقُل لَّكَ إِنَّكَ لَن تَسْتَطِيعَ مَعِي صَبْرًا", "قَالَ إِن سَأَلْتُكَ عَن شَيْءٍ بَعْدَهَا فَلَا تُصَاحِبْنِي قَدْ بَلَغْتَ مِن لَّدُنِّي عُذْرًا", "فَانطَلَقَا حَتَّى إِذَا أَتَيَا أَهْلَ قَرْيَةٍ اسْتَطْعَمَا أَهْلَهَا فَأَبَوْا أَن يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارًا يُرِيدُ أَنْ يَنقَضَّ فَأَقَامَهُ قَالَ لَوْ شِئْتَ لَاتَّخَذْتَ عَلَيْهِ أَجْرًا", "قَالَ هَذَا فِرَاقُ بَيْنِي وَبَيْنِكَ سَأُنَبِّئُكَ بِتَأْوِيلِ مَا لَمْ تَسْتَطِع عَّلَيْهِ صَبْرًا", "أَمَّا السَّفِينَةُ فَكَانَتْ لِمَسَاكِينَ يَعْمَلُونَ فِي الْبَحْرِ فَأَرَدتُّ أَنْ أَعِيبَهَا وَكَانَ وَرَاءهُم مَّلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ غَصْبًا", "وَأَمَّا الْغُلَامُ فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ فَخَشِينَا أَن يُرْهِقَهُمَا طُغْيَانًا وَكُفْرًا", "فَأَرَدْنَا أَن يُبْدِلَهُمَا رَبُّهُمَا خَيْرًا مِّنْهُ زَكَاةً وَأَقْرَبَ رُحْمًا", "وَأَمَّا الْجِدَارُ فَكَانَ لِغُلَامَيْنِ يَتِيمَيْنِ فِي الْمَدِينَةِ وَكَانَ تَحْتَهُ كَنزٌ لَّهُمَا وَكَانَ أَبُوهُمَا صَالِحًا فَأَرَادَ رَبُّكَ أَنْ يَبْلُغَا أَشُدَّهُمَا وَيَسْتَخْرِجَا كَنزَهُمَا رَحْمَةً مِّن رَّبِّكَ وَمَا فَعَلْتُهُ عَنْ أَمْرِي ذَلِكَ تَأْوِيلُ مَا لَمْ تَسْطِع عَّلَيْهِ صَبْرًا", "وَيَسْأَلُونَكَ عَن ذِي الْقَرْنَيْنِ قُلْ سَأَتْلُو عَلَيْكُم مِّنْهُ ذِكْرًا", "إِنَّا مَكَّنَّا لَهُ فِي الْأَرْضِ وَآتَيْنَاهُ مِن كُلِّ شَيْءٍ سَبَبًا", "فَأَتْبَعَ سَبَبًا", "حَتَّى إِذَا بَلَغَ مَغْرِبَ الشَّمْسِ وَجَدَهَا تَغْرُبُ فِي عَيْنٍ حَمِئَةٍ وَوَجَدَ عِندَهَا قَوْمًا قُلْنَا يَا ذَا الْقَرْنَيْنِ إِمَّا أَن تُعَذِّبَ وَإِمَّا أَن تَتَّخِذَ فِيهِمْ حُسْنًا", "قَالَ أَمَّا مَن ظَلَمَ فَسَوْفَ نُعَذِّبُهُ ثُمَّ يُرَدُّ إِلَى رَبِّهِ فَيُعَذِّبُهُ عَذَابًا نُّكْرًا", "وَأَمَّا مَنْ آمَنَ وَعَمِلَ صَالِحًا فَلَهُ جَزَاء الْحُسْنَى وَسَنَقُولُ لَهُ مِنْ أَمْرِنَا يُسْرًا", "ثُمَّ أَتْبَعَ سَبَبًا", "حَتَّى إِذَا بَلَغَ مَطْلِعَ الشَّمْسِ وَجَدَهَا تَطْلُعُ عَلَى قَوْمٍ لَّمْ نَجْعَل لَّهُم مِّن دُونِهَا سِتْرًا", "كَذَلِكَ وَقَدْ أَحَطْنَا بِمَا لَدَيْهِ خُبْرًا", "ثُمَّ أَتْبَعَ سَبَبًا", "حَتَّى إِذَا بَلَغَ بَيْنَ السَّدَّيْنِ وَجَدَ مِن دُونِهِمَا قَوْمًا لَّا يَكَادُونَ يَفْقَهُونَ قَوْلًا", "قَالُوا يَا ذَا الْقَرْنَيْنِ إِنَّ يَأْجُوجَ وَمَأْجُوجَ مُفْسِدُونَ فِي الْأَرْضِ فَهَلْ نَجْعَلُ لَكَ خَرْجًا عَلَى أَن تَجْعَلَ بَيْنَنَا وَبَيْنَهُمْ سَدًّا", "قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيْرٌ فَأَعِينُونِي بِقُوَّةٍ أَجْعَلْ بَيْنَكُمْ وَبَيْنَهُمْ رَدْمًا", "آتُونِي زُبَرَ الْحَدِيدِ حَتَّى إِذَا سَاوَى بَيْنَ الصَّدَفَيْنِ قَالَ انفُخُوا حَتَّى إِذَا جَعَلَهُ نَارًا قَالَ آتُونِي أُفْرِغْ عَلَيْهِ قِطْرًا", "فَمَا اسْطَاعُوا أَن يَظْهَرُوهُ وَمَا اسْتَطَاعُوا لَهُ نَقْبًا", "قَالَ هَذَا رَحْمَةٌ مِّن رَّبِّي فَإِذَا جَاء وَعْدُ رَبِّي جَعَلَهُ دَكَّاء وَكَانَ وَعْدُ رَبِّي حَقًّا", "وَتَرَكْنَا بَعْضَهُمْ يَوْمَئِذٍ يَمُوجُ فِي بَعْضٍ وَنُفِخَ فِي الصُّورِ فَجَمَعْنَاهُمْ جَمْعًا", "وَعَرَضْنَا جَهَنَّمَ يَوْمَئِذٍ لِّلْكَافِرِينَ عَرْضًا", "الَّذِينَ كَانَتْ أَعْيُنُهُمْ فِي غِطَاء عَن ذِكْرِي وَكَانُوا لَا يَسْتَطِيعُونَ سَمْعًا", "أَفَحَسِبَ الَّذِينَ كَفَرُوا أَن يَتَّخِذُوا عِبَادِي مِن دُونِي أَوْلِيَاء إِنَّا أَعْتَدْنَا جَهَنَّمَ لِلْكَافِرِينَ نُزُلًا", "قُلْ هَلْ نُنَبِّئُكُمْ بِالْأَخْسَرِينَ أَعْمَالًا", "الَّذِينَ ضَلَّ سَعْيُهُمْ فِي الْحَيَاةِ الدُّنْيَا وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا", "أُولَئِكَ الَّذِينَ كَفَرُوا بِآيَاتِ رَبِّهِمْ وَلِقَائِهِ فَحَبِطَتْ أَعْمَالُهُمْ فَلَا نُقِيمُ لَهُمْ يَوْمَ الْقِيَامَةِ وَزْنًا", "ذَلِكَ جَزَاؤُهُمْ جَهَنَّمُ بِمَا كَفَرُوا وَاتَّخَذُوا آيَاتِي وَرُسُلِي هُزُوًا", "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ كَانَتْ لَهُمْ جَنَّاتُ الْفِرْدَوْسِ نُزُلًا", "خَالِدِينَ فِيهَا لَا يَبْغُونَ عَنْهَا حِوَلًا", "قُل لَّوْ كَانَ الْبَحْرُ مِدَادًا لِّكَلِمَاتِ رَبِّي لَنَفِدَ الْبَحْرُ قَبْلَ أَن تَنفَدَ كَلِمَاتُ رَبِّي وَلَوْ جِئْنَا بِمِثْلِهِ مَدَدًا", "قُلْ إِنَّمَا أَنَا بَشَرٌ مِّثْلُكُمْ يُوحَى إِلَيَّ أَنَّمَا إِلَهُكُمْ إِلَهٌ وَاحِدٌ فَمَن كَانَ يَرْجُو لِقَاء رَبِّهِ فَلْيَعْمَلْ عَمَلًا صَالِحًا وَلَا يُشْرِكْ بِعِبَادَةِ رَبِّهِ أَحَدًا"], "name_en": "Al-Kahf", "ayahs_en": ["All the praises and thanks be to Allâh,  Who has sent down to His slave (Muhammad SAW) the Book (the Qur’ân),  and has not placed therein any crookedness.", "(He has made it) Straight to give  warning (to the disbelievers) of a severe punishment from Him, and to  give glad tidings to the believers (in the Oneness of Allâh Islâmic  Monotheism), who work righteous deeds, that they shall have a fair  reward (i.e. Paradise).", "They shall abide therein forever.", "And to warn those (Jews, Christians, and pagans) who say, ”Allâh has begotten a son (or offspring or children).”", "No knowledge have they of such a thing,  nor had their fathers. Mighty is the word that comes out of their  mouths [i.e. He begot (took) sons and daughters]. They utter nothing  but a lie.", "Perhaps, you, would kill yourself (O  Muhammad SAW) in grief, over their footsteps (for their turning away  from you), because they believe not in this narration (the Qur’ân).", "Verily! We have made that which is on  earth as an adornment for it, in order that We may test them (mankind)  as to which of them are best in deeds. [i.e.those who do good deeds in  the most perfect manner, that means to do them (deeds) totally for  Allâh’s sake and in accordance to the legal ways of the Prophet SAW ].", "And verily! We shall make all that is on it (the earth) a bare dry soil (without any vegetation or trees, etc.).", "Do you think that the people of the Cave  and the Inscription (the news or the names of the people of the Cave)  were a wonder among Our Signs?", "(Remember) when the young men fled for  refuge (from their disbelieving folk) to the Cave, they said: ”Our  Lord! Bestow on us mercy from Yourself, and facilitate for us our  affair in the right way!”", "Therefore We covered up their (sense of) hearing (causing them, to go in deep sleep) in the Cave for a number of years.", "Then We raised them up (from their  sleep), that We might test which of the two parties was best at  calculating the time period that they had tarried.", "We narrate unto you (O Muhammad SAW)  their story with truth: Truly! They were young men who believed in  their Lord (Allâh), and We increased them in guidance.", "And We made their hearts firm and strong  (with the light of Faith in Allâh and bestowed upon them patience to  bear the separation of their kith and kin and dwellings, etc.) when  they stood up and said: ”Our Lord is the Lord of the heavens and the  earth, never shall we call upon any ilâh (god) other than Him; if we  did, we should indeed have uttered an enormity in disbelief.", "”These our people have taken for worship  âliha (gods) other than Him (Allâh). Why do they not bring for them a  clear authority? And who does more wrong than he who invents a lie  against Allâh.", "(The young men said to one another):  ”And when you withdraw from them, and that which they worship, except  Allâh, then seek refuge in the Cave, your Lord will open a way for you  from His Mercy and will make easy for you your affair (i.e. will give  you what you will need of provision, dwelling, etc.).”", "And you might have seen the sun, when it  rose, declining to the right from their Cave, and when it set, turning  away from them to the left, while they lay in the midst of the Cave.  That is (one) of the Ayât (proofs, evidences, signs) of Allâh. He whom  Allâh guides, is rightly guided; but he whom He sends astray, for him  you will find no Walî (guiding friend) to lead him (to the right Path).", "And you would have thought them awake,  while they were asleep. And We turned them on their right and on their  left sides, and their dog stretching forth his two forelegs at the  entrance [of the Cave or in the space near to the entrance of the Cave  (as a guard at the gate)]. Had you looked at them, you would certainly  have turned back from them in flight, and would certainly have been  filled with awe of them.", "Likewise, We awakened them (from their  long deep sleep) that they might question one another. A speaker from  among them said: ”How long have you stayed (here)?” They said: ”We have  stayed (perhaps) a day or part of a day.” They said: ”Your Lord (Alone)  knows best how long you have stayed (here). So send one of you with  this silver coin of yours to the town, and let him find out which is  the good lawful food, and bring some of that to you. And let him be  careful and let no man know of you.", "”For if they come to know of you, they  will stone you (to death or abuse and harm you) or turn you back to  their religion, and in that case you will never be successful.”", "And thus We made their case known to the  people, that they might know that the Promise of Allâh is true, and  that there can be no doubt about the Hour. (Remember) when they (the  people of the city) disputed among themselves about their case, they  said: ”Construct a building over them, their Lord knows best about  them,” (then) those who won their point said (most probably the  disbelievers): ”We verily shall build a place of worship over them.”", "(Some) say they were three, the dog  being the fourth among them; (others) say they were five, the dog being  the sixth, guessing at the unseen; (yet others) say they were seven,  the dog being the eighth. Say (O Muhammad SAW): ”My Lord knows best  their number; none knows them but a few.” So debate not (about their  number, etc.) except with the clear proof (which We have revealed to  you). And consult not any of them (people of the Scripture, Jews and  Christians) about (the affair of) the people of the Cave.", "And never say of anything, ”I shall do such and such thing tomorrow.”", "Except (with the saying), ”If Allâh  will!” And remember your Lord when you forget and say: ”It may be that  my Lord guides me unto a nearer way of truth than this.”", "And they stayed in their Cave three hundred (solar) years, and add nine (for lunar years).", "Say: ”Allâh knows best how long they  stayed. With Him is (the knowledge of) the unseen of the heavens and  the earth. How clearly He sees, and hears (everything)! They have no  Walî (Helper, Disposer of affairs, Protector, etc.) other than Him, and  He makes none to share in His Decision and His Rule.”", "And recite what has been revealed to you  (O Muhammad SAW) of the Book (the Qur’ân) of your Lord (i.e. recite it,  understand and follow its teachings and act on its orders and preach it  to men). None can change His Words, and none will you find as a refuge  other than Him.", "And keep yourself (O Muhammad SAW)  patiently with those who call on their Lord (i.e. your companions who  remember their Lord with glorification, praising in prayers, etc., and  other righteous deeds, etc.) morning and afternoon, seeking His Face,  and let not your eyes overlook them, desiring the pomp and glitter of  the life of the world; and obey not him whose heart We have made  heedless of Our Remembrance, one who follows his own lusts and whose  affair (deeds) has been lost.", "And say: ”The truth is from your Lord.”  Then whosoever wills, let him believe, and whosoever wills, let him  disbelieve. Verily, We have prepared for the Zâlimûn (polytheists and  wrong-doers, etc.), a Fire whose walls will be surrounding them  (disbelievers in the Oneness of Allâh). And if they ask for help  (relief, water, etc.) they will be granted water like boiling oil, that  will scald their faces. Terrible the drink, and an evil Murtafaqâ  (dwelling, resting place, etc.)!", "Verily! As for those who believe and do  righteous deeds, certainly! We shall not suffer to be lost the reward  of anyone who does his (righteous) deeds in the most perfect manner.", "These! For them will be ’Adn (Eden)  Paradise (everlasting Gardens); wherein rivers flow underneath them,  therein they will be adorned with bracelets of gold, and they will wear  green garments of fine and thick silk. They will recline therein on  raised thrones. How good is the reward, and what an excellent Murtafaqâ  (dwelling, resting place, etc.)!", "And put forward to them the example of  two men; unto one of them We had given two gardens of grapes, and We  had surrounded both with date-palms; and had put between them green  crops (cultivated fields etc.).", "Each of those two gardens brought forth  its produce, and failed not in the least therein, and We caused a river  to gush forth in the midst of them.", "And he had property (or fruit) and he  said to his companion, in the course of mutual talk: I am more than you  in wealth and stronger in respect of men.” [See Tafsir Qurtubî, Vol.  10, Page 403].", "And he went into his garden while in a  state (of pride and disbelief) unjust to himself. He said: ”I think not  that this will ever perish.", "”And I think not the Hour will ever  come, and if indeed I am brought back to my Lord, (on the Day of  Resurrection), I surely shall find better than this when I return to  Him.”", "His companion said to him, during the  talk with him: ”Do you disbelieve in Him Who created you out of dust  (i.e. your father Adam), then out of Nutfah (mixed semen drops of male  and female discharge), then fashioned you into a man?", "”But as for my part (I believe) that He is Allâh, my Lord and none shall I associate as partner with my Lord.", "It was better for you to say, when you  entered your garden: ’That which Allâh wills (will come to pass)! There  is no power but with Allâh ’. If you see me less than you in wealth,  and children.", "”It may be that my Lord will give me  something better than your garden, and will send on it Husbân (torment,  bolt, etc.) from the sky, then it will be a slippery earth.", "”Or the water thereof (of the gardens) becomes deep-sunken (underground) so that you will never be able to seek it.”", "So his fruits were encircled (with  ruin). And he remained clapping his hands with sorrow over what he had  spent upon it, while it was all destroyed on its trellises, he could  only say: ”Would I had ascribed no partners to my Lord!” [Tafsir Ibn  Kathîr]", "And he had no group of men to help him against Allâh, nor could he defend or save himself.", "There (on the Day of Resurrection),  Al-Walâyah (the protection, power, authority and kingdom) will be for  Allâh (Alone), the True God. He (Allâh) is the Best for reward and the  Best for the final end. (Lâ ilâha ill-Allâh none has the right to be  worshipped but Allâh).", "And put forward to them the example of  the life of this world, it is like the water (rain) which We send down  from the sky, and the vegetation of the earth mingles with it, and  becomes fresh and green. But (later) it becomes dry and broken pieces,  which the winds scatter. And Allâh is Able to do everything.", "Wealth and children are the adornment of  the life of this world. But the good righteous deeds (five compulsory  prayers, deeds of Allâh’s obedience, good and nice talk, remembrance of  Allâh with glorification, praises and thanks, etc.), that last, are  better with your Lord for rewards and better in respect of hope.", "And (remember) the Day We shall cause  the mountains to pass away (like clouds of dust), and you will see the  earth as a levelled plain, and we shall gather them all together so as  to leave not one of them behind.", "And they will be set before your Lord in  (lines as) rows, (and Allâh will say): ”Now indeed, you have come to Us  as We created you the first time. Nay, but you thought that We had  appointed no meeting for you (with Us).”", "And the Book (one’s Record) will be  placed (in the right hand for a believer in the Oneness of Allâh, and  in the left hand for a disbeliever in the Oneness of Allâh), and you  will see the Mujrimûn (criminals, polytheists, sinners, etc.), fearful  of that which is (recorded) therein. They will say: ”Woe to us! What  sort of Book is this that leaves neither a small thing nor a big thing,  but has recorded it with numbers!” And they will find all that they  did, placed before them, and your Lord treats no one with injustice.", "And (remember) when We said to the  angels; ”Prostrate to Adam.” So they prostrated except Iblîs (Satan).  He was one of the jinns; he disobeyed the Command of his Lord. Will you  then take him (Iblîs) and his offspring as protectors and helpers  rather than Me while they are enemies to you? What an evil is the  exchange for the Zâlimûn (polytheists, and wrong-doers, etc).", "I (Allâh) made them (Iblîs and his  offspring) not to witness (nor took their help in) the creation of the  heavens and the earth and not (even) their own creation, nor was I  (Allâh) to take the misleaders as helpers.", "And (remember) the Day He will say:”Call  those (so-called) partners of Mine whom you pretended.” Then they will  cry unto them, but they will not answer them, and We shall put Maubiqa  (a barrier, or enmity, or destruction, or a valley in Hell) between  them.", "And the Mujrimûn (criminals,  polytheists, sinners), shall see the Fire and apprehend that they have  to fall therein. And they will find no way of escape from there.", "And indeed We have put forth every kind of example in this Qur’ân, for mankind. But, man is ever more quarrelsome than anything.", "And nothing prevents men from believing,  now when the guidance (the Qur’ân) has come to them, and from asking  Forgiveness of their Lord, except that the ways of the ancients be  repeated with them (i.e. their destruction decreed by Allâh), or the  torment be brought to them face to face?", "And We send not the Messengers except as  giver of glad tidings and warners. But those who disbelieve, dispute  with false argument, in order to refute the truth thereby. And they  treat My Ayât (proofs, evidences, verses, lessons, signs, revelations,  etc.), and that with which they are warned, as jest and mockery!", "And who does more wrong than he who is  reminded of the Ayât (proofs, evidences, verses, lessons, signs,  revelations, etc.) of his Lord, but turns away from them forgetting  what (deeds) his hands have sent forth. Truly, We have set veils over  their hearts lest they should understand this (the Qur’ân), and in  their ears, deafness. And if you (O Muhammad SAW) call them to  guidance, even then they will never be guided.", "And your Lord is Most Forgiving, Owner  of Mercy. Were He to call them to account for what they have earned,  then surely, He would have hastened their punishment. But they have  their appointed time, beyond which they will find no escape.", "And these towns (population, ’Ad,  Thamûd, etc.) We destroyed when they did wrong. And We appointed a  fixed time for their destruction.", "And (remember) when Mûsa (Moses) said to  his boy-servant: ”I will not give up (travelling) until I reach the  junction of the two seas or (until) I spend years and years in  travelling.”", "But when they reached the junction of the two seas, they forgot their fish, and it took its way through the sea as in a tunnel.", "So when they had passed further on  (beyond that fixed place), Mûsa (Moses) said to his boy-servant: ”Bring  us our morning meal; truly, we have suffered much fatigue in this, our  journey.”", "He said:”Do you remember when we betook  ourselves to the rock? I indeed forgot the fish, none but Shaitân  (Satan) made me forget to remember it. It took its course into the sea  in a strange (way)!”", "[Mûsa (Moses)] said: ”That is what we have been seeking.” So they went back retracing their footsteps.", "Then they found one of Our slaves, unto whom We had bestowed mercy from Us, and whom We had taught knowledge from Us.", "Mûsa (Moses) said to him (Khidr) ”May I  follow you so that you teach me something of that knowledge (guidance  and true path) which you have been taught (by Allâh)?”", "He (Khidr) said: ”Verily! You will not be able to have patience with me!", "”And how can you have patience about a thing which you know not?”", "Mûsa (Moses) said: ”If Allâh will, you will find me patient, and I will not disobey you in aught.”", "He (Khidr) said: ”Then, if you follow me, ask me not about anything till I myself mention it to you.”", "So they both proceeded, till, when they  embarked the ship, he (Khidr) scuttled it. Mûsa (Moses) said: ”Have you  scuttled it in order to drown its people? Verily, you have committed a  thing ”Imra” (a Munkar - evil, bad, dreadful thing).”", "He (Khidr) said: ”Did I not tell you, that you would not be able to have patience with me?”", "[Mûsa (Moses)] said: ”Call me not to account for what I forgot, and be not hard upon me for my affair (with you).”", "Then they both proceeded, till they met  a boy, he (Khidr) killed him. Mûsa (Moses) said: ”Have you killed an  innocent person who had killed none? Verily, you have committed a thing  ”Nukra” (a great Munkar - prohibited, evil, dreadful thing)!”", "(Khidr) said: ”Did I not tell you that you can have no patience with me?”", "[Mûsa (Moses)] said: ”If I ask you anything after this, keep me not in your company, you have received an excuse from me.”", "Then they both proceeded, till, when  they came to the people of a town, they asked them for food, but they  refused to entertain them. Then they found therein a wall about to  collapse and he (Khidr) set it up straight. [Mûsa (Moses)] said: If you  had wished, surely, you could have taken wages for it!”", "(Khidr) said: ”This is the parting  between me and you, I will tell you the interpretation of (those)  things over which you were unable to hold patience.", "”As for the ship, it belonged to Masâkîn  (poor people) working in the sea. So I wished to make a defective  damage in it, as there was a king after them who seized every ship by  force.", "”And as for the boy, his parents were believers, and we feared lest he should oppress them by rebellion and disbelief.", "”So we intended that their Lord should change him for them for one better in righteousness and near to mercy.", "”And as for the wall, it belonged to two  orphan boys in the town; and there was under it a treasure belonging to  them; and their father was a righteous man, and your Lord intended that  they should attain their age of full strength and take out their  treasure as a mercy from your Lord. And I did it not of my own accord.  That is the interpretation of those (things) over which you could not  hold patience.”", "And they ask you about Dhul-Qarnain. Say: ”I shall recite to you something of his story.”", "Verily, We established him in the earth, and We gave him the means of everything.", "So he followed a way.", "Until, when he reached the setting place  of the sun, he found it setting in a spring of black muddy (or hot)  water. And he found near it a people. We (Allâh) said (by inspiration):  ”O Dhul-Qarnain! Either you punish them, or treat them with kindness.”", "He said: ”As for him (a disbeliever in  the Oneness of Allâh) who does wrong, we shall punish him; and then he  will be brought back unto his Lord; Who will punish him with a terrible  torment (Hell).", "”But as for him who believes (in Allâh’s  Oneness) and works righteousness, he shall have the best reward,  (Paradise), and we (Dhul-Qarnain) shall speak unto him mild words (as  instructions).”", "Then he followed another way,", "Until, when he came to the rising place  of the sun, he found it rising on a people for whom We (Allâh) had  provided no shelter against the sun.", "So (it was)! And We knew all about him (Dhul-Qarnain).", "Then he followed (another) way,", "Until, when he reached between two  mountains, he found, before (near) them (those two mountains), a people  who scarcely understood a word.", "They said: ”O Dhul-Qarnain! Verily!  Ya’jûj and Ma’jûj (Gog and Magog) are doing great mischief in the land.  Shall we then pay you a tribute in order that you might erect a barrier  between us and them?”", "He said: ”That (wealth, authority and  power) in which my Lord had established me is better (than your  tribute). So help me with strength (of men), I will erect between you  and them a barrier.", "”Give me pieces (blocks) of iron,” then,  when he had filled up the gap between the two mountain-cliffs, he said:  ”Blow,” till when he had made it (red as) fire, he said: ”Bring me  molten copper to pour over it.”", "So they [Ya’jûj and Ma’jûj (Gog and Magog)] were made powerless to scale it or dig through it.", "Dhul-Qarnain) said: ”This is a mercy  from my Lord, but when the Promise of my Lord comes, He shall level it  down to the ground. And the Promise of my Lord is ever true.”", "And on that Day [i.e. the Day Ya’jûj and  Ma’jûj (Gog and Magog) will come out], We shall leave them to surge  like waves on one another, and the Trumpet will be blown, and We shall  collect them all together.", "And on that Day We shall present Hell to the disbelievers, plain to view,", "(To) Those whose eyes had been under a covering from My Reminder (this Qur’ân), and who could not bear to hear (it).", "Do then those who disbelieve think that  they can take My slaves [i.e., the angels, Allâh’s Messengers, ’Iesa  (Jesus), son of Maryam (Mary), etc.] as Auliyâ’ (lords, gods,  protectors, etc.) besides Me? Verily, We have prepared Hell as an  entertainment for the disbelievers (in the Oneness of Allâh Islâmic  Monotheism).", "Say (O Muhammad SAW): ”Shall We tell you the greatest losers in respect of (their) deeds?", "”Those whose efforts have been wasted in this life while they thought that they were acquiring good by their deeds!", "”They are those who deny the Ayât  (proofs, evidences, verses, lessons, signs, revelations, etc.) of their  Lord and the Meeting with Him (in the Hereafter). So their works are in  vain, and on the Day of Resurrection, We shall not give them any weight.", "”That shall be their recompense, Hell;  because they disbelieved and took My Ayât (proofs, evidences, verses,  lessons, signs, revelations, etc.) and My Messengers by way of jest and  mockery.", "”Verily! Those who believe (in the  Oneness of Allâh Islâmic Monotheism) and do righteous deeds, shall have  the Gardens of Al-Firdaus (the Paradise) for their entertainment.", "”Wherein they shall dwell (forever). No desire will they have to be removed therefrom.”", "Say (O Muhammad SAW to mankind). ”If the  sea were ink for (writing) the Words of my Lord, surely, the sea would  be exhausted before the Words of my Lord would be finished, even if we  brought (another sea) like it for its aid.”", "Say (O Muhammad SAW): ”I am only a man  like you. It has been inspired to me that your Ilâh (God) is One Ilâh  (God i.e. Allâh). So whoever hopes for the Meeting with his Lord, let  him work righteousness and associate none as a partner in the worship  of his Lord.”"]}