{"name_ar": "سورة مريم", "ayahs_ar": ["كهيعص", "ذِكْرُ رَحْمَةِ رَبِّكَ عَبْدَهُ زَكَرِيَّا", "إِذْ نَادَى رَبَّهُ نِدَاء خَفِيًّا", "قَالَ رَبِّ إِنِّي وَهَنَ الْعَظْمُ مِنِّي وَاشْتَعَلَ الرَّأْسُ شَيْبًا وَلَمْ أَكُن بِدُعَائِكَ رَبِّ شَقِيًّا", "وَإِنِّي خِفْتُ الْمَوَالِيَ مِن وَرَائِي وَكَانَتِ امْرَأَتِي عَاقِرًا فَهَبْ لِي مِن لَّدُنكَ وَلِيًّا", "يَرِثُنِي وَيَرِثُ مِنْ آلِ يَعْقُوبَ وَاجْعَلْهُ رَبِّ رَضِيًّا", "يَا زَكَرِيَّا إِنَّا نُبَشِّرُكَ بِغُلَامٍ اسْمُهُ يَحْيَى لَمْ نَجْعَل لَّهُ مِن قَبْلُ سَمِيًّا", "قَالَ رَبِّ أَنَّى يَكُونُ لِي غُلَامٌ وَكَانَتِ امْرَأَتِي عَاقِرًا وَقَدْ بَلَغْتُ مِنَ الْكِبَرِ عِتِيًّا", "قَالَ كَذَلِكَ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٌ وَقَدْ خَلَقْتُكَ مِن قَبْلُ وَلَمْ تَكُ شَيْئًا", "قَالَ رَبِّ اجْعَل لِّي آيَةً قَالَ آيَتُكَ أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَ لَيَالٍ سَوِيًّا", "فَخَرَجَ عَلَى قَوْمِهِ مِنَ الْمِحْرَابِ فَأَوْحَى إِلَيْهِمْ أَن سَبِّحُوا بُكْرَةً وَعَشِيًّا", "يَا يَحْيَى خُذِ الْكِتَابَ بِقُوَّةٍ وَآتَيْنَاهُ الْحُكْمَ صَبِيًّا", "وَحَنَانًا مِّن لَّدُنَّا وَزَكَاةً وَكَانَ تَقِيًّا", "وَبَرًّا بِوَالِدَيْهِ وَلَمْ يَكُن جَبَّارًا عَصِيًّا", "وَسَلَامٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيًّا", "وَاذْكُرْ فِي الْكِتَابِ مَرْيَمَ إِذِ انتَبَذَتْ مِنْ أَهْلِهَا مَكَانًا شَرْقِيًّا", "فَاتَّخَذَتْ مِن دُونِهِمْ حِجَابًا فَأَرْسَلْنَا إِلَيْهَا رُوحَنَا فَتَمَثَّلَ لَهَا بَشَرًا سَوِيًّا", "قَالَتْ إِنِّي أَعُوذُ بِالرَّحْمَن مِنكَ إِن كُنتَ تَقِيًّا", "قَالَ إِنَّمَا أَنَا رَسُولُ رَبِّكِ لِأَهَبَ لَكِ غُلَامًا زَكِيًّا", "قَالَتْ أَنَّى يَكُونُ لِي غُلَامٌ وَلَمْ يَمْسَسْنِي بَشَرٌ وَلَمْ أَكُ بَغِيًّا", "قَالَ كَذَلِكِ قَالَ رَبُّكِ هُوَ عَلَيَّ هَيِّنٌ وَلِنَجْعَلَهُ آيَةً لِلنَّاسِ وَرَحْمَةً مِّنَّا وَكَانَ أَمْرًا مَّقْضِيًّا", "فَحَمَلَتْهُ فَانتَبَذَتْ بِهِ مَكَانًا قَصِيًّا", "فَأَجَاءهَا الْمَخَاضُ إِلَى جِذْعِ النَّخْلَةِ قَالَتْ يَا لَيْتَنِي مِتُّ قَبْلَ هَذَا وَكُنتُ نَسْيًا مَّنسِيًّا", "فَنَادَاهَا مِن تَحْتِهَا أَلَّا تَحْزَنِي قَدْ جَعَلَ رَبُّكِ تَحْتَكِ سَرِيًّا", "وَهُزِّي إِلَيْكِ بِجِذْعِ النَّخْلَةِ تُسَاقِطْ عَلَيْكِ رُطَبًا جَنِيًّا", "فَكُلِي وَاشْرَبِي وَقَرِّي عَيْنًا فَإِمَّا تَرَيِنَّ مِنَ الْبَشَرِ أَحَدًا فَقُولِي إِنِّي نَذَرْتُ لِلرَّحْمَنِ صَوْمًا فَلَنْ أُكَلِّمَ الْيَوْمَ إِنسِيًّا", "فَأَتَتْ بِهِ قَوْمَهَا تَحْمِلُهُ قَالُوا يَا مَرْيَمُ لَقَدْ جِئْتِ شَيْئًا فَرِيًّا", "يَا أُخْتَ هَارُونَ مَا كَانَ أَبُوكِ امْرَأَ سَوْءٍ وَمَا كَانَتْ أُمُّكِ بَغِيًّا", "فَأَشَارَتْ إِلَيْهِ قَالُوا كَيْفَ نُكَلِّمُ مَن كَانَ فِي الْمَهْدِ صَبِيًّا", "قَالَ إِنِّي عَبْدُ اللَّهِ آتَانِيَ الْكِتَابَ وَجَعَلَنِي نَبِيًّا", "وَجَعَلَنِي مُبَارَكًا أَيْنَ مَا كُنتُ وَأَوْصَانِي بِالصَّلَاةِ وَالزَّكَاةِ مَا دُمْتُ حَيًّا", "وَبَرًّا بِوَالِدَتِي وَلَمْ يَجْعَلْنِي جَبَّارًا شَقِيًّا", "وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدتُّ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيًّا", "ذَلِكَ عِيسَى ابْنُ مَرْيَمَ قَوْلَ الْحَقِّ الَّذِي فِيهِ يَمْتَرُونَ", "مَا كَانَ لِلَّهِ أَن يَتَّخِذَ مِن وَلَدٍ سُبْحَانَهُ إِذَا قَضَى أَمْرًا فَإِنَّمَا يَقُولُ لَهُ كُن فَيَكُونُ", "وَإِنَّ اللَّهَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ هَذَا صِرَاطٌ مُّسْتَقِيمٌ", "فَاخْتَلَفَ الْأَحْزَابُ مِن بَيْنِهِمْ فَوَيْلٌ لِّلَّذِينَ كَفَرُوا مِن مَّشْهَدِ يَوْمٍ عَظِيمٍ", "أَسْمِعْ بِهِمْ وَأَبْصِرْ يَوْمَ يَأْتُونَنَا لَكِنِ الظَّالِمُونَ الْيَوْمَ فِي ضَلَالٍ مُّبِينٍ", "وَأَنذِرْهُمْ يَوْمَ الْحَسْرَةِ إِذْ قُضِيَ الْأَمْرُ وَهُمْ فِي غَفْلَةٍ وَهُمْ لَا يُؤْمِنُونَ", "إِنَّا نَحْنُ نَرِثُ الْأَرْضَ وَمَنْ عَلَيْهَا وَإِلَيْنَا يُرْجَعُونَ", "وَاذْكُرْ فِي الْكِتَابِ إِبْرَاهِيمَ إِنَّهُ كَانَ صِدِّيقًا نَّبِيًّا", "إِذْ قَالَ لِأَبِيهِ يَا أَبَتِ لِمَ تَعْبُدُ مَا لَا يَسْمَعُ وَلَا يُبْصِرُ وَلَا يُغْنِي عَنكَ شَيْئًا", "يَا أَبَتِ إِنِّي قَدْ جَاءنِي مِنَ الْعِلْمِ مَا لَمْ يَأْتِكَ فَاتَّبِعْنِي أَهْدِكَ صِرَاطًا سَوِيًّا", "يَا أَبَتِ لَا تَعْبُدِ الشَّيْطَانَ إِنَّ الشَّيْطَانَ كَانَ لِلرَّحْمَنِ عَصِيًّا", "يَا أَبَتِ إِنِّي أَخَافُ أَن يَمَسَّكَ عَذَابٌ مِّنَ الرَّحْمَن فَتَكُونَ لِلشَّيْطَانِ وَلِيًّا", "قَالَ أَرَاغِبٌ أَنتَ عَنْ آلِهَتِي يَا إِبْراهِيمُ لَئِن لَّمْ تَنتَهِ لَأَرْجُمَنَّكَ وَاهْجُرْنِي مَلِيًّا", "قَالَ سَلَامٌ عَلَيْكَ سَأَسْتَغْفِرُ لَكَ رَبِّي إِنَّهُ كَانَ بِي حَفِيًّا", "وَأَعْتَزِلُكُمْ وَمَا تَدْعُونَ مِن دُونِ اللَّهِ وَأَدْعُو رَبِّي عَسَى أَلَّا أَكُونَ بِدُعَاء رَبِّي شَقِيًّا", "فَلَمَّا اعْتَزَلَهُمْ وَمَا يَعْبُدُونَ مِن دُونِ اللَّهِ وَهَبْنَا لَهُ إِسْحَقَ وَيَعْقُوبَ وَكُلًّا جَعَلْنَا نَبِيًّا", "وَوَهَبْنَا لَهُم مِّن رَّحْمَتِنَا وَجَعَلْنَا لَهُمْ لِسَانَ صِدْقٍ عَلِيًّا", "وَاذْكُرْ فِي الْكِتَابِ مُوسَى إِنَّهُ كَانَ مُخْلَصًا وَكَانَ رَسُولًا نَّبِيًّا", "وَنَادَيْنَاهُ مِن جَانِبِ الطُّورِ الْأَيْمَنِ وَقَرَّبْنَاهُ نَجِيًّا", "وَوَهَبْنَا لَهُ مِن رَّحْمَتِنَا أَخَاهُ هَارُونَ نَبِيًّا", "وَاذْكُرْ فِي الْكِتَابِ إِسْمَاعِيلَ إِنَّهُ كَانَ صَادِقَ الْوَعْدِ وَكَانَ رَسُولًا نَّبِيًّا", "وَكَانَ يَأْمُرُ أَهْلَهُ بِالصَّلَاةِ وَالزَّكَاةِ وَكَانَ عِندَ رَبِّهِ مَرْضِيًّا", "وَاذْكُرْ فِي الْكِتَابِ إِدْرِيسَ إِنَّهُ كَانَ صِدِّيقًا نَّبِيًّا", "وَرَفَعْنَاهُ مَكَانًا عَلِيًّا", "أُوْلَئِكَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِم مِّنَ النَّبِيِّينَ مِن ذُرِّيَّةِ آدَمَ وَمِمَّنْ حَمَلْنَا مَعَ نُوحٍ وَمِن ذُرِّيَّةِ إِبْرَاهِيمَ وَإِسْرَائِيلَ وَمِمَّنْ هَدَيْنَا وَاجْتَبَيْنَا إِذَا تُتْلَى عَلَيْهِمْ آيَاتُ الرَّحْمَن خَرُّوا سُجَّدًا وَبُكِيًّا", "فَخَلَفَ مِن بَعْدِهِمْ خَلْفٌ أَضَاعُوا الصَّلَاةَ وَاتَّبَعُوا الشَّهَوَاتِ فَسَوْفَ يَلْقَوْنَ غَيًّا", "إِلَّا مَن تَابَ وَآمَنَ وَعَمِلَ صَالِحًا فَأُوْلَئِكَ يَدْخُلُونَ الْجَنَّةَ وَلَا يُظْلَمُونَ شَيْئًا", "جَنَّاتِ عَدْنٍ الَّتِي وَعَدَ الرَّحْمَنُ عِبَادَهُ بِالْغَيْبِ إِنَّهُ كَانَ وَعْدُهُ مَأْتِيًّا", "لَا يَسْمَعُونَ فِيهَا لَغْوًا إِلَّا سَلَامًا وَلَهُمْ رِزْقُهُمْ فِيهَا بُكْرَةً وَعَشِيًّا", "تِلْكَ الْجَنَّةُ الَّتِي نُورِثُ مِنْ عِبَادِنَا مَن كَانَ تَقِيًّا", "وَمَا نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ لَهُ مَا بَيْنَ أَيْدِينَا وَمَا خَلْفَنَا وَمَا بَيْنَ ذَلِكَ وَمَا كَانَ رَبُّكَ نَسِيًّا", "رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا فَاعْبُدْهُ وَاصْطَبِرْ لِعِبَادَتِهِ هَلْ تَعْلَمُ لَهُ سَمِيًّا", "وَيَقُولُ الْإِنسَانُ أَئِذَا مَا مِتُّ لَسَوْفَ أُخْرَجُ حَيًّا", "أَوَلَا يَذْكُرُ الْإِنسَانُ أَنَّا خَلَقْنَاهُ مِن قَبْلُ وَلَمْ يَكُ شَيْئًا", "فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَالشَّيَاطِينَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّا", "ثُمَّ لَنَنزِعَنَّ مِن كُلِّ شِيعَةٍ أَيُّهُمْ أَشَدُّ عَلَى الرَّحْمَنِ عِتِيًّا", "ثُمَّ لَنَحْنُ أَعْلَمُ بِالَّذِينَ هُمْ أَوْلَى بِهَا صِلِيًّا", "وَإِن مِّنكُمْ إِلَّا وَارِدُهَا كَانَ عَلَى رَبِّكَ حَتْمًا مَّقْضِيًّا", "ثُمَّ نُنَجِّي الَّذِينَ اتَّقَوا وَّنَذَرُ الظَّالِمِينَ فِيهَا جِثِيًّا", "وَإِذَا تُتْلَى عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ قَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا أَيُّ الْفَرِيقَيْنِ خَيْرٌ مَّقَامًا وَأَحْسَنُ نَدِيًّا", "وَكَمْ أَهْلَكْنَا قَبْلَهُم مِّن قَرْنٍ هُمْ أَحْسَنُ أَثَاثًا وَرِئْيًا", "قُلْ مَن كَانَ فِي الضَّلَالَةِ فَلْيَمْدُدْ لَهُ الرَّحْمَنُ مَدًّا حَتَّى إِذَا رَأَوْا مَا يُوعَدُونَ إِمَّا الْعَذَابَ وَإِمَّا السَّاعَةَ فَسَيَعْلَمُونَ مَنْ هُوَ شَرٌّ مَّكَانًا وَأَضْعَفُ جُندًا", "وَيَزِيدُ اللَّهُ الَّذِينَ اهْتَدَوْا هُدًى وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِندَ رَبِّكَ ثَوَابًا وَخَيْرٌ مَّرَدًّا", "أَفَرَأَيْتَ الَّذِي كَفَرَ بِآيَاتِنَا وَقَالَ لَأُوتَيَنَّ مَالًا وَوَلَدًا", "أَاطَّلَعَ الْغَيْبَ أَمِ اتَّخَذَ عِندَ الرَّحْمَنِ عَهْدًا", "كَلَّا سَنَكْتُبُ مَا يَقُولُ وَنَمُدُّ لَهُ مِنَ الْعَذَابِ مَدًّا", "وَنَرِثُهُ مَا يَقُولُ وَيَأْتِينَا فَرْدًا", "وَاتَّخَذُوا مِن دُونِ اللَّهِ آلِهَةً لِّيَكُونُوا لَهُمْ عِزًّا", "كَلَّا سَيَكْفُرُونَ بِعِبَادَتِهِمْ وَيَكُونُونَ عَلَيْهِمْ ضِدًّا", "أَلَمْ تَرَ أَنَّا أَرْسَلْنَا الشَّيَاطِينَ عَلَى الْكَافِرِينَ تَؤُزُّهُمْ أَزًّا", "فَلَا تَعْجَلْ عَلَيْهِمْ إِنَّمَا نَعُدُّ لَهُمْ عَدًّا", "يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمَنِ وَفْدًا", "وَنَسُوقُ الْمُجْرِمِينَ إِلَى جَهَنَّمَ وِرْدًا", "لَا يَمْلِكُونَ الشَّفَاعَةَ إِلَّا مَنِ اتَّخَذَ عِندَ الرَّحْمَنِ عَهْدًا", "وَقَالُوا اتَّخَذَ الرَّحْمَنُ وَلَدًا", "لَقَدْ جِئْتُمْ شَيْئًا إِدًّا", "تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِنْهُ وَتَنشَقُّ الْأَرْضُ وَتَخِرُّ الْجِبَالُ هَدًّا", "أَن دَعَوْا لِلرَّحْمَنِ وَلَدًا", "وَمَا يَنبَغِي لِلرَّحْمَنِ أَن يَتَّخِذَ وَلَدًا", "إِن كُلُّ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ إِلَّا آتِي الرَّحْمَنِ عَبْدًا", "لَقَدْ أَحْصَاهُمْ وَعَدَّهُمْ عَدًّا", "وَكُلُّهُمْ آتِيهِ يَوْمَ الْقِيَامَةِ فَرْدًا", "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَيَجْعَلُ لَهُمُ الرَّحْمَنُ وُدًّا", "فَإِنَّمَا يَسَّرْنَاهُ بِلِسَانِكَ لِتُبَشِّرَ بِهِ الْمُتَّقِينَ وَتُنذِرَ بِهِ قَوْمًا لُّدًّا", "وَكَمْ أَهْلَكْنَا قَبْلَهُم مِّن قَرْنٍ هَلْ تُحِسُّ مِنْهُم مِّنْ أَحَدٍ أَوْ تَسْمَعُ لَهُمْ رِكْزًا"], "name_en": "Maryam", "ayahs_en": ["Kâf­ Hâ­Yâ­’Aîn­Sâd. [These letters are one of the miracles of the Qur’ân, and none but Allâh (Alone) knows their meanings].", "(This is) a mention of the mercy of your Lord to His slave Zakariya (Zachariah).", "When he called out his Lord (Allâh) a call in secret,", "Saying: ”My Lord! Indeed my bones have  grown feeble, and grey hair has spread on my head, And I have never  been unblest in my invocation to You, O my Lord!", "”And Verily! I fear my relatives after me, since my wife is barren. So give me from Yourself an heir,", "”Who shall inherit me, and inherit  (also) the posterity of Ya’qûb (Jacob) (inheritance of the religious  knowledge and Prophethood, not the wealth, etc.). And make him, my  Lord, one with whom You are Well-pleased!”.", "(Allâh said) ”O Zakariya (Zachariah)!  Verily, We give you the glad tidings of a son, His name will be Yahya  (John). We have given that name to none before (him).”", "He said: ”My Lord! How can I have a son, when my wife is barren, and I have reached the extreme old age.”", "He said: ”So (it will be). Your Lord says; It is easy for Me. Certainly I have created you before, when you had been nothing!”", "[Zakariya (Zachariah)] said: ”My Lord!  Appoint for me a sign.” He said: ”Your sign is that you shall not speak  unto mankind for three nights, though having no bodily defect.”", "Then he came out to his people from  Al-Mihrâb (a praying place or a private room, etc.), he told them by  signs to glorify Allâh’s Praises in the morning and in the afternoon.", "(It was said to his son): ”O Yahya  (John)! Hold fast the Scripture [the Taurât (Torah)].” And We gave him  wisdom while yet a child.", "And (made him) sympathetic to men as a mercy (or a grant) from Us, and pure from sins [i.e. Yahya (John)] and he was righteous,", "And dutiful towards his parents, and he was neither an arrogant nor disobedient (to Allâh or to his parents).", "And Salâmun (peace) be on him the day he was born, the day he dies, and the day he will be raised up to life (again)!", "And mention in the Book (the Qur’ân, O  Muhammad SAW , the story of) Maryam (Mary), when she withdrew in  seclusion from her family to a place facing east.", "She placed a screen (to screen herself)  from them; then We sent to her Our Ruh [angel Jibrael (Gabriel)], and  he appeared before her in the form of a man in all respects.", "She said: ”Verily! I seek refuge with the Most Beneficent (Allâh) from you, if you do fear Allâh.”", "(The angel) said: ”I am only a Messenger from your Lord, (to announce) to you the gift of a righteous son.”", "She said: ”How can I have a son, when no man has touched me, nor am I unchaste?”", "He said: ”So (it will be), your Lord  said: ’That is easy for Me (Allâh): And (We wish) to appoint him as a  sign to mankind and a mercy from Us (Allâh), and it is a matter  (already) decreed, (by Allâh).’ ”", "So she conceived him, and she withdrew with him to a far place (i.e. Bethlehem valley about 4-6 miles from Jerusalem).", "And the pains of childbirth drove her to  the trunk of a date-palm. She said: ”Would that I had died before this,  and had been forgotten and out of sight!”", "Then [the babe ’Iesa (Jesus) or Jibrael  (Gabriel)] cried unto her from below her, saying: ”Grieve not! Your  Lord has provided a water stream under you;", "”And shake the trunk of date-palm towards you, it will let fall fresh ripe-dates upon you.”", "”So eat and drink and be glad, and if  you see any human being, say: ’Verily! I have vowed a fast unto the  Most Beneficent (Allâh) so I shall not speak to any human being this  day.’”", "Then she brought him (the baby) to her  people, carrying him. They said: ”O Mary! Indeed you have brought a  thing Fariya (an unheard mighty thing).", "”O sister (i.e. the like) of Hârûn  (Aaron) [not the brother of Mûsa (Moses), but he was another pious man  at the time of Maryam (Mary)]! Your father was not a man who used to  commit adultery, nor your mother was an unchaste woman.”", "Then she pointed to him. They said: ”How can we talk to one who is a child in the cradle?”", "”He [’Iesa (Jesus)] said: Verily! I am a slave of Allâh, He has given me the Scripture and made me a Prophet;”", "”And He has made me blessed wheresoever I be, and has enjoined on me Salât (prayer), and Zakât, as long as I live.”", "”And dutiful to my mother, and made me not arrogant, unblest.", "”And Salâm (peace) be upon me the day I was born, and the day I die, and the day I shall be raised alive!”", "Such is ’Iesa (Jesus), son of Maryam (Mary). (it is) a statement of truth, about which they doubt (or dispute).", "It befits not (the Majesty of) Allâh  that He should beget a son [this refers to the slander of Christians  against Allâh, by saying that ’Iesa (Jesus) is the son of Allâh].  Glorified (and Exalted be He above all that they associate with Him).  When He decrees a thing, He only says to it, ”Be!” and it is.", "[’Iesa (Jesus) said]: ”And verily Allâh  is my Lord and your Lord. So worship Him (Alone). That is the Straight  Path. (Allâh’s Religion of Islâmic Monotheism which He did ordain for  all of His Prophets).” [Tafsir At-Tabarî]", "Then the sects differed [i.e. the  Christians about ’Iesa (Jesus) ], so woe unto the disbelievers [those  who gave false witness by saying that ’Iesa (Jesus) is the son of  Allâh] from the meeting of a great Day (i.e. the Day of Resurrection,  when they will be thrown in the blazing Fire).", "How clearly will they (polytheists and  disbelievers in the Oneness of Allâh) see and hear, the Day when they  will appear before Us! But the Zalimûn (polytheists and wrong-doers)  today are in plain error.", "And warn them (O Muhammad SAW) of the  Day of grief and regrets, when the case has been decided, while (now)  they are in a state of carelessness, and they believe not.", "Verily! We will inherit the earth and whatsoever is thereon. And to Us they all shall be returned,", "And mention in the Book (the Qur’ân) Ibrâhim (Abraham). Verily! He was a man of truth, a Prophet.", "When he said to his father: ”O my father! Why do you worship that which hears not, sees not and cannot avail you in anything?", "”O my father! Verily! There has come to  me of knowledge that which came not unto you. So follow me. I will  guide you to a Straight Path.", "”O my father! Worship not Shaitân (Satan). Verily! Shaitân (Satan) has been a rebel against the Most Beneficent (Allâh).", "”O my father! Verily! I fear lest a  torment from the Most Beneficent (Allâh) overtake you, so that you  become a companion of Shaitân (Satan) (in the Hell-fire).” [Tafsir  Al-Qurtubî]", "He (the father) said: ”Do you reject my  gods, O Ibrâhim (Abraham)? If you stop not (this), I will indeed stone  you. So get away from me safely before I punish you.”", "Ibrâhim (Abraham) said: ”Peace be on you! I will ask Forgiveness of my Lord for you. Verily! He is unto me, Ever Most Gracious.", "”And I shall turn away from you and from  those whom you invoke besides Allâh. And I shall call on my Lord; and I  hope that I shall not be unblest in my invocation to my Lord.”", "So when he had turned away from them and  from those whom they worshipped besides Allâh, We gave him Ishâque  (Isaac) and Ya’qûb (Jacob), and each one of them We made a Prophet.", "And We gave them of Our Mercy (a good  provision in plenty), and We granted them honour on the tongues (of all  the nations, i.e everybody remembers them with a good praise).", "And mention in the Book (this Qur’ân) Mûsa (Moses). Verily! He was chosen and he was a Messenger (and) a Prophet.", "And We called him from the right side of the Mount, and made him draw near to Us for a talk with him [Mûsa (Moses)].", "And We bestowed on him his brother Hârûn (Aaron), (also) a Prophet, out of Our Mercy.", "And mention in the Book (the Qur’ân)  Ismâ’il (Ishmael). Verily! He was true to what he promised, and he was  a Messenger, (and) a Prophet.", "And he used to enjoin on his family and his people As-Salât (the prayers) and the Zakât, and his Lord was pleased with him.", "And mention in the Book (the Qur’ân) Idris (Enoch).Verily! He was a man of truth, (and) a Prophet.", "And We raised him to a high station.", "Those were they unto whom Allâh bestowed  His Grace from among the Prophets, of the offspring of Adam, and of  those whom We carried (in the ship) with Nûh (Noah), and of the  offspring of Ibrâhim (Abraham) and Israel and from among those whom We  guided and chose. When the Verses of the Most Beneficent (Allâh) were  recited unto them, they fell down prostrating and weeping.[ Sajdah ]", "Then, there has succeeded them a  posterity who have given up As-Salât (the prayers) [i.e. made their  Salât (prayers) to be lost, either by not offering them or by not  offering them perfectly or by not offering them in their proper fixed  times, etc.] and have followed lusts. So they will be thrown in Hell.", "Except those who repent and believe (in  the Oneness of Allâh and His Messenger Muhammad SAW), and work  righteousness. Such will enter Paradise and they will not be wronged in  aught.", "(They will enter) ’Adn (Eden) Paradise  (everlasting Gardens), which the Most Beneficent (Allâh) has promised  to His slaves in the unseen: Verily! His Promise must come to pass.", "They shall not hear therein (in  Paradise) any Laghw (dirty, false, evil vain talk), but only Salâm  (salutations of peace). And they will have therein their sustenance,  morning and afternoon. [See (V.40:55)].", "Such is the Paradise which We shall give  as an inheritance to those of Our slaves who have been Al-Muttaqûn  (pious and righteous persons - See V.2:2).", "And we (angels) descend not except by  the Command of your Lord (O Muhammad SAW). To Him belongs what is  before us and what is behind us, and what is between those two, and  your Lord is never forgetful,", "Lord of the heavens and the earth, and  all that is between them, so worship Him (Alone) and be constant and  patient in His worship. Do you know of any who is similar to Him? (of  course none is similar or coequal or comparable to Him, and He has none  as partner with Him). [There is nothing like unto Him and He is the  All-Hearer, the All-Seer].", "And man (the disbeliever) says: ”When I am dead, shall I then be raised up alive?”", "Does not man remember that We created him before, while he was nothing?", "So by your Lord, surely, We shall gather  them together, and (also) the Shayâtin (devils) (with them), then We  shall bring them round Hell on their knees.", "Then indeed We shall drag out from every  sect all those who were worst in obstinate rebellion against the Most  Beneficent (Allâh).", "Then, verily, We know best those who are most worthy of being burnt therein.", "There is not one of you but will pass over it (Hell); this is with your Lord; a Decree which must be accomplished.", "Then We shall save those who use to fear  Allâh and were dutiful to Him. And We shall leave the Zâlimûn  (polytheists and wrongdoers, etc.) therein (humbled) to their knees (in  Hell).", "And when Our Clear Verses are recited to  them, those who disbelieve (the rich and strong among the pagans of  Quraish who live a life of luxury) say to those who believe (the weak,  poor companions of Prophet Muhammad SAW who have a hard life): ”Which  of the two groups (i.e. believers and disbelievers) is best in (point  of) position and as regards station (place of council for  consultation).”", "And how many a generation (past nations) have We destroyed before them, who were better in wealth, goods and outward appearance?", "Say (O Muhammad SAW) whoever is in  error, the Most Beneficent (Allâh) will extend (the rope) to him,  until, when they see that which they were promised, either the torment  or the Hour, they will come to know who is worst in position, and who  is weaker in forces. [This is the answer for the Verse No.19:73]", "And Allâh increases in guidance those  who walk aright [true believers in the Oneness of Allâh who fear Allâh  much (abstain from all kinds of sins and evil deeds which He has  forbidden), and love Allâh much (perform all kinds of good deeds which  He has ordained)]. And the righteous good deeds that last, are better  with your Lord, for reward and better for resort.", "Have you seen him who disbelieved in Our  Ayât (this Qur’ân and Muhammad SAW) and (yet) says: ”I shall certainly  be given wealth and children [if I will be alive (again)],”", "Has he known the unseen or has he taken a covenant from the Most Beneficent (Allâh)?", "Nay! We shall record what he says, and We shall increase his torment (in the Hell);", "And We shall inherit from him (at his  death) all that he talks of (i.e. wealth and children which We have  bestowed upon him in this world), and he shall come to Us alone.", "And they have taken (for worship) âliha  (gods) besides Allâh, that they might give them honour, power and glory  (and also protect them from Allâh’s Punishment etc.).", "Nay, but they (the so-called gods) will deny their worship of them, and become opponents to them (on the Day of Resurrection).", "See you not that We have sent the Shayâtin (devils) against the disbelievers to push them to do evil.", "So make no haste against them; We only  count out to them a (limited) number (of the days of the life of this  world and delay their term so that they may increase in evil and sins).", "The Day We shall gather the Muttaqûn  (pious - see V.2:2) unto the Most Beneficent (Allâh), like a delegate  (presented before a king for honour).", "And We shall drive the Mujrimûn  (polytheists, sinners, criminals, disbelievers in the Oneness of Allâh,  etc.) to Hell, in a thirsty state (like a thirsty herd driven down to  water),", "None shall have the power of  intercession, but such a one as has received permission (or promise)  from the Most Beneficent (Allâh).", "And they say: ”The Most Beneficent  (Allâh) has begotten a son (or offspring or children) [as the Jews say:  ’Uzair (Ezra) is the son of Allâh, and the Christians say that He has  begotten a son [’Iesa (Christ) ], and the pagan Arabs say that He has  begotten daughters (angels, etc.)].”", "Indeed you have brought forth (said) a terrible evil thing.", "Whereby the heavens are almost torn, and the earth is split asunder, and the mountains fall in ruins,", "That they ascribe a son (or offspring or children) to the Most Beneficent (Allâh).", "But it is not suitable for (the Majesty of) the Most Beneficent (Allâh) that He should beget a son (or offspring or children).", "There is none in the heavens and the earth but comes unto the Most Beneficent (Allâh) as a slave.", "Verily, He knows each one of them, and has counted them a full counting.", "And everyone of them will come to Him alone on the Day of Resurrection (without any helper, or protector or defender).", "Verily, those who believe [in the  Oneness of Allâh and in His Messenger (Muhammad SAW)] and work deeds of  righteousness, the Most Beneficent (Allâh) will bestow love for them  (in the hearts of the believers).", "So We have made this (the Qur’ân) easy  in your own tongue (O Muhammad SAW), only that you may give glad  tidings to the Muttaqûn (pious and righteous persons - See V.2:2), and  warn with it the Ludda (most quarrelsome) people.", "And how many a generation before them  have We destroyed! Can you (O Muhammad SAW) find a single one of them  or hear even a whisper of them?"]}