{"name_ar": "سورة سورة طه", "ayahs_ar": ["طه", "مَا أَنزَلْنَا عَلَيْكَ الْقُرْآنَ لِتَشْقَى", "إِلَّا تَذْكِرَةً لِّمَن يَخْشَى", "تَنزِيلًا مِّمَّنْ خَلَقَ الْأَرْضَ وَالسَّمَاوَاتِ الْعُلَى", "الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى", "لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَمَا بَيْنَهُمَا وَمَا تَحْتَ الثَّرَى", "وَإِن تَجْهَرْ بِالْقَوْلِ فَإِنَّهُ يَعْلَمُ السِّرَّ وَأَخْفَى", "اللَّهُ لَا إِلَهَ إِلَّا هُوَ لَهُ الْأَسْمَاء الْحُسْنَى", "وَهَلْ أَتَاكَ حَدِيثُ مُوسَى", "إِذْ رَأَى نَارًا فَقَالَ لِأَهْلِهِ امْكُثُوا إِنِّي آنَسْتُ نَارًا لَّعَلِّي آتِيكُم مِّنْهَا بِقَبَسٍ أَوْ أَجِدُ عَلَى النَّارِ هُدًى", "فَلَمَّا أَتَاهَا نُودِي يَا مُوسَى", "إِنِّي أَنَا رَبُّكَ فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوَادِ الْمُقَدَّسِ طُوًى", "وَأَنَا اخْتَرْتُكَ فَاسْتَمِعْ لِمَا يُوحَى", "إِنَّنِي أَنَا اللَّهُ لَا إِلَهَ إِلَّا أَنَا فَاعْبُدْنِي وَأَقِمِ الصَّلَاةَ لِذِكْرِي", "إِنَّ السَّاعَةَ ءاَتِيَةٌ أَكَادُ أُخْفِيهَا لِتُجْزَى كُلُّ نَفْسٍ بِمَا تَسْعَى", "فَلاَ يَصُدَّنَّكَ عَنْهَا مَنْ لاَ يُؤْمِنُ بِهَا وَاتَّبَعَ هَوَاهُ فَتَرْدَى", "وَمَا تِلْكَ بِيَمِينِكَ يَا مُوسَى", "قَالَ هِيَ عَصَايَ أَتَوَكَّأُ عَلَيْهَا وَأَهُشُّ بِهَا عَلَى غَنَمِي وَلِيَ فِيهَا مَآرِبُ أُخْرَى", "قَالَ أَلْقِهَا يَا مُوسَى", "فَأَلْقَاهَا فَإِذَا هِيَ حَيَّةٌ تَسْعَى", "قَالَ خُذْهَا وَلَا تَخَفْ سَنُعِيدُهَا سِيرَتَهَا الْأُولَى", "وَاضْمُمْ يَدَكَ إِلَى جَنَاحِكَ تَخْرُجْ بَيْضَاء مِنْ غَيْرِ سُوءٍ آيَةً أُخْرَى", "لِنُرِيَكَ مِنْ آيَاتِنَا الْكُبْرَى", "اذْهَبْ إِلَى فِرْعَوْنَ إِنَّهُ طَغَى", "قَالَ رَبِّ اشْرَحْ لِي صَدْرِي", "وَيَسِّرْ لِي أَمْرِي", "وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي", "يَفْقَهُوا قَوْلِي", "وَاجْعَل لِّي وَزِيرًا مِّنْ أَهْلِي", "هَارُونَ أَخِي", "اشْدُدْ بِهِ أَزْرِي", "وَأَشْرِكْهُ فِي أَمْرِي", "كَيْ نُسَبِّحَكَ كَثِيرًا", "وَنَذْكُرَكَ كَثِيرًا", "إِنَّكَ كُنتَ بِنَا بَصِيرًا", "قَالَ قَدْ أُوتِيتَ سُؤْلَكَ يَا مُوسَى", "وَلَقَدْ مَنَنَّا عَلَيْكَ مَرَّةً أُخْرَى", "إِذْ أَوْحَيْنَا إِلَى أُمِّكَ مَا يُوحَى", "أَنِ اقْذِفِيهِ فِي التَّابُوتِ فَاقْذِفِيهِ فِي الْيَمِّ فَلْيُلْقِهِ الْيَمُّ بِالسَّاحِلِ يَأْخُذْهُ عَدُوٌّ لِّي وَعَدُوٌّ لَّهُ وَأَلْقَيْتُ عَلَيْكَ مَحَبَّةً مِّنِّي وَلِتُصْنَعَ عَلَى عَيْنِي", "إِذْ تَمْشِي أُخْتُكَ فَتَقُولُ هَلْ أَدُلُّكُمْ عَلَى مَن يَكْفُلُهُ فَرَجَعْنَاكَ إِلَى أُمِّكَ كَيْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ وَقَتَلْتَ نَفْسًا فَنَجَّيْنَاكَ مِنَ الْغَمِّ وَفَتَنَّاكَ فُتُونًا فَلَبِثْتَ سِنِينَ فِي أَهْلِ مَدْيَنَ ثُمَّ جِئْتَ عَلَى قَدَرٍ يَا مُوسَى", "وَاصْطَنَعْتُكَ لِنَفْسِي", "اذْهَبْ أَنتَ وَأَخُوكَ بِآيَاتِي وَلَا تَنِيَا فِي ذِكْرِي", "اذْهَبَا إِلَى فِرْعَوْنَ إِنَّهُ طَغَى", "فَقُولَا لَهُ قَوْلًا لَّيِّنًا لَّعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشَى", "قَالَا رَبَّنَا إِنَّنَا نَخَافُ أَن يَفْرُطَ عَلَيْنَا أَوْ أَن يَطْغَى", "قَالَ لَا تَخَافَا إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَى", "فَأْتِيَاهُ فَقُولَا إِنَّا رَسُولَا رَبِّكَ فَأَرْسِلْ مَعَنَا بَنِي إِسْرَائِيلَ وَلَا تُعَذِّبْهُمْ قَدْ جِئْنَاكَ بِآيَةٍ مِّن رَّبِّكَ وَالسَّلَامُ عَلَى مَنِ اتَّبَعَ الْهُدَى", "إِنَّا قَدْ أُوحِيَ إِلَيْنَا أَنَّ الْعَذَابَ عَلَى مَن كَذَّبَ وَتَوَلَّى", "قَالَ فَمَن رَّبُّكُمَا يَا مُوسَى", "قَالَ رَبُّنَا الَّذِي أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ ثُمَّ هَدَى", "قَالَ فَمَا بَالُ الْقُرُونِ الْأُولَى", "قَالَ عِلْمُهَا عِندَ رَبِّي فِي كِتَابٍ لَّا يَضِلُّ رَبِّي وَلَا يَنسَى", "الَّذِي جَعَلَ لَكُمُ الْأَرْضَ مَهْدًا وَسَلَكَ لَكُمْ فِيهَا سُبُلًا وَأَنزَلَ مِنَ السَّمَاء مَاء فَأَخْرَجْنَا بِهِ أَزْوَاجًا مِّن نَّبَاتٍ شَتَّى", "كُلُوا وَارْعَوْا أَنْعَامَكُمْ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِّأُوْلِي النُّهَى", "مِنْهَا خَلَقْنَاكُمْ وَفِيهَا نُعِيدُكُمْ وَمِنْهَا نُخْرِجُكُمْ تَارَةً أُخْرَى", "وَلَقَدْ أَرَيْنَاهُ آيَاتِنَا كُلَّهَا فَكَذَّبَ وَأَبَى", "قَالَ أَجِئْتَنَا لِتُخْرِجَنَا مِنْ أَرْضِنَا بِسِحْرِكَ يَا مُوسَى", "فَلَنَأْتِيَنَّكَ بِسِحْرٍ مِّثْلِهِ فَاجْعَلْ بَيْنَنَا وَبَيْنَكَ مَوْعِدًا لَّا نُخْلِفُهُ نَحْنُ وَلَا أَنتَ مَكَانًا سُوًى", "قَالَ مَوْعِدُكُمْ يَوْمُ الزِّينَةِ وَأَن يُحْشَرَ النَّاسُ ضُحًى", "فَتَوَلَّى فِرْعَوْنُ فَجَمَعَ كَيْدَهُ ثُمَّ أَتَى", "قَالَ لَهُم مُّوسَى وَيْلَكُمْ لَا تَفْتَرُوا عَلَى اللَّهِ كَذِبًا فَيُسْحِتَكُمْ بِعَذَابٍ وَقَدْ خَابَ مَنِ افْتَرَى", "فَتَنَازَعُوا أَمْرَهُم بَيْنَهُمْ وَأَسَرُّوا النَّجْوَى", "قَالُوا إِنْ هَذَانِ لَسَاحِرَانِ يُرِيدَانِ أَن يُخْرِجَاكُم مِّنْ أَرْضِكُم بِسِحْرِهِمَا وَيَذْهَبَا بِطَرِيقَتِكُمُ الْمُثْلَى", "فَأَجْمِعُوا كَيْدَكُمْ ثُمَّ ائْتُوا صَفًّا وَقَدْ أَفْلَحَ الْيَوْمَ مَنِ اسْتَعْلَى", "قَالُوا يَا مُوسَى إِمَّا أَن تُلْقِيَ وَإِمَّا أَن نَّكُونَ أَوَّلَ مَنْ أَلْقَى", "قَالَ بَلْ أَلْقُوا فَإِذَا حِبَالُهُمْ وَعِصِيُّهُمْ يُخَيَّلُ إِلَيْهِ مِن سِحْرِهِمْ أَنَّهَا تَسْعَى", "فَأَوْجَسَ فِي نَفْسِهِ خِيفَةً مُّوسَى", "قُلْنَا لَا تَخَفْ إِنَّكَ أَنتَ الْأَعْلَى", "وَأَلْقِ مَا فِي يَمِينِكَ تَلْقَفْ مَا صَنَعُوا إِنَّمَا صَنَعُوا كَيْدُ سَاحِرٍ وَلَا يُفْلِحُ السَّاحِرُ حَيْثُ أَتَى", "فَأُلْقِيَ السَّحَرَةُ سُجَّدًا قَالُوا آمَنَّا بِرَبِّ هَارُونَ وَمُوسَى", "قَالَ آمَنتُمْ لَهُ قَبْلَ أَنْ آذَنَ لَكُمْ إِنَّهُ لَكَبِيرُكُمُ الَّذِي عَلَّمَكُمُ السِّحْرَ فَلَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُم مِّنْ خِلَافٍ وَلَأُصَلِّبَنَّكُمْ فِي جُذُوعِ النَّخْلِ وَلَتَعْلَمُنَّ أَيُّنَا أَشَدُّ عَذَابًا وَأَبْقَى", "قَالُوا لَن نُّؤْثِرَكَ عَلَى مَا جَاءنَا مِنَ الْبَيِّنَاتِ وَالَّذِي فَطَرَنَا فَاقْضِ مَا أَنتَ قَاضٍ إِنَّمَا تَقْضِي هَذِهِ الْحَيَاةَ الدُّنْيَا", "إِنَّا آمَنَّا بِرَبِّنَا لِيَغْفِرَ لَنَا خَطَايَانَا وَمَا أَكْرَهْتَنَا عَلَيْهِ مِنَ السِّحْرِ وَاللَّهُ خَيْرٌ وَأَبْقَى", "إِنَّهُ مَن يَأْتِ رَبَّهُ مُجْرِمًا فَإِنَّ لَهُ جَهَنَّمَ لَا يَمُوتُ فِيهَا وَلَا يَحْيى", "وَمَنْ يَأْتِهِ مُؤْمِنًا قَدْ عَمِلَ الصَّالِحَاتِ فَأُوْلَئِكَ لَهُمُ الدَّرَجَاتُ الْعُلَى", "جَنَّاتُ عَدْنٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا وَذَلِكَ جَزَاء مَن تَزَكَّى", "وَلَقَدْ أَوْحَيْنَا إِلَى مُوسَى أَنْ أَسْرِ بِعِبَادِي فَاضْرِبْ لَهُمْ طَرِيقًا فِي الْبَحْرِ يَبَسًا لَّا تَخَافُ دَرَكًا وَلَا تَخْشَى", "فَأَتْبَعَهُمْ فِرْعَوْنُ بِجُنُودِهِ فَغَشِيَهُم مِّنَ الْيَمِّ مَا غَشِيَهُمْ", "وَأَضَلَّ فِرْعَوْنُ قَوْمَهُ وَمَا هَدَى", "يَا بَنِي إِسْرَائِيلَ قَدْ أَنجَيْنَاكُم مِّنْ عَدُوِّكُمْ وَوَاعَدْنَاكُمْ جَانِبَ الطُّورِ الْأَيْمَنَ وَنَزَّلْنَا عَلَيْكُمُ الْمَنَّ وَالسَّلْوَى", "كُلُوا مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَلَا تَطْغَوْا فِيهِ فَيَحِلَّ عَلَيْكُمْ غَضَبِي وَمَن يَحْلِلْ عَلَيْهِ غَضَبِي فَقَدْ هَوَى", "وَإِنِّي لَغَفَّارٌ لِّمَن تَابَ وَآمَنَ وَعَمِلَ صَالِحًا ثُمَّ اهْتَدَى", "وَمَا أَعْجَلَكَ عَن قَوْمِكَ يَا مُوسَى", "قَالَ هُمْ أُولَاء عَلَى أَثَرِي وَعَجِلْتُ إِلَيْكَ رَبِّ لِتَرْضَى", "قَالَ فَإِنَّا قَدْ فَتَنَّا قَوْمَكَ مِن بَعْدِكَ وَأَضَلَّهُمُ السَّامِرِيُّ", "فَرَجَعَ مُوسَى إِلَى قَوْمِهِ غَضْبَانَ أَسِفًا قَالَ يَا قَوْمِ أَلَمْ يَعِدْكُمْ رَبُّكُمْ وَعْدًا حَسَنًا أَفَطَالَ عَلَيْكُمُ الْعَهْدُ أَمْ أَرَدتُّمْ أَن يَحِلَّ عَلَيْكُمْ غَضَبٌ مِّن رَّبِّكُمْ فَأَخْلَفْتُم مَّوْعِدِي", "قَالُوا مَا أَخْلَفْنَا مَوْعِدَكَ بِمَلْكِنَا وَلَكِنَّا حُمِّلْنَا أَوْزَارًا مِّن زِينَةِ الْقَوْمِ فَقَذَفْنَاهَا فَكَذَلِكَ أَلْقَى السَّامِرِيُّ", "فَأَخْرَجَ لَهُمْ عِجْلًا جَسَدًا لَهُ خُوَارٌ فَقَالُوا هَذَا إِلَهُكُمْ وَإِلَهُ مُوسَى فَنَسِيَ", "أَفَلَا يَرَوْنَ أَلَّا يَرْجِعُ إِلَيْهِمْ قَوْلًا وَلَا يَمْلِكُ لَهُمْ ضَرًّا وَلَا نَفْعًا", "وَلَقَدْ قَالَ لَهُمْ هَارُونُ مِن قَبْلُ يَا قَوْمِ إِنَّمَا فُتِنتُم بِهِ وَإِنَّ رَبَّكُمُ الرَّحْمَنُ فَاتَّبِعُونِي وَأَطِيعُوا أَمْرِي", "قَالُوا لَن نَّبْرَحَ عَلَيْهِ عَاكِفِينَ حَتَّى يَرْجِعَ إِلَيْنَا مُوسَى", "قَالَ يَا هَارُونُ مَا مَنَعَكَ إِذْ رَأَيْتَهُمْ ضَلُّوا", "أَلَّا تَتَّبِعَنِ أَفَعَصَيْتَ أَمْرِي", "قَالَ يَا ابْنَ أُمَّ لَا تَأْخُذْ بِلِحْيَتِي وَلَا بِرَأْسِي إِنِّي خَشِيتُ أَن تَقُولَ فَرَّقْتَ بَيْنَ بَنِي إِسْرَائِيلَ وَلَمْ تَرْقُبْ قَوْلِي", "قَالَ فَمَا خَطْبُكَ يَا سَامِرِيُّ", "قَالَ بَصُرْتُ بِمَا لَمْ يَبْصُرُوا بِهِ فَقَبَضْتُ قَبْضَةً مِّنْ أَثَرِ الرَّسُولِ فَنَبَذْتُهَا وَكَذَلِكَ سَوَّلَتْ لِي نَفْسِي", "قَالَ فَاذْهَبْ فَإِنَّ لَكَ فِي الْحَيَاةِ أَن تَقُولَ لَا مِسَاسَ وَإِنَّ لَكَ مَوْعِدًا لَّنْ تُخْلَفَهُ وَانظُرْ إِلَى إِلَهِكَ الَّذِي ظَلْتَ عَلَيْهِ عَاكِفًا لَّنُحَرِّقَنَّهُ ثُمَّ لَنَنسِفَنَّهُ فِي الْيَمِّ نَسْفًا", "إِنَّمَا إِلَهُكُمُ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ وَسِعَ كُلَّ شَيْءٍ عِلْمًا", "كَذَلِكَ نَقُصُّ عَلَيْكَ مِنْ أَنبَاء مَا قَدْ سَبَقَ وَقَدْ آتَيْنَاكَ مِن لَّدُنَّا ذِكْرًا", "مَنْ أَعْرَضَ عَنْهُ فَإِنَّهُ يَحْمِلُ يَوْمَ الْقِيَامَةِ وِزْرًا", "خَالِدِينَ فِيهِ وَسَاء لَهُمْ يَوْمَ الْقِيَامَةِ حِمْلًا", "يَوْمَ يُنفَخُ فِي الصُّورِ وَنَحْشُرُ الْمُجْرِمِينَ يَوْمَئِذٍ زُرْقًا", "يَتَخَافَتُونَ بَيْنَهُمْ إِن لَّبِثْتُمْ إِلَّا عَشْرًا", "نَحْنُ أَعْلَمُ بِمَا يَقُولُونَ إِذْ يَقُولُ أَمْثَلُهُمْ طَرِيقَةً إِن لَّبِثْتُمْ إِلَّا يَوْمًا", "وَيَسْأَلُونَكَ عَنِ الْجِبَالِ فَقُلْ يَنسِفُهَا رَبِّي نَسْفًا", "فَيَذَرُهَا قَاعًا صَفْصَفًا", "لَا تَرَى فِيهَا عِوَجًا وَلَا أَمْتًا", "يَوْمَئِذٍ يَتَّبِعُونَ الدَّاعِيَ لَا عِوَجَ لَهُ وَخَشَعَت الْأَصْوَاتُ لِلرَّحْمَنِ فَلَا تَسْمَعُ إِلَّا هَمْسًا", "يَوْمَئِذٍ لَّا تَنفَعُ الشَّفَاعَةُ إِلَّا مَنْ أَذِنَ لَهُ الرَّحْمَنُ وَرَضِيَ لَهُ قَوْلًا", "يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِهِ عِلْمًا", "وَعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ وَقَدْ خَابَ مَنْ حَمَلَ ظُلْمًا", "وَمَن يَعْمَلْ مِنَ الصَّالِحَاتِ وَهُوَ مُؤْمِنٌ فَلَا يَخَافُ ظُلْمًا وَلَا هَضْمًا", "وَكَذَلِكَ أَنزَلْنَاهُ قُرْآنًا عَرَبِيًّا وَصَرَّفْنَا فِيهِ مِنَ الْوَعِيدِ لَعَلَّهُمْ يَتَّقُونَ أَوْ يُحْدِثُ لَهُمْ ذِكْرًا", "فَتَعَالَى اللَّهُ الْمَلِكُ الْحَقُّ وَلَا تَعْجَلْ بِالْقُرْآنِ مِن قَبْلِ أَن يُقْضَى إِلَيْكَ وَحْيُهُ وَقُل رَّبِّ زِدْنِي عِلْمًا", "وَلَقَدْ عَهِدْنَا إِلَى آدَمَ مِن قَبْلُ فَنَسِيَ وَلَمْ نَجِدْ لَهُ عَزْمًا", "وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ أَبَى", "فَقُلْنَا يَا آدَمُ إِنَّ هَذَا عَدُوٌّ لَّكَ وَلِزَوْجِكَ فَلَا يُخْرِجَنَّكُمَا مِنَ الْجَنَّةِ فَتَشْقَى", "إِنَّ لَكَ أَلَّا تَجُوعَ فِيهَا وَلَا تَعْرَى", "وَأَنَّكَ لَا تَظْمَأُ فِيهَا وَلَا تَضْحَى", "فَوَسْوَسَ إِلَيْهِ الشَّيْطَانُ قَالَ يَا آدَمُ هَلْ أَدُلُّكَ عَلَى شَجَرَةِ الْخُلْدِ وَمُلْكٍ لَّا يَبْلَى", "فَأَكَلَا مِنْهَا فَبَدَتْ لَهُمَا سَوْآتُهُمَا وَطَفِقَا يَخْصِفَانِ عَلَيْهِمَا مِن وَرَقِ الْجَنَّةِ وَعَصَى آدَمُ رَبَّهُ فَغَوَى", "ثُمَّ اجْتَبَاهُ رَبُّهُ فَتَابَ عَلَيْهِ وَهَدَى", "قَالَ اهْبِطَا مِنْهَا جَمِيعًا بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ فَإِمَّا يَأْتِيَنَّكُم مِّنِّي هُدًى فَمَنِ اتَّبَعَ هُدَايَ فَلَا يَضِلُّ وَلَا يَشْقَى", "وَمَنْ أَعْرَضَ عَن ذِكْرِي فَإِنَّ لَهُ مَعِيشَةً ضَنكًا وَنَحْشُرُهُ يَوْمَ الْقِيَامَةِ أَعْمَى", "قَالَ رَبِّ لِمَ حَشَرْتَنِي أَعْمَى وَقَدْ كُنتُ بَصِيرًا", "قَالَ كَذَلِكَ أَتَتْكَ آيَاتُنَا فَنَسِيتَهَا وَكَذَلِكَ الْيَوْمَ تُنسَى", "وَكَذَلِكَ نَجْزِي مَنْ أَسْرَفَ وَلَمْ يُؤْمِن بِآيَاتِ رَبِّهِ وَلَعَذَابُ الْآخِرَةِ أَشَدُّ وَأَبْقَى", "أَفَلَمْ يَهْدِ لَهُمْ كَمْ أَهْلَكْنَا قَبْلَهُم مِّنَ الْقُرُونِ يَمْشُونَ فِي مَسَاكِنِهِمْ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِّأُوْلِي النُّهَى", "وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ لَكَانَ لِزَامًا وَأَجَلٌ مُسَمًّى", "فَاصْبِرْ عَلَى مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا وَمِنْ آنَاء اللَّيْلِ فَسَبِّحْ وَأَطْرَافَ النَّهَارِ لَعَلَّكَ تَرْضَى", "وَلَا تَمُدَّنَّ عَيْنَيْكَ إِلَى مَا مَتَّعْنَا بِهِ أَزْوَاجًا مِّنْهُمْ زَهْرَةَ الْحَيَاةِ الدُّنيَا لِنَفْتِنَهُمْ فِيهِ وَرِزْقُ رَبِّكَ خَيْرٌ وَأَبْقَى", "وَأْمُرْ أَهْلَكَ بِالصَّلَاةِ وَاصْطَبِرْ عَلَيْهَا لَا نَسْأَلُكَ رِزْقًا نَّحْنُ نَرْزُقُكَ وَالْعَاقِبَةُ لِلتَّقْوَى", "وَقَالُوا لَوْلَا يَأْتِينَا بِآيَةٍ مِّن رَّبِّهِ أَوَلَمْ تَأْتِهِم بَيِّنَةُ مَا فِي الصُّحُفِ الْأُولَى", "وَلَوْ أَنَّا أَهْلَكْنَاهُم بِعَذَابٍ مِّن قَبْلِهِ لَقَالُوا رَبَّنَا لَوْلَا أَرْسَلْتَ إِلَيْنَا رَسُولًا فَنَتَّبِعَ آيَاتِكَ مِن قَبْلِ أَن نَّذِلَّ وَنَخْزَى", "قُلْ كُلٌّ مُّتَرَبِّصٌ فَتَرَبَّصُوا فَسَتَعْلَمُونَ مَنْ أَصْحَابُ الصِّرَاطِ السَّوِيِّ وَمَنِ اهْتَدَى"], "name_en": "Taha", "ayahs_en": ["Tâ­Hâ. [These letters are one of the miracles of the Qur’ân, and none but Allâh (Alone) knows their meanings.]", "We have not sent down the Qur’ân unto you (O Muhammad SAW) to cause you distress,", "But only as a Reminder to those who fear (Allâh).", "A revelation from Him (Allâh) Who has created the earth and high heavens.", "The Most Beneficent (Allâh) Istawâ (rose over) the (Mighty) Throne (in a manner that suits His Majesty).", "To Him belongs all that is in the  heavens and all that is on the earth, and all that is between them, and  all that is under the soil.", "And if you (O Muhammad SAW) speak (the invocation) aloud, then verily, He knows the secret and that which is yet more hidden.", "Allâh! Lâ ilâhla illa Huwa (none has the right to be worshipped but He)! To Him belong the Best Names.", "And has there come to you the story of Mûsa (Moses)?", "When he saw a fire, he said to his  family: ”Wait! Verily, I have seen a fire, perhaps I can bring you some  burning brand therefrom, or find some guidance at the fire.”", "And when he came to it (the fire), he was called by name: ”O Mûsa (Moses)!", "”Verily! I am your Lord! So take off your shoes, you are in the sacred valley, Tuwa.", "”And I have chosen you. So listen to that which is inspired to you.", "”Verily! I am Allâh! Lâ ilâha illa Ana  (none has the right to be worshipped but I), so worship Me, and perform  As­Salât (Iqâmat-as-Salât) for My Remembrance.", "”Verily, the Hour is coming and My Will is to keep it hidden that every person may be rewarded for that which he strives.", "”Therefore, let not the one who believes  not therein (i.e. in the Day of Resurrection, Reckoning, Paradise and  Hell, etc.), but follows his own lusts, divert you therefrom, lest you  perish.", "”And what is that in your right hand, O Mûsa (Moses)?”", "He said: ”This is my stick, whereon I lean, and wherewith I beat down branches for my sheep, and wherein I find other uses.”", "(Allâh) said: ”Cast it down, O Mûsa (Moses)!”", "He cast it down, and behold! It was a snake, moving quickly.", "Allâh said:”Grasp it, and fear not, We shall return it to its former state,", "”And press your (right) hand to your (left) side, it will come forth white (and shining), without any disease as another sign,", "”That We may show you (some) of Our Greater Signs.", "”Go to Fir’aun (Pharaoh)! Verily, he has  transgressed (all bounds in disbelief and disobedience, and has behaved  as an arrogant, and as a tyrant).”", "[Mûsa (Moses)] said: ”O my Lord! Open for me my chest (grant me self-confidence, contentment, and boldness).", "”And ease my task for me;", "”And make loose the knot (the defect)  from my tongue, (i.e. remove the incorrectness from my speech) [That  occurred as a result of a brand of fire which Mûsa (Moses) put in his  mouth when he was an infant]. [Tafsir At-Tabarî, Vol. 16, Page 159].", "”That they understand my speech,", "”And appoint for me a helper from my family,", "”Hârûn (Aaron), my brother;", "”Increase my strength with him,", "”And let him share my task (of conveying Allâh’s Message and Prophethood),", "”That we may glorify You much,", "”And remember You much,", "”Verily! You are of us Ever a Well-Seer.”", "Allâh said: ”You are granted your request, O Mûsa (Moses)!", "”And indeed We conferred a favour on you another time (before).", "”When We inspired your mother with that which We inspired.", "”Saying: ’Put him (the child) into the  Tabût (a box or a case or a chest) and put it into the river (Nile),  then the river shall cast it up on the bank, and there, an enemy of  Mine and an enemy of his shall take him.’ And I endued you with love  from Me, in order that you may be brought up under My Eye,", "”When your sister went and said: ’Shall  I show you one who will nurse him?’ So We restored you to your mother,  that she might cool her eyes and she should not grieve. Then you did  kill a man, but We saved you from great distress and tried you with a  heavy trial. Then you stayed a number of years with the people of  Madyan (Midian). Then you came here according to the fixed term which I  ordained (for you), O Mûsa (Moses)!", "”And I have Istana’tuka, for Myself.", "”Go you and your brother with My Ayât  (proofs, evidences, verses, lessons, signs, revelations, etc.), and do  not, you both, slacken and become weak in My Remembrance.", "”Go, both of you, to Fir’aun (Pharaoh),  verily, he has transgressed (all bounds in disbelief and disobedience  and behaved as an arrogant and as a tyrant).", "”And speak to him mildly, perhaps he may accept admonition or fear Allâh.”", "They said: ”Our Lord! Verily! We fear lest he should hasten to punish us or lest he should transgress (all bounds against us).”", "He (Allâh) said: ”Fear not, verily! I am with you both, hearing and seeing.", "”So go you both to him, and say:  ’Verily, we are Messengers of your Lord, so let the Children of Israel  go with us, and torment them not; indeed, we have come with a sign from  your Lord! And peace will be upon him who follows the guidance!", "’Truly, it has been revealed to us that  the torment will be for him who denies [believes not in the Oneness of  Allâh, and in His Messengers, etc.], and turns away.’(from the truth  and obedience of Allâh)”", "Fir’aun (Pharaoh) said: ”Who then, O Mûsa (Moses), is the Lord of you two?”", "[Mûsa (Moses)] said: ”Our Lord is He Who gave to each thing its form and nature, then guided it aright.”", "[Fir’aun (Pharaoh)] said: ”What about the generations of old?”", "[Mûsa (Moses)] said: ”The knowledge thereof is with my Lord, in a Record. My Lord is neither unaware nor He forgets, ”", "Who has made earth for you like a bed  (spread out); and has opened roads (ways and paths etc.) for you  therein; and has sent down water (rain) from the sky. And We have  brought forth with it various kinds of vegetation.", "Eat and pasture your cattle, (therein); verily, in this are proofs and signs for men of understanding.", "Thereof (the earth) We created you, and into it We shall return you, and from it We shall bring you out once again.", "And indeed We showed him [Fir’aun (Pharaoh)] all Our Signs and Evidences, but he denied and refused.", "He [Fir’aun (Pharaoh)] said: ”Have you come to drive us out of our land with your magic, O Mûsa (Moses)?", "”Then verily, we can produce magic the  like thereof; so appoint a meeting between us and you, which neither  we, nor you shall fail to keep, in an open wide place where both shall  have a just and equal chance (and beholders could witness the  competition).”", "[Mûsa (Moses)] said: ”Your appointed  meeting is the day of the festival, and let the people assemble when  the sun has risen (forenoon).”", "So Fir’aun (Pharaoh) withdrew, devised his plot and then came back.", "Mûsa (Moses) said to them: ”Woe unto  you! Invent not a lie against Allâh, lest He should destroy you  completely by a torment. And surely, he who invents a lie (against  Allâh) will fail miserably.”", "Then they debated with one another what they must do, and they kept their talk secret.", "They said: ”Verily! These are two  magicians. Their object is to drive you out from your land with magic,  and overcome your chiefs and nobles.", "”So devise your plot, and then assemble in line. And whoever overcomes this day will be indeed successful.”", "They said:”O Mûsa (Moses)! Either you throw first or we be the first to throw?”", "[Mûsa (Moses)] said: ”Nay, throw you  (first)!” Then behold, their ropes and their sticks, by their magic,  appeared to him as though they moved fast.", "So Mûsa (Moses) conceived a fear in himself.", "We (Allâh) said: ”Fear not! Surely, you will have the upper hand.", "”And throw that which is in your right  hand! It will swallow up that which they have made. That which they  have made is only a magician’s trick, and the magician will never be  successful, no matter whatever amount (of skill) he may attain.”", "So the magicians fell down prostrate. They said: ”We believe in the Lord of Hârûn (Aaron) and Mûsa (Moses).”", "[Fir’aun (Pharaoh)] said: ”Believe you  in him [Mûsa (Moses)] before I give you permission? Verily! He is your  chief who taught you magic. So I will surely cut off your hands and  feet on opposite sides, and I will surely crucify you on the trunks of  date-palms, and you shall surely know which of us [I (Fir’aun ­  Pharaoh) or the Lord of Mûsa (Moses) (Allâh)] can give the severe and  more lasting torment.”", "They said: ”We prefer you not over the  clear signs that have come to us, and to Him (Allâh) Who created us. So  decree whatever you desire to decree, for you can only decree  (regarding) this life of the world.", "”Verily! We have believed in our Lord,  that He may forgive us our faults, and the magic to which you did  compel us. And Allâh is better as regards reward in comparison to your  [Fir’aun’s (Pharaoh)] reward, and more lasting (as regards punishment  in comparison to your punishment).”", "Verily! Whoever comes to his Lord as a  Mujrim (criminal, polytheist, disbeliever in the Oneness of Allâh and  His Messengers, sinner, etc.), then surely, for him is Hell, therein he  will neither die nor live.", "But whoever comes to Him (Allâh) as a  believer (in the Oneness of Allâh, etc.), and has done righteous good  deeds, for such are the high ranks (in the Hereafter),", "’Adn (Edn) Paradise (everlasting  Gardens), under which rivers flow, wherein they will abide forever:  such is the reward of those who purify themselves [(by abstaining from  all kinds of sins and evil deeds) which Allâh has forbidden and by  doing all that which Allâh has ordained)].", "And indeed We inspired Mûsa (Moses)  (saying): ”Travel by night with Ibâdi (My slaves) and strike a dry path  for them in the sea, fearing neither to be overtaken [by Fir’aun  (Pharaoh)] nor being afraid (of drowning in the sea).”", "Then Fir’aun (Pharaoh) pursued them with his hosts, but the sea-water completely overwhelmed them and covered them up.", "And Fir’aun (Pharaoh) led his people astray, and he did not guide them.", "O Children of Israel! We delivered you  from your enemy, and We made a covenant with you on the right side of  the Mount, and We sent down to you Al-Manna and quails,", "(Saying) eat of the Taiyibât (good  lawful things) wherewith We have provided you, and commit no oppression  therein, lest My Anger should justly descend on you. And he on whom My  Anger descends, he is indeed perished.", "And verily, I am indeed Forgiving to him  who repents, believes (in My Oneness, and associates none in worship  with Me) and does righteous good deeds, and then remains constant in  doing them, (till his death).", "”And what made you hasten from your people, O Mûsa (Moses)?”", "He said: ”They are close on my footsteps, and I hastened to You, O my Lord, that You might be pleased.”", "(Allâh) said: ”Verily! We have tried your people in your absence, and As-Samiri has led them astray.”", "Then Mûsa (Moses) returned to his people  in a state of anger and sorrow. He said: ”O my people! Did not your  Lord promise you a fair promise? Did then the promise seem to you long  in coming? Or did you desire that wrath should descend from your Lord  on you, so you broke your promise to me (i.e disbelieving in Allâh and  worshipping the calf)?”", "They said: ”We broke not the promise to  you, of our own will, but we were made to carry the weight of the  ornaments of the [Fir’aun’s (Pharaoh)] people, then we cast them (into  the fire), and that was what As-Samiri suggested.”", "Then he took out (of the fire) for them  a statue of a calf which seemed to low. They said: ”This is your ilâh  (god), and the ilâh (god) of Mûsa (Moses), but [Mûsa (Moses)] has  forgotten (his god).’”", "Did they not see that it could not  return them a word (for answer), and that it had no power either to  harm them or to do them good?", "And Hârûn (Aaron) indeed had said to  them beforehand: ”O my people! You are being tried in this, and verily,  your Lord is (Allâh) the Most Beneficent, so follow me and obey my  order.”", "They said: ”We will not stop worshipping it (i.e. the calf), until Mûsa (Moses) returns to us.”", "[Mûsa (Moses)] said: ”O Hârûn (Aaron)! What stopped you when you saw them going astray;", "”That you followed me not (according to my advice to you)? Have you then disobeyed my order?”", "He [Hârûn (Aaron)] said: ”O son of my  mother! Seize (me) not by my beard, nor by my head! Verily, I feared  lest you should say: ’You have caused a division among the Children of  Israel, and you have not respected my word!’ ”", "[Mûsa (Moses)] said: ”And what is the matter with you. O Samiri? (i.e. why did you do so?)”", "(Samiri) said: ”I saw what they saw not,  so I took a handful (of dust) from the hoof print of the messenger  [Jibrael’s (Gabriel) horse] and threw it [into the fire in which were  put the ornaments of the Fir’aun’s (Pharaoh) people, or into the calf].  Thus my inner-self suggested to me.”", "Mûsa (Moses) said: ”Then go away! And  verily, your (punishment) in this life will be that you will say:  ”Touch me not (i.e.you will live alone exiled away from mankind); and  verily (for a future torment), you have a promise that will not fail.  And look at your ilâh (god), to which you have been devoted. We will  certainly burn it, and scatter its particles in the sea.”", "Your Ilâh (God) is only Allâh, the One  (Lâ ilâha illa Huwa) (none has the right to be worshipped but He). He  has full knowledge of all things.", "Thus We relate to you (O Muhammad SAW)  some information of what happened before. And indeed We have given you  from Us a Reminder (this Qur’ân).", "Whoever turns away from it (this Qur’ân  i.e. does not believe in it, nor acts on its orders), verily, they will  bear a heavy burden (of sins) on the Day of Resurrection,", "They will abide in that (state in the Fire of Hell), and evil indeed will it be that load for them on the Day of Resurrection;", "The Day when the Trumpet will be blown  (the second blowing): that Day, We shall gather the Mujrimûn  (criminals, polytheists, sinners, disbelievers in the Oneness of Allâh,  etc.) Zurqa: (blue or blind eyed with black faces).", "In whispers will they speak to each other (saying): ”You stayed not longer than ten (days).”", "We know very well what they will say,  when the best among them in knowledge and wisdom will say: ”You stayed  no longer than a day!”", "And they ask you concerning the mountains, say; ”My Lord will blast them and scatter them as particles of dust.", "”Then He shall leave it as a level smooth plain.", "”You will see therein nothing crooked or curved.”", "On that Day mankind will follow strictly  (the voice of) Allâh’s caller, no crookedness (that is without going to  the right or left of that voice) will they show him (Allâh’s caller).  And all voices will be humbled for the Most Beneficent (Allâh), and  nothing shall you hear but the low voice of their footsteps.", "On that day no intercession shall avail,  except the one for whom the Most Beneficent (Allâh) has given  permission and whose word is acceptable to Him.", "He (Allâh) knows what happens to them  (His creatures) in this world, and what will happen to them (in the  Hereafter), and they will never compass anything of His Knowledge.", "And (all) faces shall be humbled before  (Allâh), the Ever Living, the One Who sustains and protects all that  exists. And he who carried (a burden of) wrongdoing (i.e. he who  disbelieved in Allâh, ascribed partners to Him, and did deeds of His  disobedience), became indeed a complete failure (on that Day).", "And he who works deeds of righteousness,  while he is a believer (in Islâmic Monotheism) then he will have no  fear of injustice, nor of any curtailment (of his reward).", "And thus We have sent it down as a  Qur’ân in Arabic, and have explained therein in detail the warnings, in  order that they may fear Allâh, or that it may cause them to have a  lesson from it (or to have the honour for believing and acting on its  teachings).", "Then High above all be Allâh, the True  King. And be not in haste (O Muhammad SAW) with the Qur’ân before its  revelation is completed to you, and say: ”My Lord! Increase me in  knowledge.”", "And indeed We made a covenant with Adam before, but he forgot, and We found on his part no firm will-power.", "And (remember) when We said to the  angels: ”Prostrate yourselves to Adam.” They prostrated (all) except  Iblîs (Satan), who refused.", "Then We said: ”O Adam! Verily, this is  an enemy to you and to your wife. So let him not get you both out of  Paradise, so that you be distressed in misery.", "Verily, you have (a promise from Us) that you will never be hungry therein nor naked.", "And you (will) suffer not from thirst therein nor from the sun’s heat.", "Then Shaitân (Satan) whispered to him,  saying : ”O Adam! Shall I lead you to the Tree of Eternity and to a  kingdom that will never waste away?”", "Then they both ate of the tree, and so  their private parts appeared to them, and they began to stick on  themselves the leaves from Paradise for their covering. Thus did Adam  disobey his Lord, so he went astray.", "Then his Lord chose him, and turned to him with forgiveness, and gave him guidance.", "(Allâh) said:”Get you down (from the  Paradise to the earth), both of you, together, some of you are an enemy  to some others. Then if there comes to you guidance from Me, then  whoever follows My Guidance shall neither go astray, nor fall into  distress and misery.", "”But whosoever turns away from My  Reminder (i.e. neither believes in this Qur’ân nor acts on its orders,  etc.) verily, for him is a life of hardship, and We shall raise him up  blind on the Day of Resurrection.”", "He will say:”O my Lord! Why have you raised me up blind, while I had sight (before).”", "(Allâh) will say: ”Like this, Our Ayât  (proofs, evidences, verses, lessons, signs, revelations, etc.) came  unto you, but you disregarded them (i.e. you left them, did not think  deeply in them, and you turned away from them), and so this Day, you  will be neglected (in the Hell-fire, away from Allâh’s Mercy).”", "And thus do We requite him who  transgresses beyond bounds [i.e. commits the great sins and disobeys  his Lord (Allâh) and believes not in His Messengers, and His revealed  Books, like this Qur’ân, etc.], and believes not in the Ayât (proofs,  evidences, verses, lessons, signs, revelations, etc.) of his Lord, and  the torment of the Hereafter is far more severe and more lasting.", "Is it not a guidance for them (to know)  how many generations We have destroyed before them, in whose dwellings  they walk? Verily, in this are signs indeed for men of understanding.", "And had it not been for a Word that went  forth before from your Lord, and a term determined, (their punishment)  must necessarily have come (in this world).", "So bear patiently (O Muhammad SAW) what  they say, and glorify the praises of your Lord before the rising of the  sun, and before its setting, and during some of the hours of the night,  and at the sides of the day (an indication for the five compulsory  congregational prayers), that you may become pleased with the reward  which Allâh shall give you.", "And strain not your eyes in longing for  the things We have given for enjoyment to various groups of them  (polytheists and disbelievers in the Oneness of Allâh), the splendour  of the life of this world that We may test them thereby. But the  provision (good reward in the Hereafter) of your Lord is better and  more lasting.", "And enjoin As-Salât (the prayer) on your  family, and be patient in offering them [i.e. the Salât (prayers)]. We  ask not of you a provision (i.e. to give Us something: money, etc.); We  provide for you. And the good end (i.e. Paradise) is for the Muttaqûn  (pious - see V.2:2).", "They say: ”Why does he not bring us a  sign (proof) from his Lord?” Has there not come to them the proof of  that which is (written) in the former papers [Scriptures, i.e. the  Taurât (Torah), and the Injeel (Gospel), etc. about the coming of the  Prophet Muhammad SAW ].", "And if We had destroyed them with a  torment before this (i.e. Messenger Muhammad SAW and the Qur’ân), they  would surely have said: ”Our Lord! If only You had sent us a Messenger,  we should certainly have followed Your Ayât (proofs, evidences, verses,  lessons, signs, revelations, etc.), before we were humiliated and  disgraced.”", "Say (O Muhammad SAW): ”Each one  (believer and disbeliever, etc.) is waiting, so wait you too, and you  shall know who are they that are on the Straight and Even Path (i.e.  Allâh’s Religion of Islâmic Monotheism), and who are they that have let  themselves be guided (on the Right Path)."]}