{"name_ar": "سورة الأنبياء", "ayahs_ar": ["اقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِي غَفْلَةٍ مُّعْرِضُونَ", "مَا يَأْتِيهِم مِّن ذِكْرٍ مَّن رَّبِّهِم مُّحْدَثٍ إِلَّا اسْتَمَعُوهُ وَهُمْ يَلْعَبُونَ", "لَاهِيَةً قُلُوبُهُمْ وَأَسَرُّواْ النَّجْوَى الَّذِينَ ظَلَمُواْ هَلْ هَذَا إِلَّا بَشَرٌ مِّثْلُكُمْ أَفَتَأْتُونَ السِّحْرَ وَأَنتُمْ تُبْصِرُونَ", "قَالَ رَبِّي يَعْلَمُ الْقَوْلَ فِي السَّمَاء وَالأَرْضِ وَهُوَ السَّمِيعُ الْعَلِيمُ", "بَلْ قَالُواْ أَضْغَاثُ أَحْلاَمٍ بَلِ افْتَرَاهُ بَلْ هُوَ شَاعِرٌ فَلْيَأْتِنَا بِآيَةٍ كَمَا أُرْسِلَ الأَوَّلُونَ", "مَا آمَنَتْ قَبْلَهُم مِّن قَرْيَةٍ أَهْلَكْنَاهَا أَفَهُمْ يُؤْمِنُونَ", "وَمَا أَرْسَلْنَا قَبْلَكَ إِلاَّ رِجَالاً نُّوحِي إِلَيْهِمْ فَاسْأَلُواْ أَهْلَ الذِّكْرِ إِن كُنتُمْ لاَ تَعْلَمُونَ", "وَمَا جَعَلْنَاهُمْ جَسَدًا لَّا يَأْكُلُونَ الطَّعَامَ وَمَا كَانُوا خَالِدِينَ", "ثُمَّ صَدَقْنَاهُمُ الْوَعْدَ فَأَنجَيْنَاهُمْ وَمَن نَّشَاء وَأَهْلَكْنَا الْمُسْرِفِينَ", "لَقَدْ أَنزَلْنَا إِلَيْكُمْ كِتَابًا فِيهِ ذِكْرُكُمْ أَفَلَا تَعْقِلُونَ", "وَكَمْ قَصَمْنَا مِن قَرْيَةٍ كَانَتْ ظَالِمَةً وَأَنشَأْنَا بَعْدَهَا قَوْمًا آخَرِينَ", "فَلَمَّا أَحَسُّوا بَأْسَنَا إِذَا هُم مِّنْهَا يَرْكُضُونَ", "لَا تَرْكُضُوا وَارْجِعُوا إِلَى مَا أُتْرِفْتُمْ فِيهِ وَمَسَاكِنِكُمْ لَعَلَّكُمْ تُسْأَلُونَ", "قَالُوا يَا وَيْلَنَا إِنَّا كُنَّا ظَالِمِينَ", "فَمَا زَالَت تِّلْكَ دَعْوَاهُمْ حَتَّى جَعَلْنَاهُمْ حَصِيدًا خَامِدِينَ", "وَمَا خَلَقْنَا السَّمَاء وَالْأَرْضَ وَمَا بَيْنَهُمَا لَاعِبِينَ", "لَوْ أَرَدْنَا أَن نَّتَّخِذَ لَهْوًا لَّاتَّخَذْنَاهُ مِن لَّدُنَّا إِن كُنَّا فَاعِلِينَ", "بَلْ نَقْذِفُ بِالْحَقِّ عَلَى الْبَاطِلِ فَيَدْمَغُهُ فَإِذَا هُوَ زَاهِقٌ وَلَكُمُ الْوَيْلُ مِمَّا تَصِفُونَ", "وَلَهُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ وَمَنْ عِندَهُ لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ وَلَا يَسْتَحْسِرُونَ", "يُسَبِّحُونَ اللَّيْلَ وَالنَّهَارَ لَا يَفْتُرُونَ", "أَمِ اتَّخَذُوا آلِهَةً مِّنَ الْأَرْضِ هُمْ يُنشِرُونَ", "لَوْ كَانَ فِيهِمَا آلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتَا فَسُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ عَمَّا يَصِفُونَ", "لَا يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ", "أَمِ اتَّخَذُوا مِن دُونِهِ آلِهَةً قُلْ هَاتُوا بُرْهَانَكُمْ هَذَا ذِكْرُ مَن مَّعِيَ وَذِكْرُ مَن قَبْلِي بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ الْحَقَّ فَهُم مُّعْرِضُونَ", "وَمَا أَرْسَلْنَا مِن قَبْلِكَ مِن رَّسُولٍ إِلَّا نُوحِي إِلَيْهِ أَنَّهُ لَا إِلَهَ إِلَّا أَنَا فَاعْبُدُونِ", "وَقَالُوا اتَّخَذَ الرَّحْمَنُ وَلَدًا سُبْحَانَهُ بَلْ عِبَادٌ مُّكْرَمُونَ", "لَا يَسْبِقُونَهُ بِالْقَوْلِ وَهُم بِأَمْرِهِ يَعْمَلُونَ", "يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يَشْفَعُونَ إِلَّا لِمَنِ ارْتَضَى وَهُم مِّنْ خَشْيَتِهِ مُشْفِقُونَ", "وَمَن يَقُلْ مِنْهُمْ إِنِّي إِلَهٌ مِّن دُونِهِ فَذَلِكَ نَجْزِيهِ جَهَنَّمَ كَذَلِكَ نَجْزِي الظَّالِمِينَ", "أَوَلَمْ يَرَ الَّذِينَ كَفَرُوا أَنَّ السَّمَاوَاتِ وَالْأَرْضَ كَانَتَا رَتْقًا فَفَتَقْنَاهُمَا وَجَعَلْنَا مِنَ الْمَاء كُلَّ شَيْءٍ حَيٍّ أَفَلَا يُؤْمِنُونَ", "وَجَعَلْنَا فِي الْأَرْضِ رَوَاسِيَ أَن تَمِيدَ بِهِمْ وَجَعَلْنَا فِيهَا فِجَاجًا سُبُلًا لَعَلَّهُمْ يَهْتَدُونَ", "وَجَعَلْنَا السَّمَاء سَقْفًا مَّحْفُوظًا وَهُمْ عَنْ آيَاتِهَا مُعْرِضُونَ", "وَهُوَ الَّذِي خَلَقَ اللَّيْلَ وَالنَّهَارَ وَالشَّمْسَ وَالْقَمَرَ كُلٌّ فِي فَلَكٍ يَسْبَحُونَ", "وَمَا جَعَلْنَا لِبَشَرٍ مِّن قَبْلِكَ الْخُلْدَ أَفَإِن مِّتَّ فَهُمُ الْخَالِدُونَ", "كُلُّ نَفْسٍ ذَائِقَةُ الْمَوْتِ وَنَبْلُوكُم بِالشَّرِّ وَالْخَيْرِ فِتْنَةً وَإِلَيْنَا تُرْجَعُونَ", "وَإِذَا رَآكَ الَّذِينَ كَفَرُوا إِن يَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَذَا الَّذِي يَذْكُرُ آلِهَتَكُمْ وَهُم بِذِكْرِ الرَّحْمَنِ هُمْ كَافِرُونَ", "خُلِقَ الْإِنسَانُ مِنْ عَجَلٍ سَأُرِيكُمْ آيَاتِي فَلَا تَسْتَعْجِلُونِ", "وَيَقُولُونَ مَتَى هَذَا الْوَعْدُ إِن كُنتُمْ صَادِقِينَ", "لَوْ يَعْلَمُ الَّذِينَ كَفَرُوا حِينَ لَا يَكُفُّونَ عَن وُجُوهِهِمُ النَّارَ وَلَا عَن ظُهُورِهِمْ وَلَا هُمْ يُنصَرُونَ", "بَلْ تَأْتِيهِم بَغْتَةً فَتَبْهَتُهُمْ فَلَا يَسْتَطِيعُونَ رَدَّهَا وَلَا هُمْ يُنظَرُونَ", "وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِّن قَبْلِكَ فَحَاقَ بِالَّذِينَ سَخِرُوا مِنْهُم مَّا كَانُوا بِهِ يَسْتَهْزِؤُون", "قُلْ مَن يَكْلَؤُكُم بِاللَّيْلِ وَالنَّهَارِ مِنَ الرَّحْمَنِ بَلْ هُمْ عَن ذِكْرِ رَبِّهِم مُّعْرِضُونَ", "أَمْ لَهُمْ آلِهَةٌ تَمْنَعُهُم مِّن دُونِنَا لَا يَسْتَطِيعُونَ نَصْرَ أَنفُسِهِمْ وَلَا هُم مِّنَّا يُصْحَبُونَ", "بَلْ مَتَّعْنَا هَؤُلَاء وَآبَاءهُمْ حَتَّى طَالَ عَلَيْهِمُ الْعُمُرُ أَفَلَا يَرَوْنَ أَنَّا نَأْتِي الْأَرْضَ نَنقُصُهَا مِنْ أَطْرَافِهَا أَفَهُمُ الْغَالِبُونَ", "قُلْ إِنَّمَا أُنذِرُكُم بِالْوَحْيِ وَلَا يَسْمَعُ الصُّمُّ الدُّعَاء إِذَا مَا يُنذَرُونَ", "وَلَئِن مَّسَّتْهُمْ نَفْحَةٌ مِّنْ عَذَابِ رَبِّكَ لَيَقُولُنَّ يَا وَيْلَنَا إِنَّا كُنَّا ظَالِمِينَ", "وَنَضَعُ الْمَوَازِينَ الْقِسْطَ لِيَوْمِ الْقِيَامَةِ فَلَا تُظْلَمُ نَفْسٌ شَيْئًا وَإِن كَانَ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ أَتَيْنَا بِهَا وَكَفَى بِنَا حَاسِبِينَ", "وَلَقَدْ آتَيْنَا مُوسَى وَهَارُونَ الْفُرْقَانَ وَضِيَاء وَذِكْرًا لِّلْمُتَّقِينَ", "الَّذِينَ يَخْشَوْنَ رَبَّهُم بِالْغَيْبِ وَهُم مِّنَ السَّاعَةِ مُشْفِقُونَ", "وَهَذَا ذِكْرٌ مُّبَارَكٌ أَنزَلْنَاهُ أَفَأَنتُمْ لَهُ مُنكِرُونَ", "وَلَقَدْ آتَيْنَا إِبْرَاهِيمَ رُشْدَهُ مِن قَبْلُ وَكُنَّا بِه عَالِمِينَ", "إِذْ قَالَ لِأَبِيهِ وَقَوْمِهِ مَا هَذِهِ التَّمَاثِيلُ الَّتِي أَنتُمْ لَهَا عَاكِفُونَ", "قَالُوا وَجَدْنَا آبَاءنَا لَهَا عَابِدِينَ", "قَالَ لَقَدْ كُنتُمْ أَنتُمْ وَآبَاؤُكُمْ فِي ضَلَالٍ مُّبِينٍ", "قَالُوا أَجِئْتَنَا بِالْحَقِّ أَمْ أَنتَ مِنَ اللَّاعِبِينَ", "قَالَ بَل رَّبُّكُمْ رَبُّ السَّمَاوَاتِ وَالْأَرْضِ الَّذِي فَطَرَهُنَّ وَأَنَا عَلَى ذَلِكُم مِّنَ الشَّاهِدِينَ", "وَتَاللَّهِ لَأَكِيدَنَّ أَصْنَامَكُم بَعْدَ أَن تُوَلُّوا مُدْبِرِينَ", "فَجَعَلَهُمْ جُذَاذًا إِلَّا كَبِيرًا لَّهُمْ لَعَلَّهُمْ إِلَيْهِ يَرْجِعُونَ", "قَالُوا مَن فَعَلَ هَذَا بِآلِهَتِنَا إِنَّهُ لَمِنَ الظَّالِمِينَ", "قَالُوا سَمِعْنَا فَتًى يَذْكُرُهُمْ يُقَالُ لَهُ إِبْرَاهِيمُ", "قَالُوا فَأْتُوا بِهِ عَلَى أَعْيُنِ النَّاسِ لَعَلَّهُمْ يَشْهَدُونَ", "قَالُوا أَأَنتَ فَعَلْتَ هَذَا بِآلِهَتِنَا يَا إِبْرَاهِيمُ", "قَالَ بَلْ فَعَلَهُ كَبِيرُهُمْ هَذَا فَاسْأَلُوهُمْ إِن كَانُوا يَنطِقُونَ", "فَرَجَعُوا إِلَى أَنفُسِهِمْ فَقَالُوا إِنَّكُمْ أَنتُمُ الظَّالِمُونَ", "ثُمَّ نُكِسُوا عَلَى رُؤُوسِهِمْ لَقَدْ عَلِمْتَ مَا هَؤُلَاء يَنطِقُونَ", "قَالَ أَفَتَعْبُدُونَ مِن دُونِ اللَّهِ مَا لَا يَنفَعُكُمْ شَيْئًا وَلَا يَضُرُّكُمْ", "أُفٍّ لَّكُمْ وَلِمَا تَعْبُدُونَ مِن دُونِ اللَّهِ أَفَلَا تَعْقِلُونَ", "قَالُوا حَرِّقُوهُ وَانصُرُوا آلِهَتَكُمْ إِن كُنتُمْ فَاعِلِينَ", "قُلْنَا يَا نَارُ كُونِي بَرْدًا وَسَلَامًا عَلَى إِبْرَاهِيمَ", "وَأَرَادُوا بِهِ كَيْدًا فَجَعَلْنَاهُمُ الْأَخْسَرِينَ", "وَنَجَّيْنَاهُ وَلُوطًا إِلَى الْأَرْضِ الَّتِي بَارَكْنَا فِيهَا لِلْعَالَمِينَ", "وَوَهَبْنَا لَهُ إِسْحَقَ وَيَعْقُوبَ نَافِلَةً وَكُلًّا جَعَلْنَا صَالِحِينَ", "وَجَعَلْنَاهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا وَأَوْحَيْنَا إِلَيْهِمْ فِعْلَ الْخَيْرَاتِ وَإِقَامَ الصَّلَاةِ وَإِيتَاء الزَّكَاةِ وَكَانُوا لَنَا عَابِدِينَ", "وَلُوطًا آتَيْنَاهُ حُكْمًا وَعِلْمًا وَنَجَّيْنَاهُ مِنَ الْقَرْيَةِ الَّتِي كَانَت تَّعْمَلُ الْخَبَائِثَ إِنَّهُمْ كَانُوا قَوْمَ سَوْءٍ فَاسِقِينَ", "وَأَدْخَلْنَاهُ فِي رَحْمَتِنَا إِنَّهُ مِنَ الصَّالِحِينَ", "وَنُوحًا إِذْ نَادَى مِن قَبْلُ فَاسْتَجَبْنَا لَهُ فَنَجَّيْنَاهُ وَأَهْلَهُ مِنَ الْكَرْبِ الْعَظِيمِ", "وَنَصَرْنَاهُ مِنَ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِنَا إِنَّهُمْ كَانُوا قَوْمَ سَوْءٍ فَأَغْرَقْنَاهُمْ أَجْمَعِينَ", "وَدَاوُودَ وَسُلَيْمَانَ إِذْ يَحْكُمَانِ فِي الْحَرْثِ إِذْ نَفَشَتْ فِيهِ غَنَمُ الْقَوْمِ وَكُنَّا لِحُكْمِهِمْ شَاهِدِينَ", "فَفَهَّمْنَاهَا سُلَيْمَانَ وَكُلًّا آتَيْنَا حُكْمًا وَعِلْمًا وَسَخَّرْنَا مَعَ دَاوُودَ الْجِبَالَ يُسَبِّحْنَ وَالطَّيْرَ وَكُنَّا فَاعِلِينَ", "وَعَلَّمْنَاهُ صَنْعَةَ لَبُوسٍ لَّكُمْ لِتُحْصِنَكُم مِّن بَأْسِكُمْ فَهَلْ أَنتُمْ شَاكِرُونَ", "وَلِسُلَيْمَانَ الرِّيحَ عَاصِفَةً تَجْرِي بِأَمْرِهِ إِلَى الْأَرْضِ الَّتِي بَارَكْنَا فِيهَا وَكُنَّا بِكُلِّ شَيْءٍ عَالِمِينَ", "وَمِنَ الشَّيَاطِينِ مَن يَغُوصُونَ لَهُ وَيَعْمَلُونَ عَمَلًا دُونَ ذَلِكَ وَكُنَّا لَهُمْ حَافِظِينَ", "وَأَيُّوبَ إِذْ نَادَى رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ", "فَاسْتَجَبْنَا لَهُ فَكَشَفْنَا مَا بِهِ مِن ضُرٍّ وَآتَيْنَاهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنْ عِندِنَا وَذِكْرَى لِلْعَابِدِينَ", "وَإِسْمَاعِيلَ وَإِدْرِيسَ وَذَا الْكِفْلِ كُلٌّ مِّنَ الصَّابِرِينَ", "وَأَدْخَلْنَاهُمْ فِي رَحْمَتِنَا إِنَّهُم مِّنَ الصَّالِحِينَ", "وَذَا النُّونِ إِذ ذَّهَبَ مُغَاضِبًا فَظَنَّ أَن لَّن نَّقْدِرَ عَلَيْهِ فَنَادَى فِي الظُّلُمَاتِ أَن لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ", "فَاسْتَجَبْنَا لَهُ وَنَجَّيْنَاهُ مِنَ الْغَمِّ وَكَذَلِكَ نُنجِي الْمُؤْمِنِينَ", "وَزَكَرِيَّا إِذْ نَادَى رَبَّهُ رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ", "فَاسْتَجَبْنَا لَهُ وَوَهَبْنَا لَهُ يَحْيَى وَأَصْلَحْنَا لَهُ زَوْجَهُ إِنَّهُمْ كَانُوا يُسَارِعُونَ فِي الْخَيْرَاتِ وَيَدْعُونَنَا رَغَبًا وَرَهَبًا وَكَانُوا لَنَا خَاشِعِينَ", "وَالَّتِي أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهَا مِن رُّوحِنَا وَجَعَلْنَاهَا وَابْنَهَا آيَةً لِّلْعَالَمِينَ", "إِنَّ هَذِهِ أُمَّتُكُمْ أُمَّةً وَاحِدَةً وَأَنَا رَبُّكُمْ فَاعْبُدُونِ", "وَتَقَطَّعُوا أَمْرَهُم بَيْنَهُمْ كُلٌّ إِلَيْنَا رَاجِعُونَ", "فَمَن يَعْمَلْ مِنَ الصَّالِحَاتِ وَهُوَ مُؤْمِنٌ فَلَا كُفْرَانَ لِسَعْيِهِ وَإِنَّا لَهُ كَاتِبُونَ", "وَحَرَامٌ عَلَى قَرْيَةٍ أَهْلَكْنَاهَا أَنَّهُمْ لَا يَرْجِعُونَ", "حَتَّى إِذَا فُتِحَتْ يَأْجُوجُ وَمَأْجُوجُ وَهُم مِّن كُلِّ حَدَبٍ يَنسِلُونَ", "وَاقْتَرَبَ الْوَعْدُ الْحَقُّ فَإِذَا هِيَ شَاخِصَةٌ أَبْصَارُ الَّذِينَ كَفَرُوا يَا وَيْلَنَا قَدْ كُنَّا فِي غَفْلَةٍ مِّنْ هَذَا بَلْ كُنَّا ظَالِمِينَ", "إِنَّكُمْ وَمَا تَعْبُدُونَ مِن دُونِ اللَّهِ حَصَبُ جَهَنَّمَ أَنتُمْ لَهَا وَارِدُونَ", "لَوْ كَانَ هَؤُلَاء آلِهَةً مَّا وَرَدُوهَا وَكُلٌّ فِيهَا خَالِدُونَ", "لَهُمْ فِيهَا زَفِيرٌ وَهُمْ فِيهَا لَا يَسْمَعُونَ", "إِنَّ الَّذِينَ سَبَقَتْ لَهُم مِّنَّا الْحُسْنَى أُوْلَئِكَ عَنْهَا مُبْعَدُونَ", "لَا يَسْمَعُونَ حَسِيسَهَا وَهُمْ فِي مَا اشْتَهَتْ أَنفُسُهُمْ خَالِدُونَ", "لَا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ وَتَتَلَقَّاهُمُ الْمَلَائِكَةُ هَذَا يَوْمُكُمُ الَّذِي كُنتُمْ تُوعَدُونَ", "يَوْمَ نَطْوِي السَّمَاء كَطَيِّ السِّجِلِّ لِلْكُتُبِ كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُّعِيدُهُ وَعْدًا عَلَيْنَا إِنَّا كُنَّا فَاعِلِينَ", "وَلَقَدْ كَتَبْنَا فِي الزَّبُورِ مِن بَعْدِ الذِّكْرِ أَنَّ الْأَرْضَ يَرِثُهَا عِبَادِيَ الصَّالِحُونَ", "إِنَّ فِي هَذَا لَبَلَاغًا لِّقَوْمٍ عَابِدِينَ", "وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِّلْعَالَمِينَ", "قُلْ إِنَّمَا يُوحَى إِلَيَّ أَنَّمَا إِلَهُكُمْ إِلَهٌ وَاحِدٌ فَهَلْ أَنتُم مُّسْلِمُونَ", "فَإِن تَوَلَّوْا فَقُلْ آذَنتُكُمْ عَلَى سَوَاء وَإِنْ أَدْرِي أَقَرِيبٌ أَم بَعِيدٌ مَّا تُوعَدُونَ", "إِنَّهُ يَعْلَمُ الْجَهْرَ مِنَ الْقَوْلِ وَيَعْلَمُ مَا تَكْتُمُونَ", "وَإِنْ أَدْرِي لَعَلَّهُ فِتْنَةٌ لَّكُمْ وَمَتَاعٌ إِلَى حِينٍ", "قَالَ رَبِّ احْكُم بِالْحَقِّ وَرَبُّنَا الرَّحْمَنُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ"], "name_en": "Al-'Anbya'", "ayahs_en": ["Draws near for mankind their reckoning, while they turn away in heedlessness.", "Comes not unto them an admonition (a  chapter of the Qur’ân) from their Lord as a recent revelation but they  listen to it while they play,", "With their hearts occupied (with evil  things) those who do wrong, conceal their private counsels, (saying):  ”Is this (Muhammad SAW) more than a human being like you? Will you  submit to magic while you see it?”", "He (Muhammad SAW) said: ”My Lord knows  (every) word (spoken) in the heavens and on earth. And He is the  All-Hearer, the All-Knower.”", "Nay, they say:”These (revelations of the  Qur’ân which are inspired to Muhammad SAW) are mixed up false dreams!  Nay, he has invented it! Nay, he is a poet! Let him then bring us an  Ayâh (sign as a proof) like the ones (Prophets) that were sent before  (with signs)!”", "Not one of the towns (populations), of  those which We destroyed, believed before them (though We sent them  signs), will they then believe?", "And We sent not before you (O Muhammad  SAW) but men to whom We inspired, so ask the people of the Reminder  [Scriptures - the Taurât (Torah), the Injeel (Gospel)] if you do not  know.", "And We did not create them (the Messengers, with) bodies that ate not food, nor were they immortals,", "Then We fulfilled to them the promise,  and We saved them and those whom We willed, but We destroyed  Al-Musrifûn (i.e. extravagants in oppression, polytheism and in sin).", "Indeed, We have sent down for you (O  mankind) a Book, (the Qur’ân) in which there is Dhikrukum, (your  Reminder or an honour for you i.e. honour for the one who follows the  teaching of the Qur’ân and acts on its orders). Will you not then  understand?", "How many a town (community), that were wrong-doers, have We destroyed, and raised up after them another people!", "Then, when they perceived (saw) Our Torment (coming), behold, they (tried to) flee from it.", "Flee not, but return to that wherein you lived a luxurious life, and to your homes, in order that you may be questioned.", "They cried: ”Woe to us! Certainly! We  have been Zâlimûn (polytheists, wrong-doers and disbelievers in the  Oneness of Allâh, etc.).”", "And that cry of theirs ceased not, till We made them as a field that is reaped, extinct (dead).", "We created not the heavens and the earth and all that is between them for a (mere) play .", "Had We intended to take a pastime (i.e.  a wife or a son, etc.), We could surely have taken it from Us, if We  were going to do (that).", "Nay, We fling (send down) the truth  (this Qur’ân) against the falsehood (disbelief), so it destroys it, and  behold, it (falsehood) is vanished. And woe to you for that (lie) which  you ascribe (to Us) (against Allâh by uttering that Allâh has a wife  and a son).", "To Him belongs whosoever is in the  heavens and on earth. And those who are near Him (i.e. the angels) are  not too proud to worship Him, nor are they weary (of His worship).", "They (i.e. the angels) glorify His Praises night and day, (and) they never slacken (to do so).", "Or have they taken (for worship) âliha (gods) from the earth who raise the dead?", "Had there been therein (in the heavens  and the earth) gods besides Allâh, then verily both would have been  ruined. Glorified be Allâh, the Lord of the Throne, (High is He) above  what they attribute to Him!", "He cannot be questioned as to what He does, while they will be questioned.", "Or have they taken for worship (other)  âliha (gods) besides Him? Say: ”Bring your proof:” This (the Qur’ân) is  the Reminder for those with me and the Reminder for those before me.  But most of them know not the Truth, so they are averse.", "And We did not send any Messenger before  you (O Muhammad SAW) but We inspired him (saying): Lâ ilâha illa Ana  [none has the right to be worshipped but I (Allâh)], so worship Me  (Alone and none else).”", "And they say: ”The Most Beneficent  (Allâh) has begotten a son (or children).” Glory to Him! They [those  whom they call children of Allâh i.e. the angels, ’Iesa (Jesus) son of  Maryam (Mary), ’Uzair (Ezra), etc.], are but honoured slaves.", "They speak not until He has spoken, and they act on His Command.", "He knows what is before them, and what  is behind them, and they cannot intercede except for him with whom He  is pleased. And they stand in awe for fear of Him.", "And if any of them should say: ”Verily,  I am an ilâh (a god) besides Him (Allâh),” such a one We should  recompense with Hell. Thus We recompense the Zâlimûn (polytheists and  wrong-doers, etc.).", "Have not those who disbelieve known that  the heavens and the earth were joined together as one united piece,  then We parted them? And We have made from water every living thing.  Will they not then believe?", "And We have placed on the earth firm  mountains, lest it should shake with them, and We placed therein broad  highways for them to pass through, that they may be guided.", "And We have made the heaven a roof, safe  and well guarded. Yet they turn away from its signs (i.e. sun, moon,  winds, clouds, etc.).", "And He it is Who has created the night and the day, and the sun and the moon, each in an orbit floating.", "And We granted not to any human being immortality before you (O Muhammad SAW), then if you die, would they live forever?", "Everyone is going to taste death, and We shall make a trial of you with evil and with good, and to Us you will be returned.", "And when those who disbelieve (in the  Oneness of Allâh) see you (O Muhammad SAW), they take you not except  for mockery (saying): ”Is this the one who talks (badly) about your  gods?” While they disbelieve at the mention of the Most Beneficent  (Allâh). [Tafsir. Al-Qurtubî].", "Man is created of haste, I will show you  My Ayât (torments, proofs, evidences, verses, lessons, signs,  revelations, etc.).So ask Me not to hasten (them).", "And they say: ”When will this promise (come to pass), if you are truthful.”", "If only those who disbelieved knew (the  time) when they will not be able to ward off the Fire from their faces,  nor from their backs; and they will not be helped.", "Nay, it (the Fire or the Day of  Resurrection) will come upon them all of a sudden and will perplex  them, and they will have no power to avert it, nor will they get  respite.", "Indeed (many) Messengers were mocked  before you (O Muhammad SAW), but the scoffers were surrounded by that,  whereat they used to mock.", "Say: ”Who can guard and protect you in  the night or in the day from the (punishment of the) Most Beneficent  (Allâh)?” Nay, but they turn away from the remembrance of their Lord.", "Or have they âliha (gods) who can guard  them from Us? They have no power to help themselves, nor can they be  protected from Us (i.e. from Our Torment).", "Nay, We gave the luxuries of this life  to these men and their fathers until the period grew long for them. See  they not that We gradually reduce the land (in their control) from its  outlying borders? Is it then they who will overcome.", "Say (O Muhammad SAW): ”I warn you only  by the revelation (from Allâh and not by the opinion of the religious  scholars and others). But the deaf (who follow the religious scholars  and others blindly) will not hear the call, (even) when they are warned  [(i.e. one should follow only the Qur’ân and the Sunnah (legal ways,  orders, acts of worship, statements of Prophet Muhammad SAW , as the  Companions of the Prophet SAW did)].", "And if a breath (minor calamity) of the  Torment of your Lord touches them, they will surely cry: ”Woe unto us!  Indeed we have been Zâlimûn (polytheists and wrong-doers, etc.).", "And We shall set up balances of justice  on the Day of Resurrection, then none will be dealt with unjustly in  anything. And if there be the weight of a mustard seed, We will bring  it. And Sufficient are We as Reckoners.", "And indeed We granted to Mûsa (Moses)  and Hârûn (Aaron) the criterion (of right and wrong), and a shining  light [i.e. the Taurât (Torah)] and a Reminder for Al-Muttaqûn (the  pious - see V.2:2).", "Those who fear their Lord without seeing Him, while they are afraid of the Hour.", "And this is a blessed Reminder (the Qur’ân) which We have sent down, will you then (dare to) deny it?", "And indeed We bestowed aforetime on  Ibrâhim (Abraham) his (portion of) guidance, and We were  Well-Acquainted with him (as to his Belief in the Oneness of Allâh,  etc.).", "When he said to his father and his people: ”What are these images, to which you are devoted?”", "They said:”We found our fathers worshipping them.”", "He said: ”Indeed you and your fathers have been in manifest error.”", "They said: ”Have you brought us the truth, or are you one of those who play about?”", "He said: ”Nay, your Lord is the Lord of the heavens and the earth, Who created them and of that I am one of the witnesses.", "”And by Allâh, I shall plot a plan (to destroy) your idols after you have gone away and turned your backs.”", "So he broke them to pieces, (all) except the biggest of them, that they might turn to it.", "They said: ”Who has done this to our âliha (gods)? He must indeed be one of the wrong-doers.”", "They said: ”We heard a young man talking (against) them who is called Ibrâhim (Abraham).”", "They said: ”Then bring him before the eyes of the people, that they may testify.”", "They said: ”Are you the one who has done this to our gods, O Ibrâhim (Abraham)?”", "[Ibrâhim (Abraham)] said: ”Nay, this one, the biggest of them (idols) did it. Ask them, if they can speak!”", "So they turned to themselves and said: ”Verily, you are the Zâlimûn (polytheists and wrong-doers).”", "Then they turned to themselves (their  first thought and said): ”Indeed you [Ibrâhim (Abraham)] know well that  these (idols) speak not!”", "[Ibrâhim (Abraham)] said: ”Do you then worship besides Allâh, things that can neither profit you, nor harm you?", "”Fie upon you, and upon that which you worship besides Allâh! Have you then no sense?”", "They said: ”Burn him and help your âliha (gods), if you will be doing.”", "We (Allâh) said: ”O fire! Be you coolness and safety for Ibrâhim (Abraham)!”", "And they wanted to harm him, but We made them the worst losers.", "And We rescued him and Lout (Lot) to the land which We have blessed for the ’Alamîn (mankind and jinns).", "And We bestowed upon him Ishâque (Isaac), and (a grandson) Ya’qûb (Jacob). Each one We made righteous.", "And We made them leaders, guiding  (mankind) by Our Command, and We inspired in them the doing of good  deeds, performing Salât (Iqâmat-as-Salât), and the giving of Zakât and  of Us (Alone) they were worshippers.", "And (remember) Lout (Lot), We gave him  Hukman (right judgement of the affairs and Prophethood) and (religious)  knowledge, and We saved him from the town (folk) who practised  Al-Khabâ’ith (evil, wicked and filthy deeds, etc.). Verily, they were a  people given to evil, and were Fâsiqûn (rebellious, disobedient, to  Allâh).", "And We admitted him to Our Mercy, truly, he was of the righteous.", "And (remember) Nûh (Noah), when he cried  (to Us) aforetime. We listened to his invocation and saved him and his  family from great distress.", "We helped him against people who denied  Our Ayât (proofs, evidences, verses, lessons, signs, revelations,  etc.). Verily, they were a people given to evil. So We drowned them all.", "And (remember) Dawûd (David) and  Sulaimân (Solomon), when they gave judgement in the case of the field  in which the sheep of certain people had pastured at night and We were  witness to their judgement.", "And We made Sulaimân (Solomon) to  understand (the case), and to each of them We gave Hukman (right  judgement of the affairs and Prophethood) and knowledge. And We  subjected the mountains and the birds to glorify Our Praises along with  Dawûd (David), And it was We Who were the doers (of all these things).", "And We taught him the making of metal coats of mail (for battles), to protect you in your fighting. Are you then grateful?", "And to Sulaimân (Solomon) (We subjected)  the wind strongly raging, running by his command towards the land which  We had blessed. And of everything We are the All-Knower.", "And of the Shayâtin (devils) (from the  jinns) were some who dived for him, and did other work besides that;  and it was We Who guarded them.", "And (remember) Ayûb (Job), when he cried  to his Lord: ”Verily, distress has seized me, and You are the Most  Merciful of all those who show mercy.”", "So We answered his call, and We removed  the distress that was on him, and We restored his family to him (that  he had lost), and the like thereof along with them, as a mercy from  Ourselves and a Reminder for all who worship Us.", "And (remember) Isma’îl (Ishmael), and  Idris (Enoch) and Dhul-Kifl (Isaiah), all were from among As-Sâbirin  (the patient ones, etc.).", "And We admitted them to Our Mercy. Verily, they were of the righteous.", "And (remember) Dhan-Nûn (Jonah), when he  went off in anger, and imagined that We shall not punish him (i.e. the  calamites which had befallen him)! But he cried through the darkness  (saying): Lâ ilâha illa Anta [none has the right to be worshipped but  You (O Allâh)], Glorified (and Exalted) are You [above all that (evil)  they associate with You]. Truly, I have been of the wrong-doers.”", "So We answered his call, and delivered  him from the distress. And thus We do deliver the believers (who  believe in the Oneness of Allâh, abstain from evil and work  righteousness).", "And (remember) Zakariya (Zachariah),  when he cried to his Lord: ”O My Lord! Leave me not single (childless),  though You are the Best of the inheritors.”", "So We answered his call, and We bestowed  upon him Yahya (John), and cured his wife (to bear a child) for him.  Verily, they used to hasten on to do good deeds, and they used to call  on Us with hope and fear, and used to humble themselves before Us.", "And (remember) she who guarded her  chastity [Virgin Maryam (Mary)], We breathed into (the sleeves of) her  (shirt or garment) [through Our Rûh ­ Jibrael (Gabriel)], and We made  her and her son [’Iesa (Jesus)] a sign for Al-’Alamin (the mankind and  jinns).", "Truly! This, your Ummah [Sharia or  religion (Islâmic Monotheism)] is one religion, and I am your Lord,  therefore worship Me (Alone). [Tafsîr Ibn Kathîr]", "But they have broken up and differed as regards their religion among themselves. (And) they all shall return to Us.", "So whoever does righteous good deeds  while he is a believer (in the Oneness of Allâh Islâmic Monotheism),  his efforts will not be rejected. Verily! We record it in his Book of  deeds.", "And a ban is laid on every town  (population) which We have destroyed that they shall not return (to  this world again, nor repent to Us).", "Until, when Ya’jûj and Ma’jûj (Gog and Magog) are let loose (from their barrier), and they swiftly swarm from every mound.", "And the true promise (Day of  Resurrection) shall draw near (of fulfillment). Then (when mankind is  resurrected from their graves), you shall see the eyes of the  disbelievers fixedly stare in horror. (They will say): ”Woe to us! We  were indeed heedless of this; nay, but we were Zâlimûn (polytheists and  wrong-doers, etc.).”", "Certainly! You (disbelievers) and that  which you are worshipping now besides Allâh, are (but) fuel for Hell!  (Surely), you will enter it.", "Had these (idols, etc.) been âliha (gods), they would not have entered there (Hell), and all of them will abide therein.", "Therein breathing out with deep sighs and roaring will be their portion, and therein they will hear not.", "Verily those for whom the good has  preceded from Us, they will be removed far therefrom (Hell) [e.g. ’Iesa  (Jesus), son of Maryam (Mary); ’Uzair (Ezra), etc.].", "They shall not hear the slightest sound of it (Hell), while they abide in that which their ownselves desire.", "The greatest terror (on the Day of  Resurrection) will not grieve them, and the angels will meet them,  (with the greeting): ”This is your Day which you were promised.”", "And (remember) the Day when We shall  roll up the heavens like a scroll rolled up for books, as We began the  first creation, We shall repeat it, (it is) a promise binding upon Us.  Truly, We shall do it.", "And indeed We have written in Zabûr  (Psalms) [i.e. all the revealed Holy Books the Taurât (Torah), the  Injeel (Gospel), the Qur’ân] after (We have already written in) Al-Lauh  Al-Mahfûz (the Book, that is in the heaven with Allâh), that My  righteous slaves shall inherit the land (i.e. the land of Paradise).", "Verily, in this (the Qur’ân) there is a  plain Message for people who worship Allâh (i.e. the true, real  believers of Islâmic Monotheism who act practically on the Qur’ân and  the Sunnah legal ways of the Prophet SAW).", "And We have sent you (O Muhammad SAW) not but as a mercy for the ’Alamîn (mankind, jinns and all that exists).", "Say (O Muhammad SAW): ”It is revealed to  me that your Ilâh (God) is only one Ilâh (God - Allâh). Will you then  submit to His Will (become Muslims and stop worshipping others besides  Allâh)?”", "But if they (disbelievers, idolaters,  Jews, Christians, polytheists, etc.) turn away (from Islâmic  Monotheism) say (to them O Muhammad SAW): ”I give you a notice (of war  as) to be known to us all alike. And I know not whether that which you  are promised (i.e. the torment or the Day of Resurrection) is near or  far.”", "(Say O Muhammad SAW) Verily, He (Allâh) knows that which is spoken aloud (openly) and that which you conceal.", "And I know not, perhaps it may be a trial for you, and an enjoyment for a while.", "He (Muhammad SAW) said:”My Lord! Judge  You in truth! Our Lord is the Most Beneficent, Whose Help is to be  sought against that which you attribute (unto Allâh that He has  offspring, and unto Muhammad SAW that he is a sorcerer, and unto the  Qur’ân that it is poetry, etc.)!”"]}