{"name_ar": "سورة النور", "ayahs_ar": ["سُورَةٌ أَنزَلْنَاهَا وَفَرَضْنَاهَا وَأَنزَلْنَا فِيهَا آيَاتٍ بَيِّنَاتٍ لَّعَلَّكُمْ تَذَكَّرُونَ", "الزَّانِيَةُ وَالزَّانِي فَاجْلِدُوا كُلَّ وَاحِدٍ مِّنْهُمَا مِئَةَ جَلْدَةٍ وَلَا تَأْخُذْكُم بِهِمَا رَأْفَةٌ فِي دِينِ اللَّهِ إِن كُنتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَلْيَشْهَدْ عَذَابَهُمَا طَائِفَةٌ مِّنَ الْمُؤْمِنِينَ", "الزَّانِي لَا يَنكِحُ إلَّا زَانِيَةً أَوْ مُشْرِكَةً وَالزَّانِيَةُ لَا يَنكِحُهَا إِلَّا زَانٍ أَوْ مُشْرِكٌ وَحُرِّمَ ذَلِكَ عَلَى الْمُؤْمِنِينَ", "وَالَّذِينَ يَرْمُونَ الْمُحْصَنَاتِ ثُمَّ لَمْ يَأْتُوا بِأَرْبَعَةِ شُهَدَاء فَاجْلِدُوهُمْ ثَمَانِينَ جَلْدَةً وَلَا تَقْبَلُوا لَهُمْ شَهَادَةً أَبَدًا وَأُوْلَئِكَ هُمُ الْفَاسِقُونَ", "إِلَّا الَّذِينَ تَابُوا مِن بَعْدِ ذَلِكَ وَأَصْلَحُوا فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ وَلَمْ يَكُن لَّهُمْ شُهَدَاء إِلَّا أَنفُسُهُمْ فَشَهَادَةُ أَحَدِهِمْ أَرْبَعُ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الصَّادِقِينَ", "وَالْخَامِسَةُ أَنَّ لَعْنَتَ اللَّهِ عَلَيْهِ إِن كَانَ مِنَ الْكَاذِبِينَ وَيَدْرَأُ", "عَنْهَا الْعَذَابَ أَنْ تَشْهَدَ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الْكَاذِبِينَ", "وَالْخَامِسَةَ أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِن كَانَ مِنَ الصَّادِقِينَ", "وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ وَأَنَّ اللَّهَ تَوَّابٌ حَكِيمٌ", "إِنَّ الَّذِينَ جَاؤُوا بِالْإِفْكِ عُصْبَةٌ مِّنكُمْ لَا تَحْسَبُوهُ شَرًّا لَّكُم بَلْ هُوَ خَيْرٌ لَّكُمْ لِكُلِّ امْرِئٍ مِّنْهُم مَّا اكْتَسَبَ مِنَ الْإِثْمِ وَالَّذِي تَوَلَّى كِبْرَهُ مِنْهُمْ لَهُ عَذَابٌ عَظِيمٌ", "لَوْلَا إِذْ سَمِعْتُمُوهُ ظَنَّ الْمُؤْمِنُونَ وَالْمُؤْمِنَاتُ بِأَنفُسِهِمْ خَيْرًا وَقَالُوا هَذَا إِفْكٌ مُّبِينٌ", "لَوْلَا جَاؤُوا عَلَيْهِ بِأَرْبَعَةِ شُهَدَاء فَإِذْ لَمْ يَأْتُوا بِالشُّهَدَاء فَأُوْلَئِكَ عِندَ اللَّهِ هُمُ الْكَاذِبُونَ", "وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ فِي الدُّنْيَا وَالْآخِرَةِ لَمَسَّكُمْ فِي مَا أَفَضْتُمْ فِيهِ عَذَابٌ عَظِيمٌ", "إِذْ تَلَقَّوْنَهُ بِأَلْسِنَتِكُمْ وَتَقُولُونَ بِأَفْوَاهِكُم مَّا لَيْسَ لَكُم بِهِ عِلْمٌ وَتَحْسَبُونَهُ هَيِّنًا وَهُوَ عِندَ اللَّهِ عَظِيمٌ", "وَلَوْلَا إِذْ سَمِعْتُمُوهُ قُلْتُم مَّا يَكُونُ لَنَا أَن نَّتَكَلَّمَ بِهَذَا سُبْحَانَكَ هَذَا بُهْتَانٌ عَظِيمٌ", "يَعِظُكُمُ اللَّهُ أَن تَعُودُوا لِمِثْلِهِ أَبَدًا إِن كُنتُم مُّؤْمِنِينَ", "وَيُبَيِّنُ اللَّهُ لَكُمُ الْآيَاتِ وَاللَّهُ عَلِيمٌ حَكِيمٌ", "إِنَّ الَّذِينَ يُحِبُّونَ أَن تَشِيعَ الْفَاحِشَةُ فِي الَّذِينَ آمَنُوا لَهُمْ عَذَابٌ أَلِيمٌ فِي الدُّنْيَا وَالْآخِرَةِ وَاللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ", "وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ وَأَنَّ اللَّه رَؤُوفٌ رَحِيمٌ", "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ وَمَن يَتَّبِعْ خُطُوَاتِ الشَّيْطَانِ فَإِنَّهُ يَأْمُرُ بِالْفَحْشَاء وَالْمُنكَرِ وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ مَا زَكَا مِنكُم مِّنْ أَحَدٍ أَبَدًا وَلَكِنَّ اللَّهَ يُزَكِّي مَن يَشَاء وَاللَّهُ سَمِيعٌ عَلِيمٌ", "وَلَا يَأْتَلِ أُوْلُوا الْفَضْلِ مِنكُمْ وَالسَّعَةِ أَن يُؤْتُوا أُوْلِي الْقُرْبَى وَالْمَسَاكِينَ وَالْمُهَاجِرِينَ فِي سَبِيلِ اللَّهِ وَلْيَعْفُوا وَلْيَصْفَحُوا أَلَا تُحِبُّونَ أَن يَغْفِرَ اللَّهُ لَكُمْ وَاللَّهُ غَفُورٌ رَّحِيمٌ", "إِنَّ الَّذِينَ يَرْمُونَ الْمُحْصَنَاتِ الْغَافِلَاتِ الْمُؤْمِنَاتِ لُعِنُوا فِي الدُّنْيَا وَالْآخِرَةِ وَلَهُمْ عَذَابٌ عَظِيمٌ", "يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُم بِمَا كَانُوا يَعْمَلُونَ", "يَوْمَئِذٍ يُوَفِّيهِمُ اللَّهُ دِينَهُمُ الْحَقَّ وَيَعْلَمُونَ أَنَّ اللَّهَ هُوَ الْحَقُّ الْمُبِينُ", "الْخَبِيثَاتُ لِلْخَبِيثِينَ وَالْخَبِيثُونَ لِلْخَبِيثَاتِ وَالطَّيِّبَاتُ لِلطَّيِّبِينَ وَالطَّيِّبُونَ لِلطَّيِّبَاتِ أُوْلَئِكَ مُبَرَّؤُونَ مِمَّا يَقُولُونَ لَهُم مَّغْفِرَةٌ وَرِزْقٌ كَرِيمٌ", "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتًا غَيْرَ بُيُوتِكُمْ حَتَّى تَسْتَأْنِسُوا وَتُسَلِّمُوا عَلَى أَهْلِهَا ذَلِكُمْ خَيْرٌ لَّكُمْ لَعَلَّكُمْ تَذَكَّرُونَ", "فَإِن لَّمْ تَجِدُوا فِيهَا أَحَدًا فَلَا تَدْخُلُوهَا حَتَّى يُؤْذَنَ لَكُمْ وَإِن قِيلَ لَكُمُ ارْجِعُوا فَارْجِعُوا هُوَ أَزْكَى لَكُمْ وَاللَّهُ بِمَا تَعْمَلُونَ عَلِيمٌ", "لَّيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَدْخُلُوا بُيُوتًا غَيْرَ مَسْكُونَةٍ فِيهَا مَتَاعٌ لَّكُمْ وَاللَّهُ يَعْلَمُ مَا تُبْدُونَ وَمَا تَكْتُمُونَ", "قُل لِّلْمُؤْمِنِينَ يَغُضُّوا مِنْ أَبْصَارِهِمْ وَيَحْفَظُوا فُرُوجَهُمْ ذَلِكَ أَزْكَى لَهُمْ إِنَّ اللَّهَ خَبِيرٌ بِمَا يَصْنَعُونَ", "وَقُل لِّلْمُؤْمِنَاتِ يَغْضُضْنَ مِنْ أَبْصَارِهِنَّ وَيَحْفَظْنَ فُرُوجَهُنَّ وَلَا يُبْدِينَ زِينَتَهُنَّ إِلَّا مَا ظَهَرَ مِنْهَا وَلْيَضْرِبْنَ بِخُمُرِهِنَّ عَلَى جُيُوبِهِنَّ وَلَا يُبْدِينَ زِينَتَهُنَّ إِلَّا لِبُعُولَتِهِنَّ أَوْ آبَائِهِنَّ أَوْ آبَاء بُعُولَتِهِنَّ أَوْ أَبْنَائِهِنَّ أَوْ أَبْنَاء بُعُولَتِهِنَّ أَوْ إِخْوَانِهِنَّ أَوْ بَنِي إِخْوَانِهِنَّ أَوْ بَنِي أَخَوَاتِهِنَّ أَوْ نِسَائِهِنَّ أَوْ مَا مَلَكَتْ أَيْمَانُهُنَّ أَوِ التَّابِعِينَ غَيْرِ أُوْلِي الْإِرْبَةِ مِنَ الرِّجَالِ أَوِ الطِّفْلِ الَّذِينَ لَمْ يَظْهَرُوا عَلَى عَوْرَاتِ النِّسَاء وَلَا يَضْرِبْنَ بِأَرْجُلِهِنَّ لِيُعْلَمَ مَا يُخْفِينَ مِن زِينَتِهِنَّ وَتُوبُوا إِلَى اللَّهِ جَمِيعًا أَيُّهَا الْمُؤْمِنُونَ لَعَلَّكُمْ تُفْلِحُونَ", "وَأَنكِحُوا الْأَيَامَى مِنكُمْ وَالصَّالِحِينَ مِنْ عِبَادِكُمْ وَإِمَائِكُمْ إِن يَكُونُوا فُقَرَاء يُغْنِهِمُ اللَّهُ مِن فَضْلِهِ وَاللَّهُ وَاسِعٌ عَلِيمٌ", "وَلْيَسْتَعْفِفِ الَّذِينَ لَا يَجِدُونَ نِكَاحًا حَتَّى يُغْنِيَهُمْ اللَّهُ مِن فَضْلِهِ وَالَّذِينَ يَبْتَغُونَ الْكِتَابَ مِمَّا مَلَكَتْ أَيْمَانُكُمْ فَكَاتِبُوهُمْ إِنْ عَلِمْتُمْ فِيهِمْ خَيْرًا وَآتُوهُم مِّن مَّالِ اللَّهِ الَّذِي آتَاكُمْ وَلَا تُكْرِهُوا فَتَيَاتِكُمْ عَلَى الْبِغَاء إِنْ أَرَدْنَ تَحَصُّنًا لِّتَبْتَغُوا عَرَضَ الْحَيَاةِ الدُّنْيَا وَمَن يُكْرِههُّنَّ فَإِنَّ اللَّهَ مِن بَعْدِ إِكْرَاهِهِنَّ غَفُورٌ رَّحِيمٌ", "وَلَقَدْ أَنزَلْنَا إِلَيْكُمْ آيَاتٍ مُّبَيِّنَاتٍ وَمَثَلًا مِّنَ الَّذِينَ خَلَوْا مِن قَبْلِكُمْ وَمَوْعِظَةً لِّلْمُتَّقِينَ", "اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ مَثَلُ نُورِهِ كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ الْمِصْبَاحُ فِي زُجَاجَةٍ الزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ يُوقَدُ مِن شَجَرَةٍ مُّبَارَكَةٍ زَيْتُونِةٍ لَّا شَرْقِيَّةٍ وَلَا غَرْبِيَّةٍ يَكَادُ زَيْتُهَا يُضِيءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ نُّورٌ عَلَى نُورٍ يَهْدِي اللَّهُ لِنُورِهِ مَن يَشَاء وَيَضْرِبُ اللَّهُ الْأَمْثَالَ لِلنَّاسِ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ", "فِي بُيُوتٍ أَذِنَ اللَّهُ أَن تُرْفَعَ وَيُذْكَرَ فِيهَا اسْمُهُ يُسَبِّحُ لَهُ فِيهَا بِالْغُدُوِّ وَالْآصَالِ", "رِجَالٌ لَّا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَن ذِكْرِ اللَّهِ وَإِقَامِ الصَّلَاةِ وَإِيتَاء الزَّكَاةِ يَخَافُونَ يَوْمًا تَتَقَلَّبُ فِيهِ الْقُلُوبُ وَالْأَبْصَارُ", "لِيَجْزِيَهُمُ اللَّهُ أَحْسَنَ مَا عَمِلُوا وَيَزِيدَهُم مِّن فَضْلِهِ وَاللَّهُ يَرْزُقُ مَن يَشَاء بِغَيْرِ حِسَابٍ", "وَالَّذِينَ كَفَرُوا أَعْمَالُهُمْ كَسَرَابٍ بِقِيعَةٍ يَحْسَبُهُ الظَّمْآنُ مَاء حَتَّى إِذَا جَاءهُ لَمْ يَجِدْهُ شَيْئًا وَوَجَدَ اللَّهَ عِندَهُ فَوَفَّاهُ حِسَابَهُ وَاللَّهُ سَرِيعُ الْحِسَابِ", "أَوْ كَظُلُمَاتٍ فِي بَحْرٍ لُّجِّيٍّ يَغْشَاهُ مَوْجٌ مِّن فَوْقِهِ مَوْجٌ مِّن فَوْقِهِ سَحَابٌ ظُلُمَاتٌ بَعْضُهَا فَوْقَ بَعْضٍ إِذَا أَخْرَجَ يَدَهُ لَمْ يَكَدْ يَرَاهَا وَمَن لَّمْ يَجْعَلِ اللَّهُ لَهُ نُورًا فَمَا لَهُ مِن نُّورٍ", "أَلَمْ تَرَ أَنَّ اللَّهَ يُسَبِّحُ لَهُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ وَالطَّيْرُ صَافَّاتٍ كُلٌّ قَدْ عَلِمَ صَلَاتَهُ وَتَسْبِيحَهُ وَاللَّهُ عَلِيمٌ بِمَا يَفْعَلُونَ", "وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَإِلَى اللَّهِ الْمَصِيرُ", "أَلَمْ تَرَ أَنَّ اللَّهَ يُزْجِي سَحَابًا ثُمَّ يُؤَلِّفُ بَيْنَهُ ثُمَّ يَجْعَلُهُ رُكَامًا فَتَرَى الْوَدْقَ يَخْرُجُ مِنْ خِلَالِهِ وَيُنَزِّلُ مِنَ السَّمَاء مِن جِبَالٍ فِيهَا مِن بَرَدٍ فَيُصِيبُ بِهِ مَن يَشَاء وَيَصْرِفُهُ عَن مَّن يَشَاء يَكَادُ سَنَا بَرْقِهِ يَذْهَبُ بِالْأَبْصَارِ", "يُقَلِّبُ اللَّهُ اللَّيْلَ وَالنَّهَارَ إِنَّ فِي ذَلِكَ لَعِبْرَةً لِّأُوْلِي الْأَبْصَارِ", "وَاللَّهُ خَلَقَ كُلَّ دَابَّةٍ مِن مَّاء فَمِنْهُم مَّن يَمْشِي عَلَى بَطْنِهِ وَمِنْهُم مَّن يَمْشِي عَلَى رِجْلَيْنِ وَمِنْهُم مَّن يَمْشِي عَلَى أَرْبَعٍ يَخْلُقُ اللَّهُ مَا يَشَاء إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ", "لَقَدْ أَنزَلْنَا آيَاتٍ مُّبَيِّنَاتٍ وَاللَّهُ يَهْدِي مَن يَشَاء إِلَى صِرَاطٍ مُّسْتَقِيمٍ", "وَيَقُولُونَ آمَنَّا بِاللَّهِ وَبِالرَّسُولِ وَأَطَعْنَا ثُمَّ يَتَوَلَّى فَرِيقٌ مِّنْهُم مِّن بَعْدِ ذَلِكَ وَمَا أُوْلَئِكَ بِالْمُؤْمِنِينَ", "وَإِذَا دُعُوا إِلَى اللَّهِ وَرَسُولِهِ لِيَحْكُمَ بَيْنَهُمْ إِذَا فَرِيقٌ مِّنْهُم مُّعْرِضُونَ", "وَإِن يَكُن لَّهُمُ الْحَقُّ يَأْتُوا إِلَيْهِ مُذْعِنِينَ", "أَفِي قُلُوبِهِم مَّرَضٌ أَمِ ارْتَابُوا أَمْ يَخَافُونَ أَن يَحِيفَ اللَّهُ عَلَيْهِمْ وَرَسُولُهُ بَلْ أُوْلَئِكَ هُمُ الظَّالِمُونَ", "إِنَّمَا كَانَ قَوْلَ الْمُؤْمِنِينَ إِذَا دُعُوا إِلَى اللَّهِ وَرَسُولِهِ لِيَحْكُمَ بَيْنَهُمْ أَن يَقُولُوا سَمِعْنَا وَأَطَعْنَا وَأُوْلَئِكَ هُمُ الْمُفْلِحُونَ", "وَمَن يُطِعِ اللَّهَ وَرَسُولَهُ وَيَخْشَ اللَّهَ وَيَتَّقْهِ فَأُوْلَئِكَ هُمُ الْفَائِزُونَ", "وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لَئِنْ أَمَرْتَهُمْ لَيَخْرُجُنَّ قُل لَّا تُقْسِمُوا طَاعَةٌ مَّعْرُوفَةٌ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ", "قُلْ أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ فَإِن تَوَلَّوا فَإِنَّمَا عَلَيْهِ مَا حُمِّلَ وَعَلَيْكُم مَّا حُمِّلْتُمْ وَإِن تُطِيعُوهُ تَهْتَدُوا وَمَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ الْمُبِينُ", "وَعَدَ اللَّهُ الَّذِينَ آمَنُوا مِنكُمْ وَعَمِلُوا الصَّالِحَاتِ لَيَسْتَخْلِفَنَّهُم فِي الْأَرْضِ كَمَا اسْتَخْلَفَ الَّذِينَ مِن قَبْلِهِمْ وَلَيُمَكِّنَنَّ لَهُمْ دِينَهُمُ الَّذِي ارْتَضَى لَهُمْ وَلَيُبَدِّلَنَّهُم مِّن بَعْدِ خَوْفِهِمْ أَمْنًا يَعْبُدُونَنِي لَا يُشْرِكُونَ بِي شَيْئًا وَمَن كَفَرَ بَعْدَ ذَلِكَ فَأُوْلَئِكَ هُمُ الْفَاسِقُونَ", "وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَطِيعُوا الرَّسُولَ لَعَلَّكُمْ تُرْحَمُونَ", "لَا تَحْسَبَنَّ الَّذِينَ كَفَرُوا مُعْجِزِينَ فِي الْأَرْضِ وَمَأْوَاهُمُ النَّارُ وَلَبِئْسَ الْمَصِيرُ", "يَا أَيُّهَا الَّذِينَ آمَنُوا لِيَسْتَأْذِنكُمُ الَّذِينَ مَلَكَتْ أَيْمَانُكُمْ وَالَّذِينَ لَمْ يَبْلُغُوا الْحُلُمَ مِنكُمْ ثَلَاثَ مَرَّاتٍ مِن قَبْلِ صَلَاةِ الْفَجْرِ وَحِينَ تَضَعُونَ ثِيَابَكُم مِّنَ الظَّهِيرَةِ وَمِن بَعْدِ صَلَاةِ الْعِشَاء ثَلَاثُ عَوْرَاتٍ لَّكُمْ لَيْسَ عَلَيْكُمْ وَلَا عَلَيْهِمْ جُنَاحٌ بَعْدَهُنَّ طَوَّافُونَ عَلَيْكُم بَعْضُكُمْ عَلَى بَعْضٍ كَذَلِكَ يُبَيِّنُ اللَّهُ لَكُمُ الْآيَاتِ وَاللَّهُ عَلِيمٌ حَكِيمٌ", "وَإِذَا بَلَغَ الْأَطْفَالُ مِنكُمُ الْحُلُمَ فَلْيَسْتَأْذِنُوا كَمَا اسْتَأْذَنَ الَّذِينَ مِن قَبْلِهِمْ كَذَلِكَ يُبَيِّنُ اللَّهُ لَكُمْ آيَاتِهِ وَاللَّهُ عَلِيمٌ حَكِيمٌ", "وَالْقَوَاعِدُ مِنَ النِّسَاء اللَّاتِي لَا يَرْجُونَ نِكَاحًا فَلَيْسَ عَلَيْهِنَّ جُنَاحٌ أَن يَضَعْنَ ثِيَابَهُنَّ غَيْرَ مُتَبَرِّجَاتٍ بِزِينَةٍ وَأَن يَسْتَعْفِفْنَ خَيْرٌ لَّهُنَّ وَاللَّهُ سَمِيعٌ عَلِيمٌ", "لَيْسَ عَلَى الْأَعْمَى حَرَجٌ وَلَا عَلَى الْأَعْرَجِ حَرَجٌ وَلَا عَلَى الْمَرِيضِ حَرَجٌ وَلَا عَلَى أَنفُسِكُمْ أَن تَأْكُلُوا مِن بُيُوتِكُمْ أَوْ بُيُوتِ آبَائِكُمْ أَوْ بُيُوتِ أُمَّهَاتِكُمْ أَوْ بُيُوتِ إِخْوَانِكُمْ أَوْ بُيُوتِ أَخَوَاتِكُمْ أَوْ بُيُوتِ أَعْمَامِكُمْ أَوْ بُيُوتِ عَمَّاتِكُمْ أَوْ بُيُوتِ أَخْوَالِكُمْ أَوْ بُيُوتِ خَالَاتِكُمْ أَوْ مَا مَلَكْتُم مَّفَاتِحَهُ أَوْ صَدِيقِكُمْ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَأْكُلُوا جَمِيعًا أَوْ أَشْتَاتًا فَإِذَا دَخَلْتُم بُيُوتًا فَسَلِّمُوا عَلَى أَنفُسِكُمْ تَحِيَّةً مِّنْ عِندِ اللَّهِ مُبَارَكَةً طَيِّبَةً كَذَلِكَ يُبَيِّنُ اللَّهُ لَكُمُ الْآيَاتِ لَعَلَّكُمْ تَعْقِلُون", "إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ آمَنُوا بِاللَّهِ وَرَسُولِهِ وَإِذَا كَانُوا مَعَهُ عَلَى أَمْرٍ جَامِعٍ لَمْ يَذْهَبُوا حَتَّى يَسْتَأْذِنُوهُ إِنَّ الَّذِينَ يَسْتَأْذِنُونَكَ أُوْلَئِكَ الَّذِينَ يُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ فَإِذَا اسْتَأْذَنُوكَ لِبَعْضِ شَأْنِهِمْ فَأْذَن لِّمَن شِئْتَ مِنْهُمْ وَاسْتَغْفِرْ لَهُمُ اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ", "لَا تَجْعَلُوا دُعَاء الرَّسُولِ بَيْنَكُمْ كَدُعَاء بَعْضِكُم بَعْضًا قَدْ يَعْلَمُ اللَّهُ الَّذِينَ يَتَسَلَّلُونَ مِنكُمْ لِوَاذًا فَلْيَحْذَرِ الَّذِينَ يُخَالِفُونَ عَنْ أَمْرِهِ أَن تُصِيبَهُمْ فِتْنَةٌ أَوْ يُصِيبَهُمْ عَذَابٌ أَلِيمٌ", "أَلَا إِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ قَدْ يَعْلَمُ مَا أَنتُمْ عَلَيْهِ وَيَوْمَ يُرْجَعُونَ إِلَيْهِ فَيُنَبِّئُهُم بِمَا عَمِلُوا وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ"], "name_en": "An-Nur", "ayahs_en": ["(This is) a Sûrah (chapter of the  Qur’ân) which We have sent down and which We have enjoined, (ordained  its legal laws) and in it We have revealed manifest Ayât (proofs,  evidences, verses, lessons, signs, revelations lawful and unlawful  things, and set boundries of Islâmic Religion), that you may remember.", "The woman and the man guilty of illegal  sexual intercourse, flog each of them with a hundred stripes. Let not  pity withhold you in their case, in a punishment prescribed by Allâh,  if you believe in Allâh and the Last Day. And let a party of the  believers witness their punishment. (This punishment is for unmarried  persons guilty of the above crime but if married persons commit it, the  punishment is to stone them to death, according to Allâh’s Law).", "The adulterer marries not but an  adulteress or a Mushrikah and the adulteress none marries her except an  adulterer or a Muskrik [and that means that the man who agrees to marry  (have a sexual relation with) a Mushrikah (female polytheist, pagan or  idolatress) or a prostitute, then surely he is either an adulterer, or  a Mushrik (polytheist, pagan or idolater, etc.) And the woman who  agrees to marry (have a sexual relation with) a Mushrik (polytheist,  pagan or idolater) or an adulterer, then she is either a prostitute or  a Mushrikah (female polytheist, pagan, or idolatress, etc.)]. Such a  thing is forbidden to the believers (of Islâmic Monotheism).", "And those who accuse chaste women, and  produce not four witnesses, flog them with eighty stripes, and reject  their testimony forever, they indeed are the Fâsiqûn (liars,  rebellious, disobedient to Allâh).", "Except those who repent thereafter and do righteous deeds, (for such) verily, Allâh is Oft-Forgiving, Most Merciful.", "And for those who accuse their wives,  but have no witnesses except themselves, let the testimony of one of  them be four testimonies (i.e. testifies four times) by Allâh that he  is one of those who speak the truth.", "And the fifth (testimony) (should be) the invoking of the Curse of Allâh on him if he be of those who tell a lie (against her).", "But it shall avert the punishment (of  stoning to death) from her, if she bears witness four times by Allâh,  that he (her husband) is telling a lie.", "And the fifth (testimony) should be that the Wrath of Allâh be upon her if he (her husband) speaks the truth.", "And had it not been for the Grace of  Allâh and His Mercy on you (He would have hastened the punishment upon  you)! And that Allâh is the One Who accepts repentance, the All-Wise.", "Verily! Those who brought forth the  slander (against ’Aishah ÑÖì Ç the wife of the Prophet SAW) are a group  among you. Consider it not a bad thing for you. Nay, it is good for  you. Unto every man among them will be paid that which he had earned of  the sin, and as for him among them who had the greater share therein,  his will be a great torment.", "Why then, did not the believers, men and  women, when you heard it (the slander) think good of their own people  and say: ”This (charge) is an obvious lie?”", "Why did they not produce four witnesses?  Since they (the slanderers) have not produced witnesses! Then with  Allâh they are the liars.", "Had it not been for the Grace of Allâh  and His Mercy unto you in this world and in the Hereafter, a great  torment would have touched you for that whereof you had spoken.", "When you were propagating it with your  tongues, and uttering with your mouths that whereof you had no  knowledge, you counted it a little thing, while with Allâh it was very  great.", "And why did you not, when you heard it,  say? ”It is not right for us to speak of this. Glory be to You (O  Allâh) this is a great lie.”", "Allâh forbids you from it and warns you not to repeat the like of it forever, if you are believers.", "And Allâh makes the Ayât (proofs,  evidences, verses, lessons, signs, revelations, etc.) plain to you, and  Allâh is All-Knowing, All-Wise.", "Verily, those who like that (the crime  of) illegal sexual intercourse should be propagated among those who  believe, they will have a painful torment in this world and in the  Hereafter. And Allâh knows and you know not.", "And had it not been for the Grace of  Allâh and His Mercy on you, (Allâh would have hastened the punishment  upon you). And that Allâh is full of kindness, Most Merciful.", "O you who believe! Follow not the  footsteps of Shaitân (Satan). And whosoever follows the footsteps of  Shaitân (Satan), then, verily he commands Al-Fahshâ’ [i.e. to commit  indecency (illegal sexual intercourse, etc.)], and Al-Munkar [disbelief  and polytheism (i.e. to do evil and wicked deeds; to speak or to do  what is forbidden in Islâm, etc.)]. And had it not been for the Grace  of Allâh and His Mercy on you, not one of you would ever have been pure  from sins. But Allâh purifies (guides to Islâm) whom He wills, and  Allâh is All-Hearer, All-Knower.", "And let not those among you who are  blessed with graces and wealth swear not to give (any sort of help) to  their kinsmen, Al-Masâkîn (the poor), and those who left their homes  for Allâh’s Cause. Let them pardon and forgive. Do you not love that  Allâh should forgive you? And Allâh is Oft-Forgiving, Most Merciful.", "Verily, those who accuse chaste women,  who never even think of anything touching their chastity and are good  believers, are cursed in this life and in the Hereafter, and for them  will be a great torment,", "On the Day when their tongues, their hands, and their legs or feet will bear witness against them as to what they used to do.", "On that Day Allâh will pay them the recompense of their deeds in full, and they will know that Allâh, He is the Manifest Truth.", "Bad statements are for bad people (or  bad women for bad men) and bad people for bad statements (or bad men  for bad women). Good statements are for good people (or good women for  good men) and good people for good statements (or good men for good  women), such (good people) are innocent of (each and every) bad  statement which they say, for them is Forgiveness, and Rizqun Karîm  (generous provision i.e.Paradise).", "O you who believe! Enter not houses  other than your own, until you have asked permission and greeted those  in them, that is better for you, in order that you may remember.", "And if you find no one therein, still,  enter not until permission has been given. And if you are asked to go  back, go back, for it is purer for you, and Allâh is All-Knower of what  you do.", "There is no sin on you that you enter  (without taking permission) houses uninhabited (i.e. not possessed by  anybody), (when) you have any interest in them. And Allâh has knowledge  of what you reveal and what you conceal.", "Tell the believing men to lower their  gaze (from looking at forbidden things), and protect their private  parts (from illegal sexual acts, etc.). That is purer for them. Verily,  Allâh is All-Aware of what they do.", "And tell the believing women to lower  their gaze (from looking at forbidden things), and protect their  private parts (from illegal sexual acts, etc.) and not to show off  their adornment except only that which is apparent (like palms of hands  or one eye or both eyes for necessity to see the way, or outer dress  like veil, gloves, head-cover, apron, etc.), and to draw their veils  all over Juyubihinna (i.e. their bodies, faces, necks and bosoms, etc.)  and not to reveal their adornment except to their husbands, their  fathers, their husband’s fathers, their sons, their husband’s sons,  their brothers or their brother’s sons, or their sister’s sons, or  their (Muslim) women (i.e. their sisters in Islâm), or the (female)  slaves whom their right hands possess, or old male servants who lack  vigour, or small children who have no sense of the shame of sex. And  let them not stamp their feet so as to reveal what they hide of their  adornment. And all of you beg Allâh to forgive you all, O believers,  that you may be successful[].", "And marry those among you who are single  (i.e. a man who has no wife and the woman who has no husband) and (also  marry) the Sâlihûn (pious, fit and capable ones) of your (male) slaves  and maid-servants (female slaves). If they be poor, Allâh will enrich  them out of His Bounty. And Allâh is All-Sufficent for His creatures’  needs, All-Knowing (about the state of the people).", "And let those who find not the financial  means for marriage keep themselves chaste, until Allâh enriches them of  His Bounty. And such of your slaves as seek a writing (of  emancipation), give them such writing, if you know that they are good  and trustworthy. And give them something yourselves out of the wealth  of Allâh which He has bestowed upon you. And force not your maids to  prostitution, if they desire chastity, in order that you may make a  gain in the (perishable) goods of this worldly life. But if anyone  compels them (to prostitution), then after such compulsion, Allâh is  Oft-Forgiving, Most Merciful (to those women, i.e. He will forgive them  because they have been forced to do this evil action unwillingly).", "And indeed We have sent down for you  Ayât (proofs, evidences, verses, lessons, signs, revelations, etc.)  that make things plain, and the example of those who passed away before  you, and an admonition for those who are Al-Muttaqûn (the pious - see  V.2:2).", "Allâh is the Light of the heavens and  the earth. The parable of His Light is as (if there were) a niche and  within it a lamp, the lamp is in glass, the glass as it were a  brilliant star, lit from a blessed tree, an olive, neither of the east  (i.e. neither it gets sun-rays only in the morning) nor of the west  (i.e. nor it gets sun-rays only in the afternoon, but it is exposed to  the sun all day long), whose oil would almost glow forth (of itself),  though no fire touched it. Light upon Light! Allâh guides to His Light  whom He wills. And Allâh sets forth parables for mankind, and Allâh is  All-Knower of everything.", "In houses (mosques), which Allâh has  ordered to be raised (to be cleaned, and to be honoured), in them His  Name is glorified in the mornings and in the afternoons or the evenings,", "Men whom neither trade nor sale diverts  them from the Remembrance of Allâh (with heart and tongue), nor from  performing As­Salât (Iqâmat-as-Salât), nor from giving the Zakât. They  fear a Day when hearts and eyes will be overturned (from the horror of  the torment of the Day of Resurrection).", "That Allâh may reward them according to  the best of their deeds, and add even more for them out of His Grace.  And Allâh provides without measure to whom He wills.", "As for those who disbelieve, their deeds  are like a mirage in a desert. The thirsty one thinks it to be water,  until he comes up to it, he finds it to be nothing, but he finds Allâh  with him, Who will pay him his due (Hell). And Allâh is Swift in taking  account.", "Or [the state of a disbeliever] is like  the darkness in a vast deep sea, overwhelmed with a great wave topped  by a great wave, topped by dark clouds, darkness, one above another, if  a man stretches out his hand, he can hardly see it! And he for whom  Allâh has not appointed light, for him there is no light.", "See you not (O Muhammad SAW) that Allâh,  He it is Whom glorify whosoever is in the heavens and the earth, and  the birds with wings out-spread (in their flight). Of each one He  (Allâh) knows indeed his Salât (prayer) and his glorification, [or  everyone knows his Salât (prayer) and his glorification], and Allâh is  All-Aware of what they do.", "And to Allâh belongs the sovereignty of the heavens and the earth, and to Allâh is the return (of all).", "See you not that Allâh drives the clouds  gently, then joins them together, then makes them into a heap of  layers, and you see the rain comes forth from between them. And He  sends down from the sky hail (like) mountains, (or there are in the  heaven mountains of hail from where He sends down hail), and strike  therewith whom He will, and averts it from whom He wills. The vivid  flash of its (clouds) lightning nearly blinds the sight. [Tafsir  At-Tabarî].", "Allâh causes the night and the day to  succeed each other (i.e. if the day is gone, the night comes, and if  the night is gone, the day comes, and so on). Truly, in these things is  indeed a lesson for those who have insight.", "Allâh has created every moving (living)  creature from water. Of them there are some that creep on their  bellies, some that walk on two legs, and some that walk on four. Allâh  creates what He wills. Verily! Allâh is Able to do all things.", "We have indeed sent down (in this  Qur’ân) manifest Ayât (proofs, evidences, verses, lessons, signs,  revelations, lawful and unlawful things, and the set boundries of  Islâmic religion, etc. that make things clear showing the Right Path of  Allâh). And Allâh guides whom He wills to a Straight Path (i.e. to  Allâh’s religion of Islâmic Monotheism).", "They (hypocrites) say: ”We have believed  in Allâh and in the Messenger (Muhammad SAW), and we obey,” then a  party of them turn away thereafter, such are not believers.", "And when they are called to Allâh (i.e.  His Words, the Qur’ân) and His Messenger (SAW), to judge between them,  lo! a party of them refuse (to come) and turn away.", "But if the right is with them, they come to him willingly with submission.", "Is there a disease in their hearts? Or  do they doubt or fear lest Allâh and His Messenger (SAW) should wrong  them in judgement. Nay, it is they themselves who are the Zâlimûn  (polytheists, hypocrites and wrong-doers, etc.).", "The only saying of the faithful  believers, when they are called to Allâh (His Words, the Qur’ân) and  His Messenger (SAW), to judge between them, is that they say: ”We hear  and we obey.” And such are the prosperous ones (who will live forever  in Paradise).", "And whosoever obeys Allâh and His Messenger (SAW), fears Allâh, and keeps his duty (to Him), such are the successful ones.", "They swear by Allâh their strongest  oaths, that if only you would order them, they would leave (their homes  for fighting in Allâh’s Cause). Say: ”Swear you not; (this) obedience  (of yours) is known (to be false). Verily, Allâh knows well what you  do.”", "Say: ”Obey Allâh and obey the Messenger,  but if you turn away, he (Messenger Muhammad SAW) is only responsible  for the duty placed on him (i.e. to convey Allâh’s Message) and you for  that placed on you. If you obey him, you shall be on the right  guidance. The Messenger’s duty is only to convey (the message) in a  clear way (i.e. to preach in a plain way).”", "Allâh has promised those among you who  believe, and do righteous good deeds, that He will certainly grant them  succession to (the present rulers) in the earth, as He granted it to  those before them, and that He will grant them the authority to  practise their religion, that which He has chosen for them (i.e.  Islâm). And He will surely give them in exchange a safe security after  their fear (provided) they (believers) worship Me and do not associate  anything (in worship) with Me. But whoever disbelieved after this, they  are the Fâsiqûn (rebellious, disobedient to Allâh).", "And perform As­Salât (Iqâmat­as­Salât),  and give Zakât and obey the Messenger (Muhammad SAW) that you may  receive mercy (from Allâh).", "Consider not that the disbelievers can escape in the land. Their abode shall be the Fire, and worst indeed is that destination.", "O you who believe! Let your legal slaves  and slave-girls, and those among you who have not come to the age of  puberty ask your permission (before they come to your presence) on  three occasions; before Fajr (morning) prayer, and while you put off  your clothes for the noonday (rest), and after the ’Ishâ’ (late-night)  prayer. (These) three times are of privacy for you, other than these  times there is no sin on you or on them to move about, attending  (helping) you each other. Thus Allâh makes clear the Ayât (the Verses  of this Qur’ân, showing proofs for the legal aspects of permission for  visits, etc.) to you. And Allâh is All-Knowing, All-Wise.", "And when the children among you come to  puberty, then let them (also) ask for permission, as those senior to  them (in age). Thus Allâh makes clear His Ayât (Commandments and legal  obligations) for you. And Allâh is All-Knowing, All-Wise.", "And as for women past child-bearing who  do not expect wed-lock, it is no sin on them if they discard their  (outer) clothing in such a way as not to show their adornment. But to  refrain (i.e. not to discard their outer clothing) is better for them.  And Allâh is All-Hearer, All-Knower.", "There is no restriction on the blind,  nor any restriction on the lame, nor any restriction on the sick, nor  on yourselves, if you eat from your houses, or the houses of your  fathers, or the houses of your mothers, or the houses of your brothers,  or the houses of your sisters, or the houses of your father’s brothers,  or the houses of your father’s sisters, or the houses of your mother’s  brothers, or the houses of your mother’s sisters, or (from that)  whereof you hold keys, or (from the house) of a friend. No sin on you  whether you eat together or apart. But when you enter the houses, greet  one another with a greeting from Allâh (i.e. say: Úáíßã As-Salâmu  ’Alaikum - peace be on you) blessed and good. Thus Allâh makes clear  the Ayât (these Verses or your religious symbols and signs, etc.) to  you that you may understand.", "The true believers are only those, who  believe in (the Oneness of) Allâh and His Messenger (Muhammad SAW), and  when they are with him on some common matter, they go not away until  they have asked his permission. Verily! Those who ask your permission,  those are they who (really) believe in Allâh and His Messenger. So if  they ask your permission for some affairs of theirs, give permission to  whom you will of them, and ask Allâh for their forgiveness. Truly,  Allâh is Oft-Forgiving, Most Merciful.", "Make not the calling of the Messenger  (Muhammad SAW) among you as your calling of one another. Allâh knows  those of you who slip away under shelter (of some excuse without taking  the permission to leave, from the Messenger SAW). And let those who  oppose the Messenger’s (Muhammad SAW) commandment (i.e. his Sunnah  legal ways, orders, acts of worship, statements, etc.) (among the  sects) beware, lest some Fitnah (disbelief, trials, afflictions,  earthquakes, killing, overpowered by a tyrant, etc.) befall them or a  painful torment be inflicted on them.", "Certainly, to Allâh belongs all that is  in the heavens and the earth. Surely, He knows your condition and (He  knows) the Day when they will be brought back to Him, then He will  inform them of what they did. And Allâh is All-Knower of everything."]}