{"name_ar": "سورة القصص", "ayahs_ar": ["طسم", "تِلْكَ آيَاتُ الْكِتَابِ الْمُبِينِ", "نَتْلُوا عَلَيْكَ مِن نَّبَإِ مُوسَى وَفِرْعَوْنَ بِالْحَقِّ لِقَوْمٍ يُؤْمِنُونَ", "إِنَّ فِرْعَوْنَ عَلَا فِي الْأَرْضِ وَجَعَلَ أَهْلَهَا شِيَعًا يَسْتَضْعِفُ طَائِفَةً مِّنْهُمْ يُذَبِّحُ أَبْنَاءهُمْ وَيَسْتَحْيِي نِسَاءهُمْ إِنَّهُ كَانَ مِنَ الْمُفْسِدِينَ", "وَنُرِيدُ أَن نَّمُنَّ عَلَى الَّذِينَ اسْتُضْعِفُوا فِي الْأَرْضِ وَنَجْعَلَهُمْ أَئِمَّةً وَنَجْعَلَهُمُ الْوَارِثِينَ", "وَنُمَكِّنَ لَهُمْ فِي الْأَرْضِ وَنُرِي فِرْعَوْنَ وَهَامَانَ وَجُنُودَهُمَا مِنْهُم مَّا كَانُوا يَحْذَرُونَ", "وَأَوْحَيْنَا إِلَى أُمِّ مُوسَى أَنْ أَرْضِعِيهِ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ", "فَالْتَقَطَهُ آلُ فِرْعَوْنَ لِيَكُونَ لَهُمْ عَدُوًّا وَحَزَنًا إِنَّ فِرْعَوْنَ وَهَامَانَ وَجُنُودَهُمَا كَانُوا خَاطِئِينَ", "وَقَالَتِ امْرَأَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِّي وَلَكَ لَا تَقْتُلُوهُ عَسَى أَن يَنفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا وَهُمْ لَا يَشْعُرُونَ", "وَأَصْبَحَ فُؤَادُ أُمِّ مُوسَى فَارِغًا إِن كَادَتْ لَتُبْدِي بِهِ لَوْلَا أَن رَّبَطْنَا عَلَى قَلْبِهَا لِتَكُونَ مِنَ الْمُؤْمِنِينَ", "وَقَالَتْ لِأُخْتِهِ قُصِّيهِ فَبَصُرَتْ بِهِ عَن جُنُبٍ وَهُمْ لَا يَشْعُرُونَ", "وَحَرَّمْنَا عَلَيْهِ الْمَرَاضِعَ مِن قَبْلُ فَقَالَتْ هَلْ أَدُلُّكُمْ عَلَى أَهْلِ بَيْتٍ يَكْفُلُونَهُ لَكُمْ وَهُمْ لَهُ نَاصِحُونَ", "فَرَدَدْنَاهُ إِلَى أُمِّهِ كَيْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ وَلِتَعْلَمَ أَنَّ وَعْدَ اللَّهِ حَقٌّ وَلَكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ", "وَلَمَّا بَلَغَ أَشُدَّهُ وَاسْتَوَى آتَيْنَاهُ حُكْمًا وَعِلْمًا وَكَذَلِكَ نَجْزِي الْمُحْسِنِينَ", "وَدَخَلَ الْمَدِينَةَ عَلَى حِينِ غَفْلَةٍ مِّنْ أَهْلِهَا فَوَجَدَ فِيهَا رَجُلَيْنِ يَقْتَتِلَانِ هَذَا مِن شِيعَتِهِ وَهَذَا مِنْ عَدُوِّهِ فَاسْتَغَاثَهُ الَّذِي مِن شِيعَتِهِ عَلَى الَّذِي مِنْ عَدُوِّهِ فَوَكَزَهُ مُوسَى فَقَضَى عَلَيْهِ قَالَ هَذَا مِنْ عَمَلِ الشَّيْطَانِ إِنَّهُ عَدُوٌّ مُّضِلٌّ مُّبِينٌ", "قَالَ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ", "قَالَ رَبِّ بِمَا أَنْعَمْتَ عَلَيَّ فَلَنْ أَكُونَ ظَهِيرًا لِّلْمُجْرِمِينَ", "فَأَصْبَحَ فِي الْمَدِينَةِ خَائِفًا يَتَرَقَّبُ فَإِذَا الَّذِي اسْتَنصَرَهُ بِالْأَمْسِ يَسْتَصْرِخُهُ قَالَ لَهُ مُوسَى إِنَّكَ لَغَوِيٌّ مُّبِينٌ", "فَلَمَّا أَنْ أَرَادَ أَن يَبْطِشَ بِالَّذِي هُوَ عَدُوٌّ لَّهُمَا قَالَ يَا مُوسَى أَتُرِيدُ أَن تَقْتُلَنِي كَمَا قَتَلْتَ نَفْسًا بِالْأَمْسِ إِن تُرِيدُ إِلَّا أَن تَكُونَ جَبَّارًا فِي الْأَرْضِ وَمَا تُرِيدُ أَن تَكُونَ مِنَ الْمُصْلِحِينَ", "وَجَاء رَجُلٌ مِّنْ أَقْصَى الْمَدِينَةِ يَسْعَى قَالَ يَا مُوسَى إِنَّ الْمَلَأَ يَأْتَمِرُونَ بِكَ لِيَقْتُلُوكَ فَاخْرُجْ إِنِّي لَكَ مِنَ النَّاصِحِينَ", "فَخَرَجَ مِنْهَا خَائِفًا يَتَرَقَّبُ قَالَ رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ", "وَلَمَّا تَوَجَّهَ تِلْقَاء مَدْيَنَ قَالَ عَسَى رَبِّي أَن يَهْدِيَنِي سَوَاء السَّبِيلِ", "وَلَمَّا وَرَدَ مَاء مَدْيَنَ وَجَدَ عَلَيْهِ أُمَّةً مِّنَ النَّاسِ يَسْقُونَ وَوَجَدَ مِن دُونِهِمُ امْرَأتَيْنِ تَذُودَانِ قَالَ مَا خَطْبُكُمَا قَالَتَا لَا نَسْقِي حَتَّى يُصْدِرَ الرِّعَاء وَأَبُونَا شَيْخٌ كَبِيرٌ", "فَسَقَى لَهُمَا ثُمَّ تَوَلَّى إِلَى الظِّلِّ فَقَالَ رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ", "فَجَاءتْهُ إِحْدَاهُمَا تَمْشِي عَلَى اسْتِحْيَاء قَالَتْ إِنَّ أَبِي يَدْعُوكَ لِيَجْزِيَكَ أَجْرَ مَا سَقَيْتَ لَنَا فَلَمَّا جَاءهُ وَقَصَّ عَلَيْهِ الْقَصَصَ قَالَ لَا تَخَفْ نَجَوْتَ مِنَ الْقَوْمِ الظَّالِمِينَ", "قَالَتْ إِحْدَاهُمَا يَا أَبَتِ اسْتَأْجِرْهُ إِنَّ خَيْرَ مَنِ اسْتَأْجَرْتَ الْقَوِيُّ الْأَمِينُ", "قَالَ إِنِّي أُرِيدُ أَنْ أُنكِحَكَ إِحْدَى ابْنَتَيَّ هَاتَيْنِ عَلَى أَن تَأْجُرَنِي ثَمَانِيَ حِجَجٍ فَإِنْ أَتْمَمْتَ عَشْرًا فَمِنْ عِندِكَ وَمَا أُرِيدُ أَنْ أَشُقَّ عَلَيْكَ سَتَجِدُنِي إِن شَاء اللَّهُ مِنَ الصَّالِحِينَ", "قَالَ ذَلِكَ بَيْنِي وَبَيْنَكَ أَيَّمَا الْأَجَلَيْنِ قَضَيْتُ فَلَا عُدْوَانَ عَلَيَّ وَاللَّهُ عَلَى مَا نَقُولُ وَكِيلٌ", "فَلَمَّا قَضَى مُوسَىالْأَجَلَ وَسَارَ بِأَهْلِهِ آنَسَ مِن جَانِبِ الطُّورِ نَارًا قَالَ لِأَهْلِهِ امْكُثُوا إِنِّي آنَسْتُ نَارًا لَّعَلِّي آتِيكُم مِّنْهَا بِخَبَرٍ أَوْ جَذْوَةٍ مِنَ النَّارِ لَعَلَّكُمْ تَصْطَلُونَ", "فَلَمَّا أَتَاهَا نُودِي مِن شَاطِئِ الْوَادِي الْأَيْمَنِ فِي الْبُقْعَةِ الْمُبَارَكَةِ مِنَ الشَّجَرَةِ أَن يَا مُوسَى إِنِّي أَنَا اللَّهُ رَبُّ الْعَالَمِينَ", "وَأَنْ أَلْقِ عَصَاكَ فَلَمَّا رَآهَا تَهْتَزُّ كَأَنَّهَا جَانٌّ وَلَّى مُدْبِرًا وَلَمْ يُعَقِّبْ يَا مُوسَى أَقْبِلْ وَلَا تَخَفْ إِنَّكَ مِنَ الْآمِنِينَ", "اسْلُكْ يَدَكَ فِي جَيْبِكَ تَخْرُجْ بَيْضَاء مِنْ غَيْرِ سُوءٍ وَاضْمُمْ إِلَيْكَ جَنَاحَكَ مِنَ الرَّهْبِ فَذَانِكَ بُرْهَانَانِ مِن رَّبِّكَ إِلَى فِرْعَوْنَ وَمَلَئِهِ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ", "قَالَ رَبِّ إِنِّي قَتَلْتُ مِنْهُمْ نَفْسًا فَأَخَافُ أَن يَقْتُلُونِ", "وَأَخِي هَارُونُ هُوَ أَفْصَحُ مِنِّي لِسَانًا فَأَرْسِلْهُ مَعِيَ رِدْءًا يُصَدِّقُنِي إِنِّي أَخَافُ أَن يُكَذِّبُونِ", "قَالَ سَنَشُدُّ عَضُدَكَ بِأَخِيكَ وَنَجْعَلُ لَكُمَا سُلْطَانًا فَلَا يَصِلُونَ إِلَيْكُمَا بِآيَاتِنَا أَنتُمَا وَمَنِ اتَّبَعَكُمَا الْغَالِبُونَ", "فَلَمَّا جَاءهُم مُّوسَى بِآيَاتِنَا بَيِّنَاتٍ قَالُوا مَا هَذَا إِلَّا سِحْرٌ مُّفْتَرًى وَمَا سَمِعْنَا بِهَذَا فِي آبَائِنَا الْأَوَّلِينَ", "وَقَالَ مُوسَى رَبِّي أَعْلَمُ بِمَن جَاء بِالْهُدَى مِنْ عِندِهِ وَمَن تَكُونُ لَهُ عَاقِبَةُ الدَّارِ إِنَّهُ لَا يُفْلِحُ الظَّالِمُونَ", "وَقَالَ فِرْعَوْنُ يَا أَيُّهَا الْمَلَأُ مَا عَلِمْتُ لَكُم مِّنْ إِلَهٍ غَيْرِي فَأَوْقِدْ لِي يَا هَامَانُ عَلَى الطِّينِ فَاجْعَل لِّي صَرْحًا لَّعَلِّي أَطَّلِعُ إِلَى إِلَهِ مُوسَى وَإِنِّي لَأَظُنُّهُ مِنَ الْكَاذِبِينَ", "وَاسْتَكْبَرَ هُوَ وَجُنُودُهُ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَظَنُّوا أَنَّهُمْ إِلَيْنَا لَا يُرْجَعُونَ", "فَأَخَذْنَاهُ وَجُنُودَهُ فَنَبَذْنَاهُمْ فِي الْيَمِّ فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ الظَّالِمِينَ", "وَجَعَلْنَاهُمْ أَئِمَّةً يَدْعُونَ إِلَى النَّارِ وَيَوْمَ الْقِيَامَةِ لَا يُنصَرُونَ", "وَأَتْبَعْنَاهُمْ فِي هَذِهِ الدُّنْيَا لَعْنَةً وَيَوْمَ الْقِيَامَةِ هُم مِّنَ الْمَقْبُوحِينَ", "وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ مِن بَعْدِ مَا أَهْلَكْنَا الْقُرُونَ الْأُولَى بَصَائِرَ لِلنَّاسِ وَهُدًى وَرَحْمَةً لَّعَلَّهُمْ يَتَذَكَّرُونَ", "وَمَا كُنتَ بِجَانِبِ الْغَرْبِيِّ إِذْ قَضَيْنَا إِلَى مُوسَى الْأَمْرَ وَمَا كُنتَ مِنَ الشَّاهِدِينَ", "وَلَكِنَّا أَنشَأْنَا قُرُونًا فَتَطَاوَلَ عَلَيْهِمُ الْعُمُرُ وَمَا كُنتَ ثَاوِيًا فِي أَهْلِ مَدْيَنَ تَتْلُو عَلَيْهِمْ آيَاتِنَا وَلَكِنَّا كُنَّا مُرْسِلِينَ", "وَمَا كُنتَ بِجَانِبِ الطُّورِ إِذْ نَادَيْنَا وَلَكِن رَّحْمَةً مِّن رَّبِّكَ لِتُنذِرَ قَوْمًا مَّا أَتَاهُم مِّن نَّذِيرٍ مِّن قَبْلِكَ لَعَلَّهُمْ يَتَذَكَّرُونَ", "وَلَوْلَا أَن تُصِيبَهُم مُّصِيبَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ فَيَقُولُوا رَبَّنَا لَوْلَا أَرْسَلْتَ إِلَيْنَا رَسُولًا فَنَتَّبِعَ آيَاتِكَ وَنَكُونَ مِنَ الْمُؤْمِنِينَ", "فَلَمَّا جَاءهُمُ الْحَقُّ مِنْ عِندِنَا قَالُوا لَوْلَا أُوتِيَ مِثْلَ مَا أُوتِيَ مُوسَى أَوَلَمْ يَكْفُرُوا بِمَا أُوتِيَ مُوسَى مِن قَبْلُ قَالُوا سِحْرَانِ تَظَاهَرَا وَقَالُوا إِنَّا بِكُلٍّ كَافِرُونَ", "قُلْ فَأْتُوا بِكِتَابٍ مِّنْ عِندِ اللَّهِ هُوَ أَهْدَى مِنْهُمَا أَتَّبِعْهُ إِن كُنتُمْ صَادِقِينَ", "فَإِن لَّمْ يَسْتَجِيبُوا لَكَ فَاعْلَمْ أَنَّمَا يَتَّبِعُونَ أَهْوَاءهُمْ وَمَنْ أَضَلُّ مِمَّنِ اتَّبَعَ هَوَاهُ بِغَيْرِ هُدًى مِّنَ اللَّهِ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ", "وَلَقَدْ وَصَّلْنَا لَهُمُ الْقَوْلَ لَعَلَّهُمْ يَتَذَكَّرُونَ", "الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ مِن قَبْلِهِ هُم بِهِ يُؤْمِنُونَ", "وَإِذَا يُتْلَى عَلَيْهِمْ قَالُوا آمَنَّا بِهِ إِنَّهُ الْحَقُّ مِن رَّبِّنَا إِنَّا كُنَّا مِن قَبْلِهِ مُسْلِمِينَ", "أُوْلَئِكَ يُؤْتَوْنَ أَجْرَهُم مَّرَّتَيْنِ بِمَا صَبَرُوا وَيَدْرَؤُونَ بِالْحَسَنَةِ السَّيِّئَةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ", "وَإِذَا سَمِعُوا اللَّغْوَ أَعْرَضُوا عَنْهُ وَقَالُوا لَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ سَلَامٌ عَلَيْكُمْ لَا نَبْتَغِي الْجَاهِلِينَ", "إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَن يَشَاء وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ", "وَقَالُوا إِن نَّتَّبِعِ الْهُدَى مَعَكَ نُتَخَطَّفْ مِنْ أَرْضِنَا أَوَلَمْ نُمَكِّن لَّهُمْ حَرَمًا آمِنًا يُجْبَى إِلَيْهِ ثَمَرَاتُ كُلِّ شَيْءٍ رِزْقًا مِن لَّدُنَّا وَلَكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ", "وَكَمْ أَهْلَكْنَا مِن قَرْيَةٍ بَطِرَتْ مَعِيشَتَهَا فَتِلْكَ مَسَاكِنُهُمْ لَمْ تُسْكَن مِّن بَعْدِهِمْ إِلَّا قَلِيلًا وَكُنَّا نَحْنُ الْوَارِثِينَ", "وَمَا كَانَ رَبُّكَ مُهْلِكَ الْقُرَى حَتَّى يَبْعَثَ فِي أُمِّهَا رَسُولًا يَتْلُو عَلَيْهِمْ آيَاتِنَا وَمَا كُنَّا مُهْلِكِي الْقُرَى إِلَّا وَأَهْلُهَا ظَالِمُونَ", "وَمَا أُوتِيتُم مِّن شَيْءٍ فَمَتَاعُ الْحَيَاةِ الدُّنْيَا وَزِينَتُهَا وَمَا عِندَ اللَّهِ خَيْرٌ وَأَبْقَى أَفَلَا تَعْقِلُونَ", "أَفَمَن وَعَدْنَاهُ وَعْدًا حَسَنًا فَهُوَ لَاقِيهِ كَمَن مَّتَّعْنَاهُ مَتَاعَ الْحَيَاةِ الدُّنْيَا ثُمَّ هُوَ يَوْمَ الْقِيَامَةِ مِنَ الْمُحْضَرِينَ", "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَائِيَ الَّذِينَ كُنتُمْ تَزْعُمُونَ", "قَالَ الَّذِينَ حَقَّ عَلَيْهِمُ الْقَوْلُ رَبَّنَا هَؤُلَاء الَّذِينَ أَغْوَيْنَا أَغْوَيْنَاهُمْ كَمَا غَوَيْنَا تَبَرَّأْنَا إِلَيْكَ مَا كَانُوا إِيَّانَا يَعْبُدُونَ", "وَقِيلَ ادْعُوا شُرَكَاءكُمْ فَدَعَوْهُمْ فَلَمْ يَسْتَجِيبُوا لَهُمْ وَرَأَوُا الْعَذَابَ لَوْ أَنَّهُمْ كَانُوا يَهْتَدُونَ", "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ مَاذَا أَجَبْتُمُ الْمُرْسَلِينَ", "فَعَمِيَتْ عَلَيْهِمُ الْأَنبَاء يَوْمَئِذٍ فَهُمْ لَا يَتَسَاءلُونَ", "فَأَمَّا مَن تَابَ وَآمَنَ وَعَمِلَ صَالِحًا فَعَسَى أَن يَكُونَ مِنَ الْمُفْلِحِينَ", "وَرَبُّكَ يَخْلُقُ مَا يَشَاء وَيَخْتَارُ مَا كَانَ لَهُمُ الْخِيَرَةُ سُبْحَانَ اللَّهِ وَتَعَالَى عَمَّا يُشْرِكُونَ", "وَرَبُّكَ يَعْلَمُ مَا تُكِنُّ صُدُورُهُمْ وَمَا يُعْلِنُونَ", "وَهُوَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ لَهُ الْحَمْدُ فِي الْأُولَى وَالْآخِرَةِ وَلَهُ الْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ", "قُلْ أَرَأَيْتُمْ إِن جَعَلَ اللَّهُ عَلَيْكُمُ اللَّيْلَ سَرْمَدًا إِلَى يَوْمِ الْقِيَامَةِ مَنْ إِلَهٌ غَيْرُ اللَّهِ يَأْتِيكُم بِضِيَاء أَفَلَا تَسْمَعُونَ", "قُلْ أَرَأَيْتُمْ إِن جَعَلَ اللَّهُ عَلَيْكُمُ النَّهَارَ سَرْمَدًا إِلَى يَوْمِ الْقِيَامَةِ مَنْ إِلَهٌ غَيْرُ اللَّهِ يَأْتِيكُم بِلَيْلٍ تَسْكُنُونَ فِيهِ أَفَلَا تُبْصِرُونَ", "وَمِن رَّحْمَتِهِ جَعَلَ لَكُمُ اللَّيْلَ وَالنَّهَارَ لِتَسْكُنُوا فِيهِ وَلِتَبْتَغُوا مِن فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ", "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَائِيَ الَّذِينَ كُنتُمْ تَزْعُمُونَ", "وَنَزَعْنَا مِن كُلِّ أُمَّةٍ شَهِيدًا فَقُلْنَا هَاتُوا بُرْهَانَكُمْ فَعَلِمُوا أَنَّ الْحَقَّ لِلَّهِ وَضَلَّ عَنْهُم مَّا كَانُوا يَفْتَرُونَ", "إِنَّ قَارُونَ كَانَ مِن قَوْمِ مُوسَى فَبَغَى عَلَيْهِمْ وَآتَيْنَاهُ مِنَ الْكُنُوزِ مَا إِنَّ مَفَاتِحَهُ لَتَنُوءُ بِالْعُصْبَةِ أُولِي الْقُوَّةِ إِذْ قَالَ لَهُ قَوْمُهُ لَا تَفْرَحْ إِنَّ اللَّهَ لَا يُحِبُّ الْفَرِحِينَ", "وَابْتَغِ فِيمَا آتَاكَ اللَّهُ الدَّارَ الْآخِرَةَ وَلَا تَنسَ نَصِيبَكَ مِنَ الدُّنْيَا وَأَحْسِن كَمَا أَحْسَنَ اللَّهُ إِلَيْكَ وَلَا تَبْغِ الْفَسَادَ فِي الْأَرْضِ إِنَّ اللَّهَ لَا يُحِبُّ الْمُفْسِدِينَ", "قَالَ إِنَّمَا أُوتِيتُهُ عَلَى عِلْمٍ عِندِي أَوَلَمْ يَعْلَمْ أَنَّ اللَّهَ قَدْ أَهْلَكَ مِن قَبْلِهِ مِنَ القُرُونِ مَنْ هُوَ أَشَدُّ مِنْهُ قُوَّةً وَأَكْثَرُ جَمْعًا وَلَا يُسْأَلُ عَن ذُنُوبِهِمُ الْمُجْرِمُونَ", "فَخَرَجَ عَلَى قَوْمِهِ فِي زِينَتِهِ قَالَ الَّذِينَ يُرِيدُونَ الْحَيَاةَ الدُّنيَا يَا لَيْتَ لَنَا مِثْلَ مَا أُوتِيَ قَارُونُ إِنَّهُ لَذُو حَظٍّ عَظِيمٍ", "وَقَالَ الَّذِينَ أُوتُوا الْعِلْمَ وَيْلَكُمْ ثَوَابُ اللَّهِ خَيْرٌ لِّمَنْ آمَنَ وَعَمِلَ صَالِحًا وَلَا يُلَقَّاهَا إِلَّا الصَّابِرُونَ", "فَخَسَفْنَا بِهِ وَبِدَارِهِ الْأَرْضَ فَمَا كَانَ لَهُ مِن فِئَةٍ يَنصُرُونَهُ مِن دُونِ اللَّهِ وَمَا كَانَ مِنَ المُنتَصِرِينَ", "وَأَصْبَحَ الَّذِينَ تَمَنَّوْا مَكَانَهُ بِالْأَمْسِ يَقُولُونَ وَيْكَأَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَن يَشَاء مِنْ عِبَادِهِ وَيَقْدِرُ لَوْلَا أَن مَّنَّ اللَّهُ عَلَيْنَا لَخَسَفَ بِنَا وَيْكَأَنَّهُ لَا يُفْلِحُ الْكَافِرُونَ", "تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوًّا فِي الْأَرْضِ وَلَا فَسَادًا وَالْعَاقِبَةُ لِلْمُتَّقِينَ", "مَن جَاء بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِّنْهَا وَمَن جَاء بِالسَّيِّئَةِ فَلَا يُجْزَى الَّذِينَ عَمِلُوا السَّيِّئَاتِ إِلَّا مَا كَانُوا يَعْمَلُونَ", "إِنَّ الَّذِي فَرَضَ عَلَيْكَ الْقُرْآنَ لَرَادُّكَ إِلَى مَعَادٍ قُل رَّبِّي أَعْلَمُ مَن جَاء بِالْهُدَى وَمَنْ هُوَ فِي ضَلَالٍ مُّبِينٍ", "وَمَا كُنتَ تَرْجُو أَن يُلْقَى إِلَيْكَ الْكِتَابُ إِلَّا رَحْمَةً مِّن رَّبِّكَ فَلَا تَكُونَنَّ ظَهِيرًا لِّلْكَافِرِينَ", "وَلَا يَصُدُّنَّكَ عَنْ آيَاتِ اللَّهِ بَعْدَ إِذْ أُنزِلَتْ إِلَيْكَ وَادْعُ إِلَى رَبِّكَ وَلَا تَكُونَنَّ مِنَ الْمُشْرِكِينَ", "وَلَا تَدْعُ مَعَ اللَّهِ إِلَهًا آخَرَ لَا إِلَهَ إِلَّا هُوَ كُلُّ شَيْءٍ هَالِكٌ إِلَّا وَجْهَهُ لَهُ الْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ"], "name_en": "Al-Qasas", "ayahs_en": ["Tâ­Sîn­Mîm. [These letters are one of the miracles of the Qur’ân, and none but Allâh (Alone) knows their meanings]", "These are Verses of the manifest Book (that makes clear truth from falsehood, good from evil, etc.).", "We recite to you some of the news of  Mûsa (Moses) and Fir’aun (Pharaoh) in truth, for a people who believe  (those who believe in this Qur’ân, and in the Oneness of Allâh).", "Verily, Fir’aun (Pharaoh) exalted  himself in the land and made its people sects, weakening (oppressing) a  group (i.e. Children of Israel) among them, killing their sons, and  letting their females live. Verily, he was of the Mufsidûn (i.e. those  who commit great sins and crimes, oppressors, tyrants, etc.).", "And We wished to do a favour to those  who were weak (and oppressed) in the land, and to make them rulers and  to make them the inheritors,", "And to establish them in the land, and  We let Fir’aun (Pharaoh) and Hâmân and their hosts receive from them  that which they feared.", "And We inspired the mother of Mûsa  (Moses), (saying): ”Suckle him [Mûsa (Moses)], but when you fear for  him, then cast him into the river and fear not, nor grieve. Verily! We  shall bring him back to you, and shall make him one of (Our)  Messengers.”", "Then the household of Fir’aun (Pharaoh)  picked him up, that he might become for them an enemy and a (cause of)  grief. Verily! Fir’aun (Pharaoh), Hâmân and their hosts were sinners.", "And the wife of Fir’aun (Pharaoh) said:  ”A comfort of the eye for me and for you. Kill him not, perhaps he may  be of benefit to us, or we may adopt him as a son.” And they perceive  not (the result of that).", "And the heart of the mother of Mûsa  (Moses) became empty [from every thought, except the thought of Mûsa  (Moses)]. She was very near to disclose his (case, i.e. the child is  her son), had We not strengthened her heart (with Faith), so that she  might remain as one of the believers.", "And she said to his [Musa’s (Moses)]  sister: ”Follow him.” So she (his sister) watched him from a far place  secretly, while they perceived not.", "And We had already forbidden (other)  foster suckling mothers for him, until she (his sister came up and)  said: ”Shall I direct you to a household who will rear him for you, and  sincerely they will look after him in a good manner?”", "So did We restore him to his mother,  that she might be delighted, and that she might not grieve, and that  she might know that the Promise of Allâh is true. But most of them know  not.", "And when he attained his full strength,  and was perfect (in manhood), We bestowed on him Hukman (Prophethood,  right judgement of the affairs) and religious knowledge [of the  religion of his forefathers i.e. Islâmic Monotheism]. And thus do We  reward the Muhsinûn (i.e. good doers - see the footnote of V.9:120).", "And he entered the city at a time of  unawareness of its people, and he found there two men fighting, - one  of his party (his religion - from the Children of Israel), and the  other of his foes. The man of his (own) party asked him for help  against his foe, so Mûsa (Moses) struck him with his fist and killed  him. He said: ”This is of Shaitân’s (Satan) doing, verily, he is a  plain misleading enemy.”", "He said: ”My Lord! Verily, I have  wronged myself, so forgive me.” Then He forgave him. Verily, He is the  Oft-Forgiving, the Most Merciful.", "He said: ”My Lord! For that with which  You have favoured me, I will never more be a helper for the Mujrimûn  (criminals, disobedient to Allâh, polytheists, sinners, etc.)!”", "So he became afraid, looking about in  the city (waiting as to what will be the result of his crime of  killing), when behold, the man who had sought his help the day before,  called for his help (again). Mûsa (Moses) said to him: ”Verily, you are  a plain misleader!”", "Then when he decided to seize the man  who was an enemy to both of them, the man said: ”O Mûsa (Moses)! Is it  your intention to kill me as you killed a man yesterday? Your aim is  nothing but to become a tyrant in the land, and not to be one of those  who do right.”", "And there came a man running, from the  farthest end of the city. He said: ”O Mûsa (Moses)! Verily, the chiefs  are taking counsel together about you, to kill you, so escape.Truly, I  am to you of those who give sincere advice.”", "So he escaped from there, looking about  in a state of fear. He said: ”My Lord! Save me from the people who are  Zâlimûn (polytheists and wrong-doers)!”", "And when he went towards (the land of) Madyan (Midian) he said: ”It may be that my Lord guides me to the Right Way.”", "And when he arrived at the water of  Madyan (Midian) he found there a group of men watering (their flocks),  and besides them he found two women who were keeping back (their  flocks). He said: ”What is the matter with you?” They said: ”We cannot  water (our flocks) until the shepherds take (their flocks). And our  father is a very old man.”", "So he watered (their flocks) for them,  then he turned back to shade, and said: ”My Lord! Truly, I am in need  of whatever good that You bestow on me!”", "Then there came to him one of the two  women, walking shyly. She said: ”Verily, my father calls you that he  may reward you for having watered (our flocks) for us.” So when he came  to him and narrated the story, he said: ”Fear you not. You have escaped  from the people who are Zâlimûn (polytheists, disbelievers, and  wrong-doers).”", "And said one of them (the two women): ”O  my father! Hire him! Verily, the best of men for you to hire is the  strong, the trustworthy.”", "He said: ”I intend to wed one of these  two daughters of mine to you, on condition that you serve me for eight  years, but if you complete ten years, it will be (a favour) from you.  But I intend not to place you under a difficulty. If Allâh will, you  will find me one of the righteous.”", "He [Mûsa (Moses)] said: ”That (is  settled) between me and you whichever of the two terms I fulfill, there  will be no injustice to me, and Allâh is Surety over what we say.”", "Then, when Mûsa (Moses) had fulfilled  the term, and was travelling with his family, he saw a fire in the  direction of Tûr (Mount). He said to his family: ”Wait, I have seen a  fire; perhaps I may bring to you from there some information, or a  burning fire-brand that you may warm yourselves.”", "So when he reached it (the fire), he was  called from the right side of the valley, in the blessed place from the  tree: ”O Mûsa (Moses)! Verily! I am Allâh, the Lord of the ’Alamîn  (mankind, jinns and all that exists)!", "”And throw your stick!” But when he saw  it moving as if it were a snake, he turned in flight, and looked not  back. (It was said): ”O Mûsa (Moses)! Draw near, and fear not. Verily,  you are of those who are secure.", "”Put your hand in your bosom, it will  come forth white without a disease, and draw your hand close to your  side to be free from fear (that which you suffered from the snake, and  also by that your hand will return to its original state). these are  two Burhân (signs, miracles, evidences, proofs) from your Lord to  Fir’aun (Pharaoh) and his chiefs. Verily, they are the people who are  Fâsiqûn (rebellious, disobedient to Allâh).", "He said: ”My Lord! I have killed a man among them, and I fear that they will kill me.", "”And my brother Hârûn (Aaron) he is more  eloquent in speech than me so send him with me as a helper to confirm  me. Verily! I fear that they will belie me.”", "Allâh said: ”We will strengthen your arm  through your brother, and give you both power, so they shall not be  able to harm you, with Our Ayât (proofs, evidences, verses, lessons,  signs, revelations, etc.), you two as well as those who follow you will  be the victors.”", "Then when Mûsa (Moses) came to them with  Our Clear Ayât (proofs, evidences, verses, lessons, signs, revelations,  etc.), they said: ”This is nothing but invented magic. Never did we  hear of this among our fathers of old.”", "Mûsa (Moses) said: ”My Lord knows best  him who came with guidance from Him, and whose will be the happy end in  the Hereafter. Verily, the Zâlimûn (wrong-doers, polytheists and  disbelievers in the Oneness of Allâh) will not be successful.”", "Fir’aun (Pharaoh) said: ”O chiefs! I  know not that you have an ilâh (a god) other than me, so kindle for me  (a fire), O Hâmân, to bake (bricks out of) clay, and set up for me a  Sarhan (a lofty tower, or palace, etc.) in order that I may look at (or  look for) the Ilâh (God) of Mûsa (Moses); and verily, I think that he  [Mûsa (Moses)] is one of the liars.”", "And he and his hosts were arrogant in the land, without right, and they thought that they would never return to Us.", "So We seized him and his hosts, and We  threw them all into the sea (and drowned them). So behold (O Muhammad  SAW) what was the end of the Zâlimûn [wrong-doers, polytheists and  those who disbelieved in the Oneness of their Lord (Allâh), or rejected  the advice of His Messenger Mûsa (Moses) ].", "And We made them leaders inviting to the Fire, and on the Day of Resurrection, they will not be helped.", "And We made a curse to follow them in  this world, and on the Day of Resurrection, they will be among  Al-Maqbuhûn (those who are prevented to receive Allâh’s Mercy or any  good, despised or destroyed, etc.).", "And indeed We gave Mûsa (Moses), after  We had destroyed the generations of old, the Scripture [the Taurât  (Torah)] as an enlightenment for mankind, and a guidance and a mercy,  that they might remember (or receive admonition).", "And you (O Muhammad SAW) were not on the  western side (of the Mount), when We made clear to Mûsa (Moses) the  commandment, and you were not among those present.", "But We created generations [after  generations i.e. after Mûsa (Moses) ], and long were the ages that  passed over them. And you (O Muhammad SAW) were not a dweller among the  people of Madyan (Midian), reciting Our Verses to them. But it is We  Who kept sending (Messengers).", "And you (O Muhammad SAW) were not at the  side of the Tûr (Mount) when We did call, [it is said that Allâh called  the followers of Muhammad SAW , and they answered His Call, or that  Allâh called Mûsa (Moses)]. But (you are sent) as a mercy from your  Lord, to give warning to a people to whom no warner had come before  you, in order that they may remember or receive admonition. [Tafsir  At-Tabarî, Vol. 20, Page 81].", "And if (We had) not (sent you to the  people of Makkah) in case a calamity should seize them for (the deeds)  that their hands have sent forth, they should have said: ”Our Lord! Why  did You not send us a Messenger? We should then have followed Your Ayât  (Verses of the Qur’ân) and should have been among the believers.”", "But when the truth (i.e. Muhammad SAW  with his Message) has come to them from Us, they say: ”Why is he not  given the like of what was given to Mûsa (Moses)? Did they not  disbelieve in that which was given to Mûsa (Moses) of old? They say:  ”Two kinds of magic [the Taurât (Torah) and the Qur’ân] each helping  the other!” And they say: ”Verily! In both we are disbelievers.”", "Say (to them, O Muhammad SAW): ”Then  bring a Book from Allâh, which is a better guide than these two [the  Taurât (Torah) and the Qur’ân], that I may follow it, if you are  truthful.”", "But if they answer you not (i.e. do not  believe in your doctrine of Islâmic Monotheism, nor follow you), then  know that they only follow their own lusts. And who is more astray than  one who follows his own lusts, without guidance from Allâh? Verily!  Allâh guides not the people who are Zâlimûn (wrong-doers, disobedient  to Allâh, and polytheists).", "And indeed now We have conveyed the Word  (this Qur’ân in which is the news of everything to them), in order that  they may remember (or receive admonition).", "Those to whom We gave the Scripture  [i.e. the Taurât (Torah) and the Injeel (Gospel), etc.] before it, -  they believe in it (the Qur’ân).", "And when it is recited to them, they  say: ”We believe in it. Verily, it is the truth from our Lord. Indeed  even before it we have been from those who submit themselves to Allâh  in Islâm as Muslims (like ’Abdullâh bin Salâm and Salmân Al-Farisî,  etc.).", "These will be given their reward twice  over, because they are patient, and repel evil with good, and spend (in  charity) out of what We have provided them.", "And when they hear Al­Laghw (dirty,  false, evil vain talk), they withdraw from it and say: ”To us our  deeds, and to you your deeds. Peace be to you. We seek not the  ignorant.”", "Verily! You (O Muhammad SAW) guide not  whom you like, but Allâh guides whom He wills. And He knows best those  who are the guided.", "And they say: ”If we follow the guidance  with you, we would be snatched away from our land.” Have We not  established for them a secure sanctuary (Makkah), to which are brought  fruits of all kinds, a provision from Ourselves, but most of them know  not.", "And how many a town (population) have We  destroyed, which were thankless for its means of livelihood (disobeyed  Allâh, and His Messengers, by doing evil deeds and crimes) ! And those  are their dwellings, which have not been inhabited after them except a  little. And verily! We have been the inheritors.", "And never will your Lord destroy the  towns (populations) until He sends to their mother town a Messenger  reciting to them Our Verses. And never would We destroy the towns  unless the people thereof are Zâlimûn (polytheists, wrong-doers,  disbelievers in the Oneness of Allâh, oppressors and tyrants).", "And whatever you have been given is an  enjoyment of the life of (this) world and its adornment, and that  (Hereafter) which is with Allâh is better and will remain forever. Have  you then no sense?", "Is he whom We have promised an excellent  promise (Paradise), which he will find true, like him whom We have made  to enjoy the luxuries of the life of (this) world, then on the Day of  Resurrection, he will be among those brought up (to be punished in the  Hell-fire)?", "And (remember) the Day when He will call to them, and say: ”Where are My (so-called) partners whom you used to assert?”", "Those about whom the Word will have come  true (to be punished) will say: ”Our Lord! These are they whom we led  astray. We led them astray, as we were astray ourselves. We declare our  innocence (from them) before You. It was not us they worshipped.”", "And it will be said (to them): ”Call  upon your (so-called) partners (of Allâh), and they will call upon  them, but they will give no answer to them, and they will see the  torment. (They will then wish) if only they had been guided!", "And (remember) the Day (Allâh) will call to them, and say: ”What answer gave you to the Messengers?”", "Then the news of a good answer will be obscured to them on that day, and they will not be able to ask one another.", "But as for him who repented (from  polytheism and sins, etc.), believed (in the Oneness of Allâh, and in  His Messenger Muhammad SAW), and did righteous deeds (in the life of  this world), then he will be among those who are successful.", "And your Lord creates whatsoever He  wills and chooses, no choice have they (in any matter). Glorified be  Allâh, and exalted above all that they associate as partners (with Him).", "And your Lord knows what their breasts conceal, and what they reveal.", "And He is Allâh; Lâ ilâha illa Huwa  (none has the right to be worshipped but He). His is all praise, in the  first (i.e. in this world) and in the last (i.e.in the Hereafter). And  for Him is the Decision, and to Him shall you (all) be returned.", "Say (O Muhammad SAW): ”Tell me! If Allâh  made night continuous for you till the Day of Resurrection, who is an  ilâh (a god) besides Allâh who could bring you light? Will you not then  hear?”", "Say (O Muhammad SAW): ”Tell me! If Allâh  made day continuous for you till the Day of Resurrection, who is an  ilâh (a god) besides Allâh who could bring you night wherein you rest?  Will you not then see?”", "It is out of His Mercy that He has put  for you night and day, that you may rest therein (i.e. during the  night) and that you may seek of His Bounty (i.e. during the day), and  in order that you may be grateful.", "And (remember) the Day when He (your  Lord Allâh) will call them (those who worshipped others along with  Allâh), and will say: ”Where are My (so-called) partners, whom you used  to assert?”", "And We shall take out from every nation  a witness, and We shall say: ”Bring your proof.” Then they shall know  that the truth is with Allâh (Alone), and the lies (false gods) which  they invented will disappear from them.", "Verily, Qârûn (Korah) was of Mûsa’s  (Moses) people, but he behaved arrogantly towards them. And We gave him  of the treasures, that of which the keys would have been a burden to a  body of strong men. When his people said to him: ”Do not be glad (with  ungratefulness to Allâh’s Favours). Verily! Allâh likes not those who  are glad (with ungratefulness to Allâh’s Favours).", "But seek, with that (wealth) which Allâh  has bestowed on you, the home of the Hereafter, and forget not your  portion of legal enjoyment in this world, and do good as Allâh has been  good to you, and seek not mischief in the land. Verily, Allâh likes not  the Mufsidûn (those who commit great crimes and sins, oppressors,  tyrants, mischief-makers, corrupts).", "He said: ”This has been given to me only  because of knowledge I possess.” Did he not know that Allâh had  destroyed before him generations, men who were stronger than him in  might and greater in the amount (of riches) they had collected. But the  Mujrimûn (criminals, disbelievers, polytheists, sinners, etc.) will not  be questioned of their sins (because Allâh knows them well, so they  will be punished without account).", "So he went forth before his people in  his pomp. Those who were desirous of the life of the world, said: ”Ah,  would that we had the like of what Qârûn (Korah) has been given?  Verily! He is the owner of a great fortune.”", "But those who had been given (religious)  knowledge said: ”Woe to you! The Reward of Allâh (in the Hereafter) is  better for those who believe and do righteous good deeds, and this none  shall attain except those who are patient (in following the truth).”", "So We caused the earth to swallow him  and his dwelling place. Then he had no group or party to help him  against Allâh, nor was he one of those who could save themselves.", "And those who had desired (for a  position like) his position the day before, began to say: ”Know you not  that it is Allâh Who enlarges the provision or restricts it to  whomsoever He pleases of His slaves. Had it not been that Allâh was  Gracious to us, He could have caused the earth to swallow us up (also)!  Know you not that the disbelievers will never be successful.", "That home of the Hereafter (i.e.  Paradise), We shall assign to those who rebel not against the truth  with pride and oppression in the land nor do mischief by committing  crimes. And the good end is for the Muttaqûn (pious - see V.2:2).", "That home of the Hereafter (i.e.  Paradise), We shall assign to those who rebel not against the truth  with pride and oppression in the land nor do mischief by committing  crimes. And the good end is for the Muttaqûn (pious - see V.2:2).", "Verily, He Who has given you (O Muhammad  SAW) the Qur’an (i.e. ordered you to act on its laws and to preach it  to others) will surely bring you back to the Ma’âd (place of return,  either to Makkah or to Paradise after your death, etc.). Say (O  Muhammad SAW): ”My Lord is Aware of him who brings guidance, and he who  is in manifest error.”", "And you were not expecting that the Book  (this Qur’ân) would be sent down to you, but it is a mercy from your  Lord. So never be a supporter of the disbelievers.", "And let them not turn you (O Muhammad  SAW) away from (preaching) the Ayât (revelations and verses) of Allâh  after they have been sent down to you, and invite (men) to (believe in)  your Lord [i.e: in the Oneness (Tauhîd) of Allâh (1) Oneness of the  Lordship of Allâh; (2) Oneness of the worship of Allâh; (3) Oneness of  the Names and Qualities of Allâh], and be not of Al-Mushrikûn (those  who associate partners with Allâh, e.g. polytheists, pagans, idolaters,  those who disbelieve in the Oneness of Allâh and deny the Prophethood  of Messenger Muhammad SAW).", "And invoke not any other ilâh (god)  along with Allâh, Lâ ilâha illa Huwa (none has the right to be  worshipped but He). Everything will perish save His Face. His is the  Decision, and to Him you (all) shall be returned."]}