{"name_ar": "سورة لقمان", "ayahs_ar": ["الم", "تِلْكَ آيَاتُ الْكِتَابِ الْحَكِيمِ", "هُدًى وَرَحْمَةً لِّلْمُحْسِنِينَ", "الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَهُم بِالْآخِرَةِ هُمْ يُوقِنُونَ", "أُوْلَئِكَ عَلَى هُدًى مِّن رَّبِّهِمْ وَأُوْلَئِكَ هُمُ الْمُفْلِحُونَ", "وَمِنَ النَّاسِ مَن يَشْتَرِي لَهْوَ الْحَدِيثِ لِيُضِلَّ عَن سَبِيلِ اللَّهِ بِغَيْرِ عِلْمٍ وَيَتَّخِذَهَا هُزُوًا أُولَئِكَ لَهُمْ عَذَابٌ مُّهِينٌ", "وَإِذَا تُتْلَى عَلَيْهِ آيَاتُنَا وَلَّى مُسْتَكْبِرًا كَأَن لَّمْ يَسْمَعْهَا كَأَنَّ فِي أُذُنَيْهِ وَقْرًا فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ", "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ جَنَّاتُ النَّعِيمِ", "خَالِدِينَ فِيهَا وَعْدَ اللَّهِ حَقًّا وَهُوَ الْعَزِيزُ الْحَكِيمُ", "خَلَقَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا وَأَلْقَى فِي الْأَرْضِ رَوَاسِيَ أَن تَمِيدَ بِكُمْ وَبَثَّ فِيهَا مِن كُلِّ دَابَّةٍ وَأَنزَلْنَا مِنَ السَّمَاء مَاء فَأَنبَتْنَا فِيهَا مِن كُلِّ زَوْجٍ كَرِيمٍ", "هَذَا خَلْقُ اللَّهِ فَأَرُونِي مَاذَا خَلَقَ الَّذِينَ مِن دُونِهِ بَلِ الظَّالِمُونَ فِي ضَلَالٍ مُّبِينٍ", "وَلَقَدْ آتَيْنَا لُقْمَانَ الْحِكْمَةَ أَنِ اشْكُرْ لِلَّهِ وَمَن يَشْكُرْ فَإِنَّمَا يَشْكُرُ لِنَفْسِهِ وَمَن كَفَرَ فَإِنَّ اللَّهَ غَنِيٌّ حَمِيدٌ", "وَإِذْ قَالَ لُقْمَانُ لِابْنِهِ وَهُوَ يَعِظُهُ يَا بُنَيَّ لَا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ", "وَوَصَّيْنَا الْإِنسَانَ بِوَالِدَيْهِ حَمَلَتْهُ أُمُّهُ وَهْنًا عَلَى وَهْنٍ وَفِصَالُهُ فِي عَامَيْنِ أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ إِلَيَّ الْمَصِيرُ", "وَإِن جَاهَدَاكَ عَلى أَن تُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا وَصَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوفًا وَاتَّبِعْ سَبِيلَ مَنْ أَنَابَ إِلَيَّ ثُمَّ إِلَيَّ مَرْجِعُكُمْ فَأُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ", "يَا بُنَيَّ إِنَّهَا إِن تَكُ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ فَتَكُن فِي صَخْرَةٍ أَوْ فِي السَّمَاوَاتِ أَوْ فِي الْأَرْضِ يَأْتِ بِهَا اللَّهُ إِنَّ اللَّهَ لَطِيفٌ خَبِيرٌ", "يَا بُنَيَّ أَقِمِ الصَّلَاةَ وَأْمُرْ بِالْمَعْرُوفِ وَانْهَ عَنِ الْمُنكَرِ وَاصْبِرْ عَلَى مَا أَصَابَكَ إِنَّ ذَلِكَ مِنْ عَزْمِ الْأُمُورِ", "وَلَا تُصَعِّرْ خَدَّكَ لِلنَّاسِ وَلَا تَمْشِ فِي الْأَرْضِ مَرَحًا إِنَّ اللَّهَ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ", "وَاقْصِدْ فِي مَشْيِكَ وَاغْضُضْ مِن صَوْتِكَ إِنَّ أَنكَرَ الْأَصْوَاتِ لَصَوْتُ الْحَمِيرِ", "أَلَمْ تَرَوْا أَنَّ اللَّهَ سَخَّرَ لَكُم مَّا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَأَسْبَغَ عَلَيْكُمْ نِعَمَهُ ظَاهِرَةً وَبَاطِنَةً وَمِنَ النَّاسِ مَن يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ وَلَا هُدًى وَلَا كِتَابٍ مُّنِيرٍ", "وَإِذَا قِيلَ لَهُمُ اتَّبِعُوا مَا أَنزَلَ اللَّهُ قَالُوا بَلْ نَتَّبِعُ مَا وَجَدْنَا عَلَيْهِ آبَاءنَا أَوَلَوْ كَانَ الشَّيْطَانُ يَدْعُوهُمْ إِلَى عَذَابِ السَّعِيرِ", "وَمَن يُسْلِمْ وَجْهَهُ إِلَى اللَّهِ وَهُوَ مُحْسِنٌ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَى وَإِلَى اللَّهِ عَاقِبَةُ الْأُمُورِ", "وَمَن كَفَرَ فَلَا يَحْزُنكَ كُفْرُهُ إِلَيْنَا مَرْجِعُهُمْ فَنُنَبِّئُهُم بِمَا عَمِلُوا إِنَّ اللَّهَ عَلِيمٌ بِذَاتِ الصُّدُورِ", "نُمَتِّعُهُمْ قَلِيلًا ثُمَّ نَضْطَرُّهُمْ إِلَى عَذَابٍ غَلِيظٍ", "وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ قُلِ الْحَمْدُ لِلَّهِ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ", "لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ إِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ", "وَلَوْ أَنَّمَا فِي الْأَرْضِ مِن شَجَرَةٍ أَقْلَامٌ وَالْبَحْرُ يَمُدُّهُ مِن بَعْدِهِ سَبْعَةُ أَبْحُرٍ مَّا نَفِدَتْ كَلِمَاتُ اللَّهِ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ", "مَّا خَلْقُكُمْ وَلَا بَعْثُكُمْ إِلَّا كَنَفْسٍ وَاحِدَةٍ إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ", "أَلَمْ تَرَ أَنَّ اللَّهَ يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ كُلٌّ يَجْرِي إِلَى أَجَلٍ مُّسَمًّى وَأَنَّ اللَّهَ بِمَا تَعْمَلُونَ خَبِيرٌ", "ذَلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّ مَا يَدْعُونَ مِن دُونِهِ الْبَاطِلُ وَأَنَّ اللَّهَ هُوَ الْعَلِيُّ الْكَبِيرُ", "أَلَمْ تَرَ أَنَّ الْفُلْكَ تَجْرِي فِي الْبَحْرِ بِنِعْمَتِ اللَّهِ لِيُرِيَكُم مِّنْ آيَاتِهِ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِّكُلِّ صَبَّارٍ شَكُورٍ", "وَإِذَا غَشِيَهُم مَّوْجٌ كَالظُّلَلِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ فَمِنْهُم مُّقْتَصِدٌ وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا كُلُّ خَتَّارٍ كَفُورٍ", "يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ وَاخْشَوْا يَوْمًا لَّا يَجْزِي وَالِدٌ عَن وَلَدِهِ وَلَا مَوْلُودٌ هُوَ جَازٍ عَن وَالِدِهِ شَيْئًا إِنَّ وَعْدَ اللَّهِ حَقٌّ فَلَا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا وَلَا يَغُرَّنَّكُم بِاللَّهِ الْغَرُورُ", "إِنَّ اللَّهَ عِندَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الْأَرْحَامِ وَمَا تَدْرِي نَفْسٌ مَّاذَا تَكْسِبُ غَدًا وَمَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ تَمُوتُ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ"], "name_en": "Luqman", "ayahs_en": ["Alif­Lâm­Mîm. [These letters are one of the miracles of the Qur’ân, and none but Allâh (Alone) knows their meanings].", "These are Verses of the Wise Book (the Qur’ân).", "A guide and a mercy for the Muhsinûn (good­doers)", "Those who perform As­Salât (Iqamat­as- Salât) and give Zakât and they have faith in the Hereafter with certainty.", "Such are on guidance from their Lord, and such are the successful.", "And of mankind is he who purchases idle  talks (i.e.music, singing, etc.) to mislead (men) from the Path of  Allâh without knowledge, and takes it (the Path of Allâh, the Verses of  the Qur’ân) by way of mockery. For such there will be a humiliating  torment (in the Hell-fire).", "And when Our Verses (of the Qur’ân) are  recited to such a one, he turns away in pride, as if he heard them not,  as if there were deafness in his ear. So announce to him a painful  torment.", "Verily, those who believe (in Islâmic Monotheism) and do righteous good deeds, for them are Gardens of delight (Paradise).", "To abide therein. It is a Promise of Allâh in truth. And He is the All­Mighty, the All­Wise.", "He has created the heavens without any  pillars, that you see and has set on the earth firm mountains, lest it  should shake with you. And He has scattered therein moving (living)  creatures of all kinds. And We send down water (rain) from the sky, and  We cause (plants) of every goodly kind to grow therein.", "This is the creation of Allâh. So show  Me that which those (whom you worship), besides Him have created. Nay,  the Zâlimûn (polytheists, wrong­doers and those who do not believe in  the Oneness of Allâh) are in plain error.", "And indeed We bestowed upon Luqmân  Al­Hikmah (wisdom and religious understanding, etc.) saying: ”Give  thanks to Allâh,” and whoever gives thanks, he gives thanks for (the  good of) his ownself. And whoever is unthankful, then verily, Allâh is  All­Rich (Free of all wants), Worthy of all praise.", "And (remember) when Luqmân said to his  son when he was advising him: ”O my son! Join not in worship others  with Allâh. Verily! Joining others in worship with Allâh is a great  Zûlm (wrong) indeed.", "And We have enjoined on man (to be  dutiful and good) to his parents. His mother bore him in weakness and  hardship upon weakness and hardship, and his weaning is in two years  give thanks to Me and to your parents, unto Me is the final destination.", "But if they (both) strive with you to  make you join in worship with Me others that of which you have no  knowledge, then obey them not, but behave with them in the world  kindly, and follow the path of him who turns to Me in repentance and in  obedience. Then to Me will be your return, and I shall tell you what  you used to do.", "”O my son! If it be (anything) equal to  the weight of a grain of mustard seed, and though it be in a rock, or  in the heavens or in the earth, Allâh will bring it forth. Verily,  Allâh is Subtle (in bringing out that grain), Well­Aware (of its place).", "”O my son! Aqim­is­Salât (perform  As­Salât), enjoin (people) for Al­Ma’rûf (Islâmic Monotheism and all  that is good), and forbid (people) from Al­Munkar (i.e. disbelief in  the Oneness of Allâh, polytheism of all kinds and all that is evil and  bad), and bear with patience whatever befall you. Verily! These are  some of the important commandments ordered by Allâh with no exemption.", "”And turn not your face away from men  with pride, nor walk in insolence through the earth. Verily, Allâh  likes not each arrogant boaster.", "”And be moderate (or show no insolence)  in your walking, and lower your voice. Verily, the harshest of all  voices is the voice (braying) of the ass.”", "See you not (O men) that Allâh has  subjected for you whatsoever is in the heavens and whatsoever is in the  earth, and has completed and perfected His Graces upon you, (both)  apparent (i.e Islâmic Monotheism, and the lawful pleasures of this  world, including health, good looks, etc.) and hidden [i.e. One’s Faith  in Allâh (of Islâmic Monotheism) knowledge, wisdom, guidance for doing  righteous deeds, and also the pleasures and delights of the Hereafter  in Paradise, etc.]? Yet of mankind is he who disputes about Allâh  without knowledge or guidance or a Book giving light!", "And when it is said to them: ”Follow  that which Allâh has sent down”, they say: ”Nay, we shall follow that  which we found our fathers (following).” (Would they do so) even if  Shaitân (Satan) invites them to the torment of the Fire.", "And whosoever submits his face (himself)  to Allâh [i.e.(follows Allâh’s Religion of Islâmic Monotheism),  worships Allâh (Alone) with sincere Faith in the (1) Oneness of His  Lordship,(2) Oneness of His worship, and (3) Oneness of His Names and  Qualities], while he is a Muhsin (good­doer i.e. performs good deeds  totally for Allâh’s sake without any show-off or to gain praise or fame  etc. and does them in accordance with the Sunnah of Allâh’s Messenger  Muhammad SAW), then he has grasped the most trustworthy hand­hold [Lâ  ilâha ill-Allâh (none has the right to be worshipped but Allâh)]. And  to Allâh return all matters for decision.", "And whoever disbelieved, let not his  disbelief grieve you (O Muhammad SAW),. to Us is their return, and We  shall inform them what they have done. Verily, Allâh is the All­Knower  of what is in the breasts (of men).", "We let them enjoy for a little while, then in the end We shall oblige them to (enter) a great torment.", "And if you (O Muhammad SAW) ask them:  ”Who has created the heavens and the earth,” they will certainly say:  ”Allâh.” Say: ”All the praises and thanks be to Allâh!” But most of  them know not.", "To Allâh belongs whatsoever is in the  heavens and the earth. Verily, Allâh, He is Al­Ghanî (Rich, Free of all  wants), Worthy of all praise.", "And if all the trees on the earth were  pens and the sea (were ink wherewith to write), with seven seas behind  it to add to its (supply), yet the Words of Allâh would not be  exhausted. Verily, Allâh is All­Mighty, All­Wise.", "The creation of you all and the  resurrection of you all are only as (the creation and resurrection of)  a single person. Verily, Allâh is All­Hearer, All­Seer.", "See you not (O Muhammad SAW) that Allâh  merges the night into the day (i.e. the decrease in the hours of the  night are added in the hours of the day), and merges the day into the  night (i.e. the decrease in the hours of day are added in the hours of  night), and has subjected the sun and the moon, each running its course  for a term appointed; and that Allâh is All­Aware of what you do.", "That is because Allâh, He is the Truth,  and that which they invoke besides Him is Al­Bâtil (falsehood, Satan  and all other false deities), and that Allâh, He is the Most High, the  Most Great.", "See you not that the ships sail through  the sea by Allâh’s Grace? that He may show you of His Signs? Verily, in  this are signs for every patient, grateful (person).", "And when a wave covers them like shades  (i.e. like clouds or the mountains of sea­water), they invoke Allâh,  making their invocations for Him only. But when He brings them safe to  land, there are among them those that stop in the middle, between  (Belief and disbelief). But none denies Our Signs except every  perfidious ungrateful.", "O mankind! Be afraid of your Lord (by  keeping your duty to Him and avoiding all evil), and fear a Day when no  father can avail aught for his son, nor a son avail aught for his  father. Verily, the Promise of Allâh is true, let not then this  (worldly) present life deceive you, nor let the chief deceiver (Satan)  deceive you about Allâh.", "Verily, Allâh! With Him (Alone) is the  knowledge of the Hour, He sends down the rain, and knows that which is  in the wombs. No person knows what he will earn tomorrow, and no person  knows in what land he will die. Verily, Allâh is All­Knower, All­Aware  (of things)."]}