{"name_ar": "سورة السجدة", "ayahs_ar": ["الم", "تَنزِيلُ الْكِتَابِ لَا رَيْبَ فِيهِ مِن رَّبِّ الْعَالَمِينَ", "أَمْ يَقُولُونَ افْتَرَاهُ بَلْ هُوَ الْحَقُّ مِن رَّبِّكَ لِتُنذِرَ قَوْمًا مَّا أَتَاهُم مِّن نَّذِيرٍ مِّن قَبْلِكَ لَعَلَّهُمْ يَهْتَدُونَ", "اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَى عَلَى الْعَرْشِ مَا لَكُم مِّن دُونِهِ مِن وَلِيٍّ وَلَا شَفِيعٍ أَفَلَا تَتَذَكَّرُونَ", "يُدَبِّرُ الْأَمْرَ مِنَ السَّمَاء إِلَى الْأَرْضِ ثُمَّ يَعْرُجُ إِلَيْهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ أَلْفَ سَنَةٍ مِّمَّا تَعُدُّونَ", "ذَلِكَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيزُ الرَّحِيمُ", "الَّذِي أَحْسَنَ كُلَّ شَيْءٍ خَلَقَهُ وَبَدَأَ خَلْقَ الْإِنسَانِ مِن طِينٍ", "ثُمَّ جَعَلَ نَسْلَهُ مِن سُلَالَةٍ مِّن مَّاء مَّهِينٍ", "ثُمَّ سَوَّاهُ وَنَفَخَ فِيهِ مِن رُّوحِهِ وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ قَلِيلًا مَّا تَشْكُرُونَ", "وَقَالُوا أَئِذَا ضَلَلْنَا فِي الْأَرْضِ أَئِنَّا لَفِي خَلْقٍ جَدِيدٍ بَلْ هُم بِلِقَاء رَبِّهِمْ كَافِرُونَ", "قُلْ يَتَوَفَّاكُم مَّلَكُ الْمَوْتِ الَّذِي وُكِّلَ بِكُمْ ثُمَّ إِلَى رَبِّكُمْ تُرْجَعُونَ", "وَلَوْ تَرَى إِذِ الْمُجْرِمُونَ نَاكِسُو رُؤُوسِهِمْ عِندَ رَبِّهِمْ رَبَّنَا أَبْصَرْنَا وَسَمِعْنَا فَارْجِعْنَا نَعْمَلْ صَالِحًا إِنَّا مُوقِنُونَ", "وَلَوْ شِئْنَا لَآتَيْنَا كُلَّ نَفْسٍ هُدَاهَا وَلَكِنْ حَقَّ الْقَوْلُ مِنِّي لَأَمْلَأَنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ أَجْمَعِينَ", "فَذُوقُوا بِمَا نَسِيتُمْ لِقَاء يَوْمِكُمْ هَذَا إِنَّا نَسِينَاكُمْ وَذُوقُوا عَذَابَ الْخُلْدِ بِمَا كُنتُمْ تَعْمَلُونَ", "إِنَّمَا يُؤْمِنُ بِآيَاتِنَا الَّذِينَ إِذَا ذُكِّرُوا بِهَا خَرُّوا سُجَّدًا وَسَبَّحُوا بِحَمْدِ رَبِّهِمْ وَهُمْ لَا يَسْتَكْبِرُونَ", "تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ", "فَلَا تَعْلَمُ نَفْسٌ مَّا أُخْفِيَ لَهُم مِّن قُرَّةِ أَعْيُنٍ جَزَاء بِمَا كَانُوا يَعْمَلُونَ", "أَفَمَن كَانَ مُؤْمِنًا كَمَن كَانَ فَاسِقًا لَّا يَسْتَوُونَ", "أَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَلَهُمْ جَنَّاتُ الْمَأْوَى نُزُلًا بِمَا كَانُوا يَعْمَلُونَ", "وَأَمَّا الَّذِينَ فَسَقُوا فَمَأْوَاهُمُ النَّارُ كُلَّمَا أَرَادُوا أَن يَخْرُجُوا مِنْهَا أُعِيدُوا فِيهَا وَقِيلَ لَهُمْ ذُوقُوا عَذَابَ النَّارِ الَّذِي كُنتُم بِهِ تُكَذِّبُونَ", "وَلَنُذِيقَنَّهُمْ مِنَ الْعَذَابِ الْأَدْنَى دُونَ الْعَذَابِ الْأَكْبَرِ لَعَلَّهُمْ يَرْجِعُونَ", "وَمَنْ أَظْلَمُ مِمَّن ذُكِّرَ بِآيَاتِ رَبِّهِ ثُمَّ أَعْرَضَ عَنْهَا إِنَّا مِنَ الْمُجْرِمِينَ مُنتَقِمُونَ", "وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ فَلَا تَكُن فِي مِرْيَةٍ مِّن لِّقَائِهِ وَجَعَلْنَاهُ هُدًى لِّبَنِي إِسْرَائِيلَ", "وَجَعَلْنَا مِنْهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا لَمَّا صَبَرُوا وَكَانُوا بِآيَاتِنَا يُوقِنُونَ", "إِنَّ رَبَّكَ هُوَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ", "أَوَلَمْ يَهْدِ لَهُمْ كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّنَ الْقُرُونِ يَمْشُونَ فِي مَسَاكِنِهِمْ إِنَّ فِي ذَلِكَ لَآيَاتٍ أَفَلَا يَسْمَعُونَ", "أَوَلَمْ يَرَوْا أَنَّا نَسُوقُ الْمَاء إِلَى الْأَرْضِ الْجُرُزِ فَنُخْرِجُ بِهِ زَرْعًا تَأْكُلُ مِنْهُ أَنْعَامُهُمْ وَأَنفُسُهُمْ أَفَلَا يُبْصِرُونَ", "وَيَقُولُونَ مَتَى هَذَا الْفَتْحُ إِن كُنتُمْ صَادِقِينَ", "قُلْ يَوْمَ الْفَتْحِ لَا يَنفَعُ الَّذِينَ كَفَرُوا إِيمَانُهُمْ وَلَا هُمْ يُنظَرُونَ", "فَأَعْرِضْ عَنْهُمْ وَانتَظِرْ إِنَّهُم مُّنتَظِرُونَ"], "name_en": "As-Sajdah", "ayahs_en": ["Alif­Lâm­Mîm. [These letters are one of the miracles of the Qur’ân, and none but Allâh (Alone) knows their meanings.]", "The revelation of the Book (this Qur’ân)  is from the Lord of the ’Alamîn (mankind, jinns and all that exists) in  which there is not doubt!", "Or say they: ”He (Muhammad SAW) has  fabricated it?” Nay, it is the truth from your Lord, that you may warn  a people to whom no warner has come before you (O Muhammad SAW), in  order that they may be guided.", "Allâh it is He Who has created the  heavens and the earth, and all that is between them in six Days. Then  He Istawâ (rose over) the Throne (in a manner that suits His Majesty).  You (mankind) have none, besides Him, as a Walî (protector or helper  etc.) or an intercessor. Will you not then remember (or be admonished)?", "He arranges (every) affair from the  heavens to the earth, then it (affair) will go up to Him, in one Day,  the space whereof is a thousand years of your reckoning (i.e. reckoning  of our present world’s time).", "That is He, the All­Knower of the unseen and the seen, the All­Mighty, the Most Merciful.", "Who made everything He has created good, and He began the creation of man from clay.", "Then He made his offspring from semen of worthless water (male and female sexual discharge).", "Then He fashioned him in due proportion,  and breathed into him the soul (created by Allâh for that person), and  He gave you hearing (ears), sight (eyes) and hearts. Little is the  thanks you give!", "And they say: ”When we are (dead and  become) lost in the earth, shall we indeed be recreated anew?” Nay, but  they deny the Meeting with their Lord!", "Say: ”The angel of death, who is set over you, will take your souls, then you shall be brought to your Lord.”", "And if you only could see when the  Mujrimûn (criminals, disbelievers, polytheists, sinners, etc.) shall  hang their heads before their Lord (saying): ”Our Lord! We have now  seen and heard, so send us back (to the world), we will do righteous  good deeds. Verily! We now believe with certainty.”", "And if We had willed, surely! We would  have given every person his guidance, but the Word from Me took effect  (about evil­doers), that I will fill Hell with jinn and mankind  together.", "Then taste you (the torment of the Fire)  because of your forgetting the Meeting of this Day of yours, (and)  surely! We too will forget you, so taste you the abiding torment for  what you used to do.", "Only those believe in Our Ayât (proofs,  evidences, verses, lessons, signs, revelations, etc.), who, when they  are reminded of them fall down prostrate, and glorify the Praises of  their Lord, and they are not proud.[ Sajdah ]", "Their sides forsake their beds, to  invoke their Lord in fear and hope, and they spend (charity in Allâh’s  Cause) out of what We have bestowed on them.", "No person knows what is kept hidden for them of joy as a reward for what they used to do.", "Is then he who is a believer like him who is Fâsiq (disbeliever and disobedient to Allâh)? Not equal are they.", "As for those who believe (in the Oneness  of Allâh Islâmic Monotheism) and do righteous good deeds, for them are  Gardens (Paradise) as an entertainment, for what they used to do.", "And as for those who are Fâsiqûn  (disbelievers and disobedient to Allâh), their abode will be the Fire,  every time they wish to get away therefrom, they will be put back  thereto, and it will be said to them: ”Taste you the torment of the  Fire which you used to deny.”", "And verily, We will make them taste of  the near torment (i.e. the torment in the life of this world, i.e.  disasters, calamities, etc.) prior to the supreme torment (in the  Hereafter), in order that they may (repent and) return (i.e. accept  Islâm).", "And who does more wrong than he who is  reminded of the Ayât (proofs, evidences, verses, lessons, signs,  revelations, etc.) of his Lord, then he turns aside therefrom? Verily,  We shall exact retribution from the Mujrimûn (criminals, disbelievers,  polytheists, sinners, etc.).", "And indeed We gave Mûsa (Moses) the  Scripture [the Taurât (Torah)]. So be not you in doubt of meeting him  [i.e.when you met Mûsa (Moses) during the night of Al­Isra’ and  Al­Mi’râj over the heavens]. And We made it [the Taurât (Torah)] a  guide to the Children of Israel.", "And We made from among them (Children of  Israel), leaders, giving guidance under Our Command, when they were  patient and used to believe with certainty in Our Ayât (proofs,  evidences, verses, lessons, signs, revelations, etc.).", "Verily, your Lord will judge between them on the Day of Resurrection, concerning that wherein they used to differ.", "Is it not a guidance for them, how many  generations We have destroyed before them in whose dwellings they do  walk about? Verily, therein indeed are signs. Would they not then  listen?", "Have they not seen how We drive water  (rain clouds) to the dry land without any vegetation, and therewith  bring forth crops providing food for their cattle and themselves? Will  they not then see?", "They say: ”When will this Al­Fath  (Decision) be (between us and you, i.e. the Day of Resurrection), if  you are telling the truth?”", "Say: ”On the Day of Al­Fath (Decision),  no profit will it be to those who disbelieve if they (then) believe!  Nor will they be granted a respite.”", "So turn aside from them (O Muhammad SAW) and await, verily they (too) are awaiting."]}