{"name_ar": "سورة فاطر", "ayahs_ar": ["الْحَمْدُ لِلَّهِ فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ جَاعِلِ الْمَلَائِكَةِ رُسُلًا أُولِي أَجْنِحَةٍ مَّثْنَى وَثُلَاثَ وَرُبَاعَ يَزِيدُ فِي الْخَلْقِ مَا يَشَاء إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ", "مَا يَفْتَحِ اللَّهُ لِلنَّاسِ مِن رَّحْمَةٍ فَلَا مُمْسِكَ لَهَا وَمَا يُمْسِكْ فَلَا مُرْسِلَ لَهُ مِن بَعْدِهِ وَهُوَ الْعَزِيزُ الْحَكِيمُ", "يَا أَيُّهَا النَّاسُ اذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ هَلْ مِنْ خَالِقٍ غَيْرُ اللَّهِ يَرْزُقُكُم مِّنَ السَّمَاء وَالْأَرْضِ لَا إِلَهَ إِلَّا هُوَ فَأَنَّى تُؤْفَكُونَ", "وَإِن يُكَذِّبُوكَ فَقَدْ كُذِّبَتْ رُسُلٌ مِّن قَبْلِكَ وَإِلَى اللَّهِ تُرْجَعُ الأمُورُ", "يَا أَيُّهَا النَّاسُ إِنَّ وَعْدَ اللَّهِ حَقٌّ فَلَا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا وَلَا يَغُرَّنَّكُم بِاللَّهِ الْغَرُورُ", "إِنَّ الشَّيْطَانَ لَكُمْ عَدُوٌّ فَاتَّخِذُوهُ عَدُوًّا إِنَّمَا يَدْعُو حِزْبَهُ لِيَكُونُوا مِنْ أَصْحَابِ السَّعِيرِ", "الَّذِينَ كَفَرُوا لَهُمْ عَذَابٌ شَدِيدٌ وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُم مَّغْفِرَةٌ وَأَجْرٌ كَبِيرٌ", "أَفَمَن زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَنًا فَإِنَّ اللَّهَ يُضِلُّ مَن يَشَاء وَيَهْدِي مَن يَشَاء فَلَا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَرَاتٍ إِنَّ اللَّهَ عَلِيمٌ بِمَا يَصْنَعُونَ", "وَاللَّهُ الَّذِي أَرْسَلَ الرِّيَاحَ فَتُثِيرُ سَحَابًا فَسُقْنَاهُ إِلَى بَلَدٍ مَّيِّتٍ فَأَحْيَيْنَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا كَذَلِكَ النُّشُورُ", "مَن كَانَ يُرِيدُ الْعِزَّةَ فَلِلَّهِ الْعِزَّةُ جَمِيعًا إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهُ وَالَّذِينَ يَمْكُرُونَ السَّيِّئَاتِ لَهُمْ عَذَابٌ شَدِيدٌ وَمَكْرُ أُوْلَئِكَ هُوَ يَبُورُ", "وَاللَّهُ خَلَقَكُم مِّن تُرَابٍ ثُمَّ مِن نُّطْفَةٍ ثُمَّ جَعَلَكُمْ أَزْوَاجًا وَمَا تَحْمِلُ مِنْ أُنثَى وَلَا تَضَعُ إِلَّا بِعِلْمِهِ وَمَا يُعَمَّرُ مِن مُّعَمَّرٍ وَلَا يُنقَصُ مِنْ عُمُرِهِ إِلَّا فِي كِتَابٍ إِنَّ ذَلِكَ عَلَى اللَّهِ يَسِيرٌ", "وَمَا يَسْتَوِي الْبَحْرَانِ هَذَا عَذْبٌ فُرَاتٌ سَائِغٌ شَرَابُهُ وَهَذَا مِلْحٌ أُجَاجٌ وَمِن كُلٍّ تَأْكُلُونَ لَحْمًا طَرِيًّا وَتَسْتَخْرِجُونَ حِلْيَةً تَلْبَسُونَهَا وَتَرَى الْفُلْكَ فِيهِ مَوَاخِرَ لِتَبْتَغُوا مِن فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ", "يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ كُلٌّ يَجْرِي لِأَجَلٍ مُّسَمًّى ذَلِكُمُ اللَّهُ رَبُّكُمْ لَهُ الْمُلْكُ وَالَّذِينَ تَدْعُونَ مِن دُونِهِ مَا يَمْلِكُونَ مِن قِطْمِيرٍ", "إِن تَدْعُوهُمْ لَا يَسْمَعُوا دُعَاءكُمْ وَلَوْ سَمِعُوا مَا اسْتَجَابُوا لَكُمْ وَيَوْمَ الْقِيَامَةِ يَكْفُرُونَ بِشِرْكِكُمْ وَلَا يُنَبِّئُكَ مِثْلُ خَبِيرٍ", "يَا أَيُّهَا النَّاسُ أَنتُمُ الْفُقَرَاء إِلَى اللَّهِ وَاللَّهُ هُوَ الْغَنِيُّ الْحَمِيدُ", "إِن يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ", "وَمَا ذَلِكَ عَلَى اللَّهِ بِعَزِيزٍ", "وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى وَإِن تَدْعُ مُثْقَلَةٌ إِلَى حِمْلِهَا لَا يُحْمَلْ مِنْهُ شَيْءٌ وَلَوْ كَانَ ذَا قُرْبَى إِنَّمَا تُنذِرُ الَّذِينَ يَخْشَوْنَ رَبَّهُم بِالغَيْبِ وَأَقَامُوا الصَّلَاةَ وَمَن تَزَكَّى فَإِنَّمَا يَتَزَكَّى لِنَفْسِهِ وَإِلَى اللَّهِ الْمَصِيرُ", "وَمَا يَسْتَوِي الْأَعْمَى وَالْبَصِيرُ", "وَلَا الظُّلُمَاتُ وَلَا النُّورُ", "وَلَا الظِّلُّ وَلَا الْحَرُورُ", "وَمَا يَسْتَوِي الْأَحْيَاء وَلَا الْأَمْوَاتُ إِنَّ اللَّهَ يُسْمِعُ مَن يَشَاء وَمَا أَنتَ بِمُسْمِعٍ مَّن فِي الْقُبُورِ", "إِنْ أَنتَ إِلَّا نَذِيرٌ", "إِنَّا أَرْسَلْنَاكَ بِالْحَقِّ بَشِيرًا وَنَذِيرًا وَإِن مِّنْ أُمَّةٍ إِلَّا خلَا فِيهَا نَذِيرٌ", "وَإِن يُكَذِّبُوكَ فَقَدْ كَذَّبَ الَّذِينَ مِن قَبْلِهِمْ جَاءتْهُمْ رُسُلُهُم بِالْبَيِّنَاتِ وَبِالزُّبُرِ وَبِالْكِتَابِ الْمُنِيرِ", "ثُمَّ أَخَذْتُ الَّذِينَ كَفَرُوا فَكَيْفَ كَانَ نَكِيرِ", "أَلَمْ تَرَ أَنَّ اللَّهَ أَنزَلَ مِنَ السَّمَاء مَاء فَأَخْرَجْنَا بِهِ ثَمَرَاتٍ مُّخْتَلِفًا أَلْوَانُهَا وَمِنَ الْجِبَالِ جُدَدٌ بِيضٌ وَحُمْرٌ مُّخْتَلِفٌ أَلْوَانُهَا وَغَرَابِيبُ سُودٌ", "وَمِنَ النَّاسِ وَالدَّوَابِّ وَالْأَنْعَامِ مُخْتَلِفٌ أَلْوَانُهُ كَذَلِكَ إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاء إِنَّ اللَّهَ عَزِيزٌ غَفُورٌ", "إِنَّ الَّذِينَ يَتْلُونَ كِتَابَ اللَّهِ وَأَقَامُوا الصَّلَاةَ وَأَنفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً يَرْجُونَ تِجَارَةً لَّن تَبُورَ", "لِيُوَفِّيَهُمْ أُجُورَهُمْ وَيَزِيدَهُم مِّن فَضْلِهِ إِنَّهُ غَفُورٌ شَكُورٌ", "وَالَّذِي أَوْحَيْنَا إِلَيْكَ مِنَ الْكِتَابِ هُوَ الْحَقُّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ إِنَّ اللَّهَ بِعِبَادِهِ لَخَبِيرٌ بَصِيرٌ", "ثُمَّ أَوْرَثْنَا الْكِتَابَ الَّذِينَ اصْطَفَيْنَا مِنْ عِبَادِنَا فَمِنْهُمْ ظَالِمٌ لِّنَفْسِهِ وَمِنْهُم مُّقْتَصِدٌ وَمِنْهُمْ سَابِقٌ بِالْخَيْرَاتِ بِإِذْنِ اللَّهِ ذَلِكَ هُوَ الْفَضْلُ الْكَبِيرُ", "جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍ وَلُؤْلُؤًا وَلِبَاسُهُمْ فِيهَا حَرِيرٌ", "وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ عَنَّا الْحَزَنَ إِنَّ رَبَّنَا لَغَفُورٌ شَكُورٌ", "الَّذِي أَحَلَّنَا دَارَ الْمُقَامَةِ مِن فَضْلِهِ لَا يَمَسُّنَا فِيهَا نَصَبٌ وَلَا يَمَسُّنَا فِيهَا لُغُوبٌ", "وَالَّذِينَ كَفَرُوا لَهُمْ نَارُ جَهَنَّمَ لَا يُقْضَى عَلَيْهِمْ فَيَمُوتُوا وَلَا يُخَفَّفُ عَنْهُم مِّنْ عَذَابِهَا كَذَلِكَ نَجْزِي كُلَّ كَفُورٍ", "وَهُمْ يَصْطَرِخُونَ فِيهَا رَبَّنَا أَخْرِجْنَا نَعْمَلْ صَالِحًا غَيْرَ الَّذِي كُنَّا نَعْمَلُ أَوَلَمْ نُعَمِّرْكُم مَّا يَتَذَكَّرُ فِيهِ مَن تَذَكَّرَ وَجَاءكُمُ النَّذِيرُ فَذُوقُوا فَمَا لِلظَّالِمِينَ مِن نَّصِيرٍ", "إِنَّ اللَّهَ عَالِمُ غَيْبِ السَّمَاوَاتِ وَالْأَرْضِ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ", "هُوَ الَّذِي جَعَلَكُمْ خَلَائِفَ فِي الْأَرْضِ فَمَن كَفَرَ فَعَلَيْهِ كُفْرُهُ وَلَا يَزِيدُ الْكَافِرِينَ كُفْرُهُمْ عِندَ رَبِّهِمْ إِلَّا مَقْتًا وَلَا يَزِيدُ الْكَافِرِينَ كُفْرُهُمْ إِلَّا خَسَارًا", "قُلْ أَرَأَيْتُمْ شُرَكَاءكُمُ الَّذِينَ تَدْعُونَ مِن دُونِ اللَّهِ أَرُونِي مَاذَا خَلَقُوا مِنَ الْأَرْضِ أَمْ لَهُمْ شِرْكٌ فِي السَّمَاوَاتِ أَمْ آتَيْنَاهُمْ كِتَابًا فَهُمْ عَلَى بَيِّنَةٍ مِّنْهُ بَلْ إِن يَعِدُ الظَّالِمُونَ بَعْضُهُم بَعْضًا إِلَّا غُرُورًا", "إِنَّ اللَّهَ يُمْسِكُ السَّمَاوَاتِ وَالْأَرْضَ أَن تَزُولَا وَلَئِن زَالَتَا إِنْ أَمْسَكَهُمَا مِنْ أَحَدٍ مِّن بَعْدِهِ إِنَّهُ كَانَ حَلِيمًا غَفُورًا", "وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لَئِن جَاءهُمْ نَذِيرٌ لَّيَكُونُنَّ أَهْدَى مِنْ إِحْدَى الْأُمَمِ فَلَمَّا جَاءهُمْ نَذِيرٌ مَّا زَادَهُمْ إِلَّا نُفُورًا", "اسْتِكْبَارًا فِي الْأَرْضِ وَمَكْرَ السَّيِّئِ وَلَا يَحِيقُ الْمَكْرُ السَّيِّئُ إِلَّا بِأَهْلِهِ فَهَلْ يَنظُرُونَ إِلَّا سُنَّتَ الْأَوَّلِينَ فَلَن تَجِدَ لِسُنَّتِ اللَّهِ تَبْدِيلًا وَلَن تَجِدَ لِسُنَّتِ اللَّهِ تَحْوِيلًا", "أَوَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِن قَبْلِهِمْ وَكَانُوا أَشَدَّ مِنْهُمْ قُوَّةً وَمَا كَانَ اللَّهُ لِيُعْجِزَهُ مِن شَيْءٍ فِي السَّمَاوَاتِ وَلَا فِي الْأَرْضِ إِنَّهُ كَانَ عَلِيمًا قَدِيرًا", "وَلَوْ يُؤَاخِذُ اللَّهُ النَّاسَ بِمَا كَسَبُوا مَا تَرَكَ عَلَى ظَهْرِهَا مِن دَابَّةٍ وَلَكِن يُؤَخِّرُهُمْ إِلَى أَجَلٍ مُّسَمًّى فَإِذَا جَاء أَجَلُهُمْ فَإِنَّ اللَّهَ كَانَ بِعِبَادِهِ بَصِيرًا"], "name_en": "Fatir", "ayahs_en": ["All the praises and thanks be to Allâh,  the (only) Originator [or the (only) Creator] of the heavens and the  earth, Who made the angels messengers with wings, - two or three or  four. He increases in creation what He wills. Verily, Allâh is Able to  do all things.", "Whatever of mercy (i.e.of good), Allâh  may grant to mankind, none can withhold it, and whatever He may  withhold, none can grant it thereafter. And He is the All­Mighty, the  All­Wise.", "O mankind! Remember the Grace of Allâh  upon you! Is there any creator other than Allâh who provides for you  from the sky (rain) and the earth? Lâ ilâha illa Huwa (none has the  right to be worshipped but He). How then are you turning away (from  Him)?", "And if they belie you (O Muhammad SAW), so were Messengers belied before you. And to Allâh return all matters (for decision).", "O mankind! Verily, the Promise of Allâh  is true. So let not this present life deceive you, and let not the  chief deceiver (Satan) deceive you about Allâh.", "Surely, Shaitân (Satan) is an enemy to  you, so take (treat) him as an enemy. He only invites his Hizb  (followers) that they may become the dwellers of the blazing Fire.", "Those who disbelieve, theirs will be a  severe torment; and those who believe (in the Oneness of Allâh Islâmic  Monotheism) and do righteous good deeds, theirs will be forgiveness and  a great reward (i.e. Paradise).", "Is he, then, to whom the evil of his  deeds made fair­seeming, so that he considers it as good (equal to one  who is rightly guided)? Verily, Allâh sends astray whom He wills, and  guides whom He wills. So destroy not yourself (O Muhammad SAW) in  sorrow for them. Truly, Allâh is the All­Knower of what they do!", "And it is Allâh Who sends the winds, so  that they raise up the clouds, and We drive them to a dead land, and  revive therewith the earth after its death. As such (will be) the  Resurrection!", "Whosoever desires honour, power and  glory then to Allâh belong all honour, power and glory [and one can get  honour, power and glory only by obeying and worshipping Allâh (Alone)].  To Him ascend (all) the goodly words, and the righteous deeds exalt it  (the goodly words i.e. the goodly words are not accepted by Allâh  unless and until they are followed by good deeds), but those who plot  evils, theirs will be severe torment. And the plotting of such will  perish.", "And Allâh did create you (Adam) from  dust, then from Nutfah (male and female discharge semen drops i.e.  Adam’s offspring), then He made you pairs (male and female). And no  female conceives or gives birth, but with His Knowledge. And no aged  man is granted a length of life, nor is a part cut off from his life  (or another man’s life), but is in a Book (Al­Lauh Al­Mahfûz) Surely,  that is easy for Allâh.", "And the two seas (kinds of water) are  not alike, this fresh sweet, and pleasant to drink, and that saltish  and bitter. And from them both you eat fresh tender meat (fish), and  derive the ornaments that you wear. And you see the ships cleaving (the  sea­water as they sail through it), that you may seek of His Bounty,  and that you may give thanks.", "He merges the night into the day (i.e.  the decrease in the hours of the night are added to the hours of the  day), and He merges the day into the night (i.e. the decrease in the  hours of the day are added to the hours of the night). And He has  subjected the sun and the moon, each runs its course for a term  appointed. Such is Allâh your Lord; His is the kingdom. And those, whom  you invoke or call upon instead of Him, own not even a Qitmîr (the thin  membrane over the date­stone).", "If you invoke (or call upon) them, they  hear not your call, and if (in case) they were to hear, they could not  grant it (your request) to you. And on the Day of Resurrection, they  will disown your worshipping them. And none can inform you (O Muhammad  SAW) like Him Who is the All­Knower (of each and everything).", "O mankind! it is you who stand in need of Allâh, but Allâh is Rich (Free of all wants and needs), Worthy of all praise.", "If He will, He could destroy you and bring about a new creation.", "And that is not hard for Allâh.", "And no bearer of burdens shall bear  another’s burden, and if one heavily laden calls another to (bear) his  load, nothing of it will be lifted even though he be near of kin. You  (O Muhammad SAW) can warn only those who fear their Lord unseen, and  perform As-Salât (Iqâmat­as­Salât). And he who purifies himself (from  all kinds of sins), then he purifies only for the benefit of his  ownself. And to Allâh is the (final) Return (of all).", "Not alike are the blind (disbelievers in Islâmic Monotheism) and the seeing (believers in Islâmic Monotheism).", "Nor are (alike) the darkness (disbelief) and the light (Belief in Islâmic Monotheism).", "Nor are (alike) the shade and the sun’s heat.", "Nor are (alike) the living (believers)  and the dead (disbelievers). Verily, Allâh makes whom He will hear, but  you cannot make hear those who are in graves.", "You (O Muhammad SAW) are only a warner  (i.e. your duty is to convey Allâh’s Message to mankind but the  guidance is in Allâh’s Hand).", "Verily! We have sent you with the truth,  a bearer of glad tidings, and a warner. And there never was a nation  but a warner had passed among them.", "And if they belie you, those before them  also belied. Their Messengers came to them with clear signs, and with  the Scriptures, and the book giving light.", "Then I took hold of those who disbelieved, and how terrible was My denial (punishment)!", "See you not that Allâh sends down water  (rain) from the sky, and We produce therewith fruits of varying  colours, and among the mountains are streaks white and red, of varying  colours and (others) very black.", "And of men and Ad­Dawâb (moving living  creatures, beasts, etc.), and cattle, in like manner of various  colours. It is only those who have knowledge among His slaves that fear  Allâh. Verily, Allâh is All­Mighty, Oft­Forgiving.", "Verily, those who recite the Book of  Allâh (this Qur’ân), and perform As­Salât (Iqâmat­as­Salât), and spend  (in charity) out of what We have provided for them, secretly and  openly, hope for a (sure) trade­gain that will never perish.", "That He may pay them their wages in  full, and give them (even) more, out of His Grace. Verily! He is  Oft­Forgiving, Most Ready to appreciate (good deeds and to recompense).", "And what We have inspired in you (O  Muhammad SAW), of the Book (the Qur’ân), it is the (very) truth [that  you (Muhammad SAW) and your followers must act on its instructions],  confirming that which was (revealed) before it. Verily! Allâh is indeed  All­Aware, and All­Seer of His slaves.", "Then We gave the Book the Qur’ân) for  inheritance to such of Our slaves whom We chose (the followers of  Muhammad SAW). Then of them are some who wrong their ownselves, and of  them are some who follow a middle course, and of them are some who are,  by Allâh’s Leave, foremost in good deeds. That (inheritance of the  Qur’ân), that is indeed a great grace.", "’Adn (Eden) Paradise (everlasting  Gardens) will they enter, therein will they be adorned with bracelets  of gold and pearls, and their garments there will be of silk (i.e. in  Paradise).", "And they will say: ”All the praises and  thanks be to Allâh, Who has removed from us (all) grief. Verily, our  Lord is indeed Oft­Forgiving, Most Ready to appreciate (good deeds and  to recompense).", "Who, out of His Grace, has lodged us in  a home that will last forever; there, toil will touch us not, nor  weariness will touch us.”", "But those who disbelieve, (in the  Oneness of Allâh - Islâmic Monotheism) for them will be the Fire of  Hell. Neither it will have a complete killing effect on them so that  they die, nor shall its torment be lightened for them. Thus do We  requite every disbeliever!", "Therein they will cry: ”Our Lord! Bring  us out, we shall do righteous good deeds, not (the evil deeds) that we  used to do.” (Allâh will reply): ”Did We not give you lives long  enough, so that whosoever would receive admonition, - could receive it?  And the warner came to you. So taste you (the evil of your deeds). For  the Zâlimûn (polytheists and wrong­doers, etc.) there is no helper.”", "Verily, Allâh is the All­Knower of the  unseen of the heavens and the earth. Verily! He is the All­Knower of  that is in the breasts.", "He it is Who has made you successors  generations after generations in the earth, so whosoever disbelieves  (in Islâmic Monotheism) on him will be his disbelief. And the disbelief  of the disbelievers adds nothing but hatred with their Lord. And the  disbelief of the disbelievers adds nothing but loss.", "Say (O Muhammad SAW): ”Tell me or inform  me (what) do you think about your (so­called) partner­gods to whom you  call upon besides Allâh, show me, what they have created of the earth?  Or have they any share in the heavens? Or have We given them a Book, so  that they act on clear proof therefrom? Nay, the Zâlimûn (polytheists  and wrong­doers, etc.) promise one another nothing but delusions.”", "Verily! Allâh grasps the heavens and the  earth lest they move away from their places, and if they were to move  away from their places, there is not one that could grasp them after  Him. Truly, He is Ever Most Forbearing, Oft­Forgiving.", "And they swore by Allâh their most  binding oath, that if a warner came to them, they would be more guided  than any of the nations (before them), yet when a warner (Muhammad SAW)  came to them, it increased in them nothing but flight (from the truth),", "(They took to flight because of their)  arrogance in the land and their plotting of evil. But the evil plot  encompasses only him who makes it. Then, can they expect anything  (else), but the Sunnah (way of dealing) of the peoples of old? So no  change will you find in Allâh’s Sunnah (way of dealing), and no turning  off will you find in Allâh’s Sunnah (way of dealing).", "Have they not travelled in the land, and  seen what was the end of those before them, and they were superior to  them in power? Allâh is not such that anything in the heavens or in the  earth escapes Him. Verily, He is All­Knowing, All­Omnipotent.", "And if Allâh were to punish men for that  which they earned, He would not leave a moving (living) creature on the  surface of the earth, but He gives them respite to an appointed term,  and when their term comes, then verily, Allâh is Ever All­Seer of His  slaves."]}