{"name_ar": "سورة يس", "ayahs_ar": ["يس", "وَالْقُرْآنِ الْحَكِيمِ", "إِنَّكَ لَمِنَ الْمُرْسَلِينَ", "عَلَى صِرَاطٍ مُّسْتَقِيمٍ", "تَنزِيلَ الْعَزِيزِ الرَّحِيمِ", "لِتُنذِرَ قَوْمًا مَّا أُنذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ", "لَقَدْ حَقَّ الْقَوْلُ عَلَى أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ", "إِنَّا جَعَلْنَا فِي أَعْنَاقِهِمْ أَغْلاَلاً فَهِيَ إِلَى الأَذْقَانِ فَهُم مُّقْمَحُونَ", "وَجَعَلْنَا مِن بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لاَ يُبْصِرُونَ", "وَسَوَاء عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لاَ يُؤْمِنُونَ", "إِنَّمَا تُنذِرُ مَنِ اتَّبَعَ الذِّكْرَ وَخَشِيَ الرَّحْمَن بِالْغَيْبِ فَبَشِّرْهُ بِمَغْفِرَةٍ وَأَجْرٍ كَرِيمٍ", "إِنَّا نَحْنُ نُحْيِي الْمَوْتَى وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ وَكُلَّ شَيْءٍ أحْصَيْنَاهُ فِي إِمَامٍ مُبِينٍ", "وَاضْرِبْ لَهُم مَّثَلاً أَصْحَابَ الْقَرْيَةِ إِذْ جَاءهَا الْمُرْسَلُونَ", "إِذْ أَرْسَلْنَا إِلَيْهِمُ اثْنَيْنِ فَكَذَّبُوهُمَا فَعَزَّزْنَا بِثَالِثٍ فَقَالُوا إِنَّا إِلَيْكُم مُّرْسَلُونَ", "قَالُوا مَا أَنتُمْ إِلاَّ بَشَرٌ مِّثْلُنَا وَمَا أَنزَلَ الرَّحْمن مِن شَيْءٍ إِنْ أَنتُمْ إِلاَّ تَكْذِبُونَ", "قَالُوا رَبُّنَا يَعْلَمُ إِنَّا إِلَيْكُمْ لَمُرْسَلُونَ", "وَمَا عَلَيْنَا إِلاَّ الْبَلاَغُ الْمُبِينُ", "قَالُوا إِنَّا تَطَيَّرْنَا بِكُمْ لَئِن لَّمْ تَنتَهُوا لَنَرْجُمَنَّكُمْ وَلَيَمَسَّنَّكُم مِّنَّا عَذَابٌ أَلِيمٌ", "قَالُوا طَائِرُكُمْ مَعَكُمْ أَئِن ذُكِّرْتُم بَلْ أَنتُمْ قَوْمٌ مُّسْرِفُونَ", "وَجَاء مِنْ أَقْصَى الْمَدِينَةِ رَجُلٌ يَسْعَى قَالَ يَا قَوْمِ اتَّبِعُوا الْمُرْسَلِينَ", "اتَّبِعُوا مَن لاَّ يَسْأَلُكُمْ أَجْرًا وَهُم مُّهْتَدُونَ", "وَمَا لِي لاَ أَعْبُدُ الَّذِي فَطَرَنِي وَإِلَيْهِ تُرْجَعُونَ", "أَأَتَّخِذُ مِن دُونِهِ آلِهَةً إِن يُرِدْنِ الرَّحْمَن بِضُرٍّ لاَّ تُغْنِ عَنِّي شَفَاعَتُهُمْ شَيْئًا وَلاَ يُنقِذُونِ", "إِنِّي إِذًا لَّفِي ضَلاَلٍ مُّبِينٍ", "إِنِّي آمَنتُ بِرَبِّكُمْ فَاسْمَعُونِ", "قِيلَ ادْخُلِ الْجَنَّةَ قَالَ يَا لَيْتَ قَوْمِي يَعْلَمُونَ", "بِمَا غَفَرَ لِي رَبِّي وَجَعَلَنِي مِنَ الْمُكْرَمِينَ", "وَمَا أَنزَلْنَا عَلَى قَوْمِهِ مِن بَعْدِهِ مِنْ جُندٍ مِّنَ السَّمَاء وَمَا كُنَّا مُنزِلِينَ", "إِن كَانَتْ إِلاَّ صَيْحَةً وَاحِدَةً فَإِذَا هُمْ خَامِدُونَ", "يَا حَسْرَةً عَلَى الْعِبَادِ مَا يَأْتِيهِم مِّن رَّسُولٍ إِلاَّ كَانُوا بِهِ يَسْتَهْزِؤُون", "أَلَمْ يَرَوْا كَمْ أَهْلَكْنَا قَبْلَهُم مِّنْ الْقُرُونِ أَنَّهُمْ إِلَيْهِمْ لاَ يَرْجِعُونَ", "وَإِن كُلٌّ لَّمَّا جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ", "وَآيَةٌ لَّهُمُ الْأَرْضُ الْمَيْتَةُ أَحْيَيْنَاهَا وَأَخْرَجْنَا مِنْهَا حَبًّا فَمِنْهُ يَأْكُلُونَ", "وَجَعَلْنَا فِيهَا جَنَّاتٍ مِن نَّخِيلٍ وَأَعْنَابٍ وَفَجَّرْنَا فِيهَا مِنْ الْعُيُونِ", "لِيَأْكُلُوا مِن ثَمَرِهِ وَمَا عَمِلَتْهُ أَيْدِيهِمْ أَفَلَا يَشْكُرُونَ", "سُبْحَانَ الَّذِي خَلَقَ الْأَزْوَاجَ كُلَّهَا مِمَّا تُنبِتُ الْأَرْضُ وَمِنْ أَنفُسِهِمْ وَمِمَّا لَا يَعْلَمُونَ", "وَآيَةٌ لَّهُمْ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهَارَ فَإِذَا هُم مُّظْلِمُونَ", "وَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَّهَا ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ", "وَالْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ حَتَّى عَادَ كَالْعُرْجُونِ الْقَدِيمِ", "لَا الشَّمْسُ يَنبَغِي لَهَا أَن تُدْرِكَ الْقَمَرَ وَلَا اللَّيْلُ سَابِقُ النَّهَارِ وَكُلٌّ فِي فَلَكٍ يَسْبَحُونَ", "وَآيَةٌ لَّهُمْ أَنَّا حَمَلْنَا ذُرِّيَّتَهُمْ فِي الْفُلْكِ الْمَشْحُونِ", "وَخَلَقْنَا لَهُم مِّن مِّثْلِهِ مَا يَرْكَبُونَ", "وَإِن نَّشَأْ نُغْرِقْهُمْ فَلَا صَرِيخَ لَهُمْ وَلَا هُمْ يُنقَذُونَ", "إِلَّا رَحْمَةً مِّنَّا وَمَتَاعًا إِلَى حِينٍ", "وَإِذَا قِيلَ لَهُمُ اتَّقُوا مَا بَيْنَ أَيْدِيكُمْ وَمَا خَلْفَكُمْ لَعَلَّكُمْ تُرْحَمُونَ", "وَمَا تَأْتِيهِم مِّنْ آيَةٍ مِّنْ آيَاتِ رَبِّهِمْ إِلَّا كَانُوا عَنْهَا مُعْرِضِينَ", "وَإِذَا قِيلَ لَهُمْ أَنفِقُوا مِمَّا رَزَقَكُمْ اللَّهُ قَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا أَنُطْعِمُ مَن لَّوْ يَشَاء اللَّهُ أَطْعَمَهُ إِنْ أَنتُمْ إِلَّا فِي ضَلَالٍ مُّبِينٍ", "وَيَقُولُونَ مَتَى هَذَا الْوَعْدُ إِن كُنتُمْ صَادِقِينَ", "مَا يَنظُرُونَ إِلَّا صَيْحَةً وَاحِدَةً تَأْخُذُهُمْ وَهُمْ يَخِصِّمُونَ", "فَلَا يَسْتَطِيعُونَ تَوْصِيَةً وَلَا إِلَى أَهْلِهِمْ يَرْجِعُونَ", "وَنُفِخَ فِي الصُّورِ فَإِذَا هُم مِّنَ الْأَجْدَاثِ إِلَى رَبِّهِمْ يَنسِلُونَ", "قَالُوا يَا وَيْلَنَا مَن بَعَثَنَا مِن مَّرْقَدِنَا هَذَا مَا وَعَدَ الرَّحْمَنُ وَصَدَقَ الْمُرْسَلُونَ", "إِن كَانَتْ إِلَّا صَيْحَةً وَاحِدَةً فَإِذَا هُمْ جَمِيعٌ لَّدَيْنَا مُحْضَرُونَ", "فَالْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْئًا وَلَا تُجْزَوْنَ إِلَّا مَا كُنتُمْ تَعْمَلُونَ", "إِنَّ أَصْحَابَ الْجَنَّةِ الْيَوْمَ فِي شُغُلٍ فَاكِهُونَ", "هُمْ وَأَزْوَاجُهُمْ فِي ظِلَالٍ عَلَى الْأَرَائِكِ مُتَّكِؤُونَ", "لَهُمْ فِيهَا فَاكِهَةٌ وَلَهُم مَّا يَدَّعُونَ", "سَلَامٌ قَوْلًا مِن رَّبٍّ رَّحِيمٍ", "وَامْتَازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ", "أَلَمْ أَعْهَدْ إِلَيْكُمْ يَا بَنِي آدَمَ أَن لَّا تَعْبُدُوا الشَّيْطَانَ إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ", "وَأَنْ اعْبُدُونِي هَذَا صِرَاطٌ مُّسْتَقِيمٌ", "وَلَقَدْ أَضَلَّ مِنكُمْ جِبِلًّا كَثِيرًا أَفَلَمْ تَكُونُوا تَعْقِلُونَ", "هَذِهِ جَهَنَّمُ الَّتِي كُنتُمْ تُوعَدُونَ", "اصْلَوْهَا الْيَوْمَ بِمَا كُنتُمْ تَكْفُرُونَ", "الْيَوْمَ نَخْتِمُ عَلَى أَفْوَاهِهِمْ وَتُكَلِّمُنَا أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُمْ بِمَا كَانُوا يَكْسِبُونَ", "وَلَوْ نَشَاء لَطَمَسْنَا عَلَى أَعْيُنِهِمْ فَاسْتَبَقُوا الصِّرَاطَ فَأَنَّى يُبْصِرُونَ", "وَلَوْ نَشَاء لَمَسَخْنَاهُمْ عَلَى مَكَانَتِهِمْ فَمَا اسْتَطَاعُوا مُضِيًّا وَلَا يَرْجِعُونَ", "وَمَنْ نُعَمِّرْهُ نُنَكِّسْهُ فِي الْخَلْقِ أَفَلَا يَعْقِلُونَ", "وَمَا عَلَّمْنَاهُ الشِّعْرَ وَمَا يَنبَغِي لَهُ إِنْ هُوَ إِلَّا ذِكْرٌ وَقُرْآنٌ مُّبِينٌ", "لِيُنذِرَ مَن كَانَ حَيًّا وَيَحِقَّ الْقَوْلُ عَلَى الْكَافِرِينَ", "أَوَلَمْ يَرَوْا أَنَّا خَلَقْنَا لَهُمْ مِمَّا عَمِلَتْ أَيْدِينَا أَنْعَامًا فَهُمْ لَهَا مَالِكُونَ", "وَذَلَّلْنَاهَا لَهُمْ فَمِنْهَا رَكُوبُهُمْ وَمِنْهَا يَأْكُلُونَ", "وَلَهُمْ فِيهَا مَنَافِعُ وَمَشَارِبُ أَفَلَا يَشْكُرُونَ", "وَاتَّخَذُوا مِن دُونِ اللَّهِ آلِهَةً لَعَلَّهُمْ يُنصَرُونَ", "لَا يَسْتَطِيعُونَ نَصْرَهُمْ وَهُمْ لَهُمْ جُندٌ مُّحْضَرُونَ", "فَلَا يَحْزُنكَ قَوْلُهُمْ إِنَّا نَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ", "أَوَلَمْ يَرَ الْإِنسَانُ أَنَّا خَلَقْنَاهُ مِن نُّطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُّبِينٌ", "وَضَرَبَ لَنَا مَثَلًا وَنَسِيَ خَلْقَهُ قَالَ مَنْ يُحْيِي الْعِظَامَ وَهِيَ رَمِيمٌ", "قُلْ يُحْيِيهَا الَّذِي أَنشَأَهَا أَوَّلَ مَرَّةٍ وَهُوَ بِكُلِّ خَلْقٍ عَلِيمٌ", "الَّذِي جَعَلَ لَكُم مِّنَ الشَّجَرِ الْأَخْضَرِ نَارًا فَإِذَا أَنتُم مِّنْهُ تُوقِدُونَ", "أَوَلَيْسَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِقَادِرٍ عَلَى أَنْ يَخْلُقَ مِثْلَهُم بَلَى وَهُوَ الْخَلَّاقُ الْعَلِيمُ", "إِنَّمَا أَمْرُهُ إِذَا أَرَادَ شَيْئًا أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ", "فَسُبْحَانَ الَّذِي بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَإِلَيْهِ تُرْجَعُونَ"], "name_en": "Ya-Sin", "ayahs_en": ["Yâ-Sîn. [These letters are one of the miracles of the Qur’ân, and none but Allâh (Alone) knows their meanings.]", "By the Qur’ân, full of wisdom (i.e. full of laws, evidences, and proofs),", "Truly, you (O Muhammad SAW) are one of the Messengers,", "On a Straight Path (i.e. on Allâh’s religion of Islâmic Monotheism).", "(This is) a Revelation sent down by the All­Mighty, the Most Merciful,", "In order that you may warn a people whose forefathers were not warned, so they are heedless.", "Indeed the Word (of punishment) has proved true against most of them, so they will not believe.", "Verily! We have put on their necks iron collars reaching to chins, so that their heads are forced up.", "And We have put a barrier before them, and a barrier behind them, and We have covered them up, so that they cannot see.", "It is the same to them whether you warn them or you warn them not, they will not believe.", "You can only warn him who follows the  Reminder (the Qur’ân), and fears the Most Beneficent (Allâh) unseen.  Bear you to such one the glad tidings of forgiveness, and a generous  reward (i.e. Paradise).", "Verily, We give life to the dead, and We  record that which they send before (them), and their traces [their  footsteps and walking on the earth with their legs to the mosques for  the five compulsory congregational prayers, Jihâd (holy fighting in  Allâh’s Cause) and all other good and evil they did, and that which  they leave behind], and all things We have recorded with numbers (as a  record) in a Clear Book.", "And put forward to them a similitude;  the (story of the) dwellers of the town, [It is said that the town was  Antioch (Antakiya)], when there came Messengers to them.", "When We sent to them two Messengers,  they belied them both, so We reinforced them with a third, and they  said: ”Verily! We have been sent to you as Messengers.”", "They (people of the town) said: ”You are  only human beings like ourselves, and the Most Beneficent (Allâh) has  revealed nothing, you are only telling lies.”", "The Messengers said: ”Our Lord knows that we have been sent as Messengers to you,", "”And our duty is only to convey plainly (the Message).”", "They (people) said: ”For us, we see an  evil omen from you, if you cease not, we will surely stone you, and a  painful torment will touch you from us.”", "They (Messengers) said: ”Your evil omens  be with you! (Do you call it ”evil omen”) because you are admonished?  Nay, but you are a people Musrifûn (transgressing all bounds by  committing all kinds of great sins, and by disobeying Allâh).", "And there came running from the farthest part of the town, a man, saying: ”O my people! Obey the Messengers;", "”Obey those who ask no wages of you (for themselves), and who are rightly guided.", "”And why should I not worship Him (Allâh Alone) Who has created me and to Whom you shall be returned.", "”Shall I take besides Him âliha (gods),  if the Most Beneficent (Allâh) intends me any harm, their intercession  will be of no use for me whatsoever, nor can they save me?", "”Then verily, I should be in plain error.", "Verily! I have believed in your Lord, so listen to me!”", "It was said (to him when the disbelievers killed him): ”Enter Paradise.” He said: ”Would that my people knew!", "”That my Lord (Allâh) has forgiven me, and made me of the honoured ones!”", "And We sent not against his people after him a host from heaven, nor do We send (such a thing).", "It was but one Saihah (shout, etc.) and lo! They (all) were silent (dead-destroyed).", "Alas for mankind! There never came a Messenger to them but they used to mock at him.", "Do they not see how many of the generations We have destroyed before them? Verily, they will not return to them.", "And surely, all, everyone of them will be brought before Us.", "And a sign for them is the dead land. We gave it life, and We brought forth from it grains, so that they eat thereof.", "And We have made therein gardens of date-palms and grapes, and We have caused springs of water to gush forth therein.", "So that they may eat of the fruit thereof, and their hands made it not. Will they not, then, give thanks?", "Glory be to Him, Who has created all the  pairs of that which the earth produces, as well as of their own (human)  kind (male and female), and of that which they know not.", "And a sign for them is the night, We withdraw therefrom the day, and behold, they are in darkness.", "And the sun runs on its fixed course for a term (appointed). That is the Decree of the All-Mighty, the All-Knowing.", "And the moon, We have measured for it mansions (to traverse) till it returns like the old dried curved date stalk.", "It is not for the sun to overtake the moon, nor does the night outstrip the day. They all float, each in an orbit.", "And an Ayâh (sign) for them is that We bore their offspring in the laden ship [of Nûh (Noah)].", "And We have created for them of the like thereunto, so on them they ride.", "And if We will, We shall drown them, and  there will be no shout (or helper) for them (to hear their cry for  help) nor will they be saved.", "Unless it be a mercy from Us, and as an enjoyment for a while.", "And when it is said to them: ”Beware of  that which is before you (worldly torments), and that which is behind  you (torments in the Hereafter), in order that you may receive Mercy  (i.e. if you believe in Allâh’s Religion ­ Islâmic Monotheism, and  avoid polytheism, and obey Allâh with righteous deeds).", "And never came an Ayâh from among the  Ayât (proofs, evidences, verses, lessons, signs, revelations, etc.) of  their Lord to them, but they did turn away from it.", "And when it is said to them: ”Spend of  that with which Allâh has provided you,” those who disbelieve say to  those who believe: ”Shall we feed those whom, if Allâh willed, He  (Himself) would have fed? You are only in a plain error.”", "And they say: ”When will this promise (i.e. Resurrection) be fulfilled, if you are truthful?”", "They await only but a single Saihah (shout, etc.), which will seize them while they are disputing!", "Then they will not be able to make bequest, nor they will return to their family.", "And the Trumpet will be blown (i.e. the second blowing) and behold! From the graves they will come out quickly to their Lord.", "They will say: ”Woe to us! Who has  raised us up from our place of sleep.” (It will be said to them): ”This  is what the Most Beneficent (Allâh) had promised, and the Messengers  spoke truth!”", "It will be but a single Saihah (shout, etc.), so behold! They will all be brought up before Us!", "This Day (Day of Resurrection), none  will be wronged in anything, nor will you be requited anything except  that which you used to do.", "Verily, the dwellers of the Paradise, that Day, will be busy in joyful things.", "They and their wives will be in pleasant shade, reclining on thrones.", "They will have therein fruits (of all kinds) and all that they ask for.", "(It will be said to them): Salâmun (peace be on you), a Word from the Lord (Allâh), Most Merciful.", "(It will be said): ”And O you  Al-Mujrimûn (criminals, polytheists, sinners, disbelievers in the  Islâmic Monotheism, wicked evil ones, etc.)! Get you apart this Day  (from the believers).", "Did I not ordain for you, O Children of Adam, that you should not worship Shaitân (Satan). Verily, he is a plain enemy to you.", "And that you should worship Me [Alone  Islâmic Monotheism, and set up not rivals, associate-gods with  Me]. That is a Straight Path.", "And indeed he (Satan) did lead astray a great multitude of you. Did you not, then, understand?", "This is Hell which you were promised!", "Burn therein this Day, for that you used to disbelieve.", "This Day, We shall seal up their mouths,  and their hands will speak to Us, and their legs will bear witness to  what they used to earn. (It is said that one’s left thigh will be the  first to bear the witness). [Tafsir At-Tabarî, Vol. 22, Page 24]", "And if it had been Our Will, We would  surely have wiped out (blinded) their eyes, so that they would struggle  for the Path, how then would they see?", "And if it had been Our Will, We could  have transformed them (into animals or lifeless objects) in their  places. Then they should have been unable to go forward (move about)  nor they could have turned back. [As it happened with the Jews see  Verse 7:166 The Qur’ân].", "And he whom We grant long life, We reverse him in creation (weakness after strength). Will they not then understand?", "And We have not taught him (Muhammad SAW) poetry, nor is it meet for him. This is only a Reminder and a plain Qur’ân.", "That he or it (Muhammad SAW or the  Qur’ân) may give warning to him who is living (a healthy minded the  believer), and that Word (charge) may be justified against the  disbelievers (dead, as they reject the warnings).", "Do they not see that We have created for them of what Our Hands have created, the cattle, so that they are their owners.", "And We have subdued them unto them so that some of them they have for riding and some they eat.", "And they have (other) benefits from them (besides), and they get (milk) to drink, will they not then be grateful?", "And they have taken besides Allâh âliha (gods), hoping that they might be helped (by those so called gods).", "They cannot help them, but they will be brought forward as a troop against those who worshipped them (at the time of Reckoning).", "So let not their speech, then, grieve you (O Muhammad SAW). Verily, We know what they conceal and what they reveal.", "Does not man see that We have created  him from Nutfah (mixed male and female discharge semen drops). Yet  behold! He (stands forth) as an open opponent.", "And he puts forth for Us a parable, and  forgets his own creation. He says: ”Who will give life to these bones  when they have rotted away and became dust?”", "Say: (O Muhammad SAW) ”He will give life  to them Who created them for the first time! And He is the All-Knower  of every creation!”", "He, Who produces for you fire out of the green tree, when behold! You kindle therewith.", "Is not He, Who created the heavens and  the earth Able to create the like of them? Yes, indeed! He is the  All-Knowing Supreme Creator.", "Verily, His Command, when He intends a thing, is only that He says to it, ”Be!” and it is!", "So Glorified is He and Exalted above all  that they associate with Him, and in Whose Hands is the dominion of all  things, and to Him you shall be returned."]}