{"name_ar": "سورة ص", "ayahs_ar": ["ص وَالْقُرْآنِ ذِي الذِّكْرِ", "بَلِ الَّذِينَ كَفَرُوا فِي عِزَّةٍ وَشِقَاقٍ", "كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّن قَرْنٍ فَنَادَوْا وَلَاتَ حِينَ مَنَاصٍ", "وَعَجِبُوا أَن جَاءهُم مُّنذِرٌ مِّنْهُمْ وَقَالَ الْكَافِرُونَ هَذَا سَاحِرٌ كَذَّابٌ", "أَجَعَلَ الْآلِهَةَ إِلَهًا وَاحِدًا إِنَّ هَذَا لَشَيْءٌ عُجَابٌ", "وَانطَلَقَ الْمَلَأُ مِنْهُمْ أَنِ امْشُوا وَاصْبِرُوا عَلَى آلِهَتِكُمْ إِنَّ هَذَا لَشَيْءٌ يُرَادُ", "مَا سَمِعْنَا بِهَذَا فِي الْمِلَّةِ الْآخِرَةِ إِنْ هَذَا إِلَّا اخْتِلَاقٌ", "أَأُنزِلَ عَلَيْهِ الذِّكْرُ مِن بَيْنِنَا بَلْ هُمْ فِي شَكٍّ مِّن ذِكْرِي بَلْ لَمَّا يَذُوقُوا عَذَابِ", "أَمْ عِندَهُمْ خَزَائِنُ رَحْمَةِ رَبِّكَ الْعَزِيزِ الْوَهَّابِ", "أَمْ لَهُم مُّلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا فَلْيَرْتَقُوا فِي الْأَسْبَابِ", "جُندٌ مَّا هُنَالِكَ مَهْزُومٌ مِّنَ الْأَحْزَابِ", "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ وَفِرْعَوْنُ ذُو الْأَوْتَادِ", "وَثَمُودُ وَقَوْمُ لُوطٍ وَأَصْحَابُ الأَيْكَةِ أُوْلَئِكَ الْأَحْزَابُ", "إِن كُلٌّ إِلَّا كَذَّبَ الرُّسُلَ فَحَقَّ عِقَابِ", "وَمَا يَنظُرُ هَؤُلَاء إِلَّا صَيْحَةً وَاحِدَةً مَّا لَهَا مِن فَوَاقٍ", "وَقَالُوا رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبْلَ يَوْمِ الْحِسَابِ", "اصْبِرْ عَلَى مَا يَقُولُونَ وَاذْكُرْ عَبْدَنَا دَاوُودَ ذَا الْأَيْدِ إِنَّهُ أَوَّابٌ", "إِنَّا سَخَّرْنَا الْجِبَالَ مَعَهُ يُسَبِّحْنَ بِالْعَشِيِّ وَالْإِشْرَاقِ", "وَالطَّيْرَ مَحْشُورَةً كُلٌّ لَّهُ أَوَّابٌ", "وَشَدَدْنَا مُلْكَهُ وَآتَيْنَاهُ الْحِكْمَةَ وَفَصْلَ الْخِطَابِ", "وَهَلْ أَتَاكَ نَبَأُ الْخَصْمِ إِذْ تَسَوَّرُوا الْمِحْرَابَ", "إِذْ دَخَلُوا عَلَى دَاوُودَ فَفَزِعَ مِنْهُمْ قَالُوا لَا تَخَفْ خَصْمَانِ بَغَى بَعْضُنَا عَلَى بَعْضٍ فَاحْكُم بَيْنَنَا بِالْحَقِّ وَلَا تُشْطِطْ وَاهْدِنَا إِلَى سَوَاء الصِّرَاطِ", "إِنَّ هَذَا أَخِي لَهُ تِسْعٌ وَتِسْعُونَ نَعْجَةً وَلِيَ نَعْجَةٌ وَاحِدَةٌ فَقَالَ أَكْفِلْنِيهَا وَعَزَّنِي فِي الْخِطَابِ", "قَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ إِلَى نِعَاجِهِ وَإِنَّ كَثِيرًا مِّنْ الْخُلَطَاء لَيَبْغِي بَعْضُهُمْ عَلَى بَعْضٍ إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَقَلِيلٌ مَّا هُمْ وَظَنَّ دَاوُودُ أَنَّمَا فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وَخَرَّ رَاكِعًا وَأَنَابَ", "فَغَفَرْنَا لَهُ ذَلِكَ وَإِنَّ لَهُ عِندَنَا لَزُلْفَى وَحُسْنَ مَآبٍ", "يَا دَاوُودُ إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الْأَرْضِ فَاحْكُم بَيْنَ النَّاسِ بِالْحَقِّ وَلَا تَتَّبِعِ الْهَوَى فَيُضِلَّكَ عَن سَبِيلِ اللَّهِ إِنَّ الَّذِينَ يَضِلُّونَ عَن سَبِيلِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ بِمَا نَسُوا يَوْمَ الْحِسَابِ", "وَمَا خَلَقْنَا السَّمَاء وَالْأَرْضَ وَمَا بَيْنَهُمَا بَاطِلًا ذَلِكَ ظَنُّ الَّذِينَ كَفَرُوا فَوَيْلٌ لِّلَّذِينَ كَفَرُوا مِنَ النَّارِ", "أَمْ نَجْعَلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ كَالْمُفْسِدِينَ فِي الْأَرْضِ أَمْ نَجْعَلُ الْمُتَّقِينَ كَالْفُجَّارِ", "كِتَابٌ أَنزَلْنَاهُ إِلَيْكَ مُبَارَكٌ لِّيَدَّبَّرُوا آيَاتِهِ وَلِيَتَذَكَّرَ أُوْلُوا الْأَلْبَابِ", "وَوَهَبْنَا لِدَاوُودَ سُلَيْمَانَ نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ", "إِذْ عُرِضَ عَلَيْهِ بِالْعَشِيِّ الصَّافِنَاتُ الْجِيَادُ", "فَقَالَ إِنِّي أَحْبَبْتُ حُبَّ الْخَيْرِ عَن ذِكْرِ رَبِّي حَتَّى تَوَارَتْ بِالْحِجَابِ", "رُدُّوهَا عَلَيَّ فَطَفِقَ مَسْحًا بِالسُّوقِ وَالْأَعْنَاقِ", "وَلَقَدْ فَتَنَّا سُلَيْمَانَ وَأَلْقَيْنَا عَلَى كُرْسِيِّهِ جَسَدًا ثُمَّ أَنَابَ", "قَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَّا يَنبَغِي لِأَحَدٍ مِّنْ بَعْدِي إِنَّكَ أَنتَ الْوَهَّابُ", "فَسَخَّرْنَا لَهُ الرِّيحَ تَجْرِي بِأَمْرِهِ رُخَاء حَيْثُ أَصَابَ", "وَالشَّيَاطِينَ كُلَّ بَنَّاء وَغَوَّاصٍ", "وَآخَرِينَ مُقَرَّنِينَ فِي الْأَصْفَادِ", "هَذَا عَطَاؤُنَا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسَابٍ", "وَإِنَّ لَهُ عِندَنَا لَزُلْفَى وَحُسْنَ مَآبٍ", "وَاذْكُرْ عَبْدَنَا أَيُّوبَ إِذْ نَادَى رَبَّهُ أَنِّي مَسَّنِيَ الشَّيْطَانُ بِنُصْبٍ وَعَذَابٍ", "ارْكُضْ بِرِجْلِكَ هَذَا مُغْتَسَلٌ بَارِدٌ وَشَرَابٌ", "وَوَهَبْنَا لَهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنَّا وَذِكْرَى لِأُوْلِي الْأَلْبَابِ", "وَخُذْ بِيَدِكَ ضِغْثًا فَاضْرِب بِّهِ وَلَا تَحْنَثْ إِنَّا وَجَدْنَاهُ صَابِرًا نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ", "وَاذْكُرْ عِبَادَنَا إبْرَاهِيمَ وَإِسْحَقَ وَيَعْقُوبَ أُوْلِي الْأَيْدِي وَالْأَبْصَارِ", "إِنَّا أَخْلَصْنَاهُم بِخَالِصَةٍ ذِكْرَى الدَّارِ", "وَإِنَّهُمْ عِندَنَا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيَارِ", "وَاذْكُرْ إِسْمَاعِيلَ وَالْيَسَعَ وَذَا الْكِفْلِ وَكُلٌّ مِّنْ الْأَخْيَارِ", "هَذَا ذِكْرٌ وَإِنَّ لِلْمُتَّقِينَ لَحُسْنَ مَآبٍ", "جَنَّاتِ عَدْنٍ مُّفَتَّحَةً لَّهُمُ الْأَبْوَابُ", "مُتَّكِئِينَ فِيهَا يَدْعُونَ فِيهَا بِفَاكِهَةٍ كَثِيرَةٍ وَشَرَابٍ", "وَعِندَهُمْ قَاصِرَاتُ الطَّرْفِ أَتْرَابٌ", "هَذَا مَا تُوعَدُونَ لِيَوْمِ الْحِسَابِ", "إِنَّ هَذَا لَرِزْقُنَا مَا لَهُ مِن نَّفَادٍ", "هَذَا وَإِنَّ لِلطَّاغِينَ لَشَرَّ مَآبٍ", "جَهَنَّمَ يَصْلَوْنَهَا فَبِئْسَ الْمِهَادُ", "هَذَا فَلْيَذُوقُوهُ حَمِيمٌ وَغَسَّاقٌ", "وَآخَرُ مِن شَكْلِهِ أَزْوَاجٌ", "هَذَا فَوْجٌ مُّقْتَحِمٌ مَّعَكُمْ لَا مَرْحَبًا بِهِمْ إِنَّهُمْ صَالُوا النَّارِ", "قَالُوا بَلْ أَنتُمْ لَا مَرْحَبًا بِكُمْ أَنتُمْ قَدَّمْتُمُوهُ لَنَا فَبِئْسَ الْقَرَارُ", "قَالُوا رَبَّنَا مَن قَدَّمَ لَنَا هَذَا فَزِدْهُ عَذَابًا ضِعْفًا فِي النَّارِ", "وَقَالُوا مَا لَنَا لَا نَرَى رِجَالًا كُنَّا نَعُدُّهُم مِّنَ الْأَشْرَارِ", "أَتَّخَذْنَاهُمْ سِخْرِيًّا أَمْ زَاغَتْ عَنْهُمُ الْأَبْصَارُ", "إِنَّ ذَلِكَ لَحَقٌّ تَخَاصُمُ أَهْلِ النَّارِ", "قُلْ إِنَّمَا أَنَا مُنذِرٌ وَمَا مِنْ إِلَهٍ إِلَّا اللَّهُ الْوَاحِدُ الْقَهَّارُ", "رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الْعَزِيزُ الْغَفَّارُ", "قُلْ هُوَ نَبَأٌ عَظِيمٌ", "أَنتُمْ عَنْهُ مُعْرِضُونَ", "مَا كَانَ لِي مِنْ عِلْمٍ بِالْمَلَإِ الْأَعْلَى إِذْ يَخْتَصِمُونَ", "إِن يُوحَى إِلَيَّ إِلَّا أَنَّمَا أَنَا نَذِيرٌ مُّبِينٌ", "إِذْ قَالَ رَبُّكَ لِلْمَلَائِكَةِ إِنِّي خَالِقٌ بَشَرًا مِن طِينٍ", "فَإِذَا سَوَّيْتُهُ وَنَفَخْتُ فِيهِ مِن رُّوحِي فَقَعُوا لَهُ سَاجِدِينَ", "فَسَجَدَ الْمَلَائِكَةُ كُلُّهُمْ أَجْمَعُونَ", "إِلَّا إِبْلِيسَ اسْتَكْبَرَ وَكَانَ مِنْ الْكَافِرِينَ", "قَالَ يَا إِبْلِيسُ مَا مَنَعَكَ أَن تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ أَسْتَكْبَرْتَ أَمْ كُنتَ مِنَ الْعَالِينَ", "قَالَ أَنَا خَيْرٌ مِّنْهُ خَلَقْتَنِي مِن نَّارٍ وَخَلَقْتَهُ مِن طِينٍ", "قَالَ فَاخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ", "وَإِنَّ عَلَيْكَ لَعْنَتِي إِلَى يَوْمِ الدِّينِ", "قَالَ رَبِّ فَأَنظِرْنِي إِلَى يَوْمِ يُبْعَثُونَ", "قَالَ فَإِنَّكَ مِنَ الْمُنظَرِينَ", "إِلَى يَوْمِ الْوَقْتِ الْمَعْلُومِ", "قَالَ فَبِعِزَّتِكَ لَأُغْوِيَنَّهُمْ أَجْمَعِينَ", "إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ", "قَالَ فَالْحَقُّ وَالْحَقَّ أَقُولُ", "لَأَمْلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنْهُمْ أَجْمَعِينَ", "قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَا أَنَا مِنَ الْمُتَكَلِّفِينَ", "إِنْ هُوَ إِلَّا ذِكْرٌ لِّلْعَالَمِينَ", "وَلَتَعْلَمُنَّ نَبَأَهُ بَعْدَ حِينٍ"], "name_en": "Sad", "ayahs_en": ["Sâd. [These letters (Sâd etc.) are one  of the miracles of the Qur’ân and none but Allâh (Alone) knows their  meanings]. By the Qur’ân full of reminding.", "Nay, those who desbelieve are in false pride and opposition.", "How many a generation We have destroyed before them, and they cried out when there was no longer time for escape!", "And they (Arab pagans) wonder that a  warner (Prophet Muhammad SAW) has come to them from among themselves!  And the disbelievers say: ”This (Prophet Muhammad SAW) is a sorcerer, a  liar.", "”Has he made the âliha (gods) (all) into One Ilâh (God - Allâh). Verily, this is a curious thing!”", "And the leaders among them went about  (saying): ”Go on, and remain constant to your âliha (gods)! Verily,  This is a thing designed (against you)!", "”We have not heard (the like) of this among the people of these later days. This is nothing but an invention!", "”Has the Reminder been sent down to him  (alone) from among us?” Nay! but they are in doubt about My Reminder  (this Qur’ân)! Nay, but they have not tasted (My) Torment!", "Or have they the treasures of the Mercy of your Lord, the All-Mighty, the Real Bestower?", "Or is it that the dominion of the  heavens and the earth and all that is between them is theirs? If so,  let them ascend up with means (to the heavens)!", "(As they denied Allâh’s Message) they will be a defeated host like the confederates of the old times (who were defeated).", "Before them (were many who) belied  Messengers, the people of Nûh (Noah); and ’Ad; and Fir’aun (Pharaoh)  the man of stakes (with which he used to punish the people),", "And Thamûd, and the people of Lout (Lot), and the dwellers of the wood; such were the confederates.", "Not one of them but belied the Messengers, therefore My Torment was justified,", "And these only wait for a single Saihah  [shout (i.e. the blowing of the Trumpet by the angel Isrâfil Sarafil)]  there will be no pause or ending thereto [till everything will perish  except Allâh (the only God full of Majesty, Bounty and Honour)].", "They say: ”Our Lord! Hasten to us  Qittana (i.e. our Record of good and bad deeds so that we see it)  before the Day of Reckoning!”", "Be patient (O Muhammad SAW) of what they  say, and remember Our slave Dâwûd (David), endued with power. Verily,  he was ever oft-returning in all matters and in repentance (toward  Allâh).", "Verily, We made the mountains to glorify  Our Praises with him [Dâwûd (David)] in the ’Ashi (i.e. after the  mid-day till sunset) and Ishrâq (i.e. after the sunrise till mid-day).", "And (so did) the birds assembled: all with him [Dâwûd (David)] did turn (to Allâh i.e. glorified His Praises).", "We made his kingdom strong and gave him Al-Hikmah (Prophethood, etc.) and sound judgement in speech and decision.", "And has the news of the litigants  reached you? When they climbed over the wall into (his) Mihrâb (a  praying place or a private room,).", "When they entered in upon Dâwûd (David),  he was terrified of them, they said: ”Fear not! (We are) two litigants,  one of whom has wronged the other, therefore judge between us with  truth, and treat us not with injustice, and guide us to the Right Way.", "Verily, this my brother (in religion)  has ninety nine ewes, while I have (only) one ewe, and he says: ”Hand  it over to me, and he overpowered me in speech.”", "[Dâwûd (David)] said (immediately  without listening to the opponent): ”He has wronged you in demanding  your ewe in addition to his ewes. And, verily, many partners oppress  one another, except those who believe and do righteous good deeds, and  they are few.” And Dâwûd (David) guessed that We have tried him and he  sought Forgiveness of his Lord, and he fell down prostrate and turned  (to Allâh) in repentance.[ Sajdah ]", "So We forgave him that, and verily, for him is a near access to Us, and a good place of (final) return (Paradise).", "O Dâwûd (David)! Verily! We have placed  you as a successor on earth, so judge you between men in truth (and  justice) and follow not your desire for it will mislead you from the  Path of Allâh. Verily! Those who wander astray from the Path of Allâh  (shall) have a severe torment, because they forgot the Day of Reckoning.", "And We created not the heaven and the  earth and all that is between them without purpose! That is the  consideration of those who disbelieve! Then woe to those who disbelieve  (in Islâmic Monotheism) from the Fire!", "Shall We treat those who believe (in the  Oneness of Allâh Islâmic Monotheism) and do righteous good deeds, as  Mufsidûn (those who associate partners in worship with Allâh and commit  crimes) on earth? Or shall We treat the Muttaqûn (pious - see V.2:2),  as the Fujjâr (criminals, disbelievers, wicked, etc)?ONT>", "(This is) a Book (the Qur’ân) which We  have sent down to you, full of blessings that they may ponder over its  Verses, and that men of understanding may remember.", "And to Dâwûd (David) We gave Sulaimân  (Solomon). How excellent (a) slave! Verily, he was ever oft-returning  in repentance (to Us)!", "When there were displayed before him, in  the afternoon, well trained horses of the highest breed [for Jihâd  (holy fighting in Allâh’s Cause)].", "And he said: ”Alas! I did love the good  (these horses) instead of remembering my Lord (in my ’Asr prayer)” till  the time was over, and (the sun) had hidden in the veil (of night).", "Then he said ”Bring them (horses) back  to me.” Then he began to pass his hand over their legs and their necks  (till the end of the display).", "And, indeed We did try Sulaimân  (Solomon) and We placed on his throne Jasadan (a devil, so he lost his  kingdom for a while) but he did return (to his throne and kingdom by  the Grace of Allâh and he did return) to Allâh with obedience and in  repentance.", "He said: ”My Lord! Forgive me, and  bestow upon me a kingdom such as shall not belong to any other after  me: Verily, You are the Bestower.”", "So, We subjected to him the wind, it blew gently to his order whithersoever he willed,", "And also the Shayâtin (devils) from the jinns (including) every kind of builder and diver,", "And also others bound in fetters.", "[Saying of Allâh to Sulaimân (Solomon)]: ”This is Our gift, so spend you or withhold, no account will be asked.”", "And verily, he enjoyed a near access to Us, and a good final return (Paradise).", "And remember Our slave Ayûb (Job), when  he invoked his Lord (saying): ”Verily! Shaitân (Satan) has touched me  with distress (by losing my health) and torment (by losing my wealth)!", "(Allâh said to him): ”Strike the ground with your foot: This is a spring of water to wash in, cool and a (refreshing) drink.”", "And We gave him (back) his family, and  along with them the like thereof, as a Mercy from Us, and a Reminder  for those who understand.", "”And take in your hand a bundle of thin  grass and strike therewith (your wife), and break not your oath .  Truly! We found him patient. How excellent (a) slave! Verily, he was  ever oft-returning in repentance (to Us)!", "And remember Our slaves, Ibrâhim  (Abraham), Ishâque (Isaac), and Ya’qûb (Jacob), (all) owners of  strength (in worshipping Us) and (also) of religious understanding.", "Verily, We did choose them by granting  them (a good thing, i.e.) the remembrance of the home [in the Hereafter  and they used to make the people remember it, and also they used to  invite the people to obey Allâh and to do good deeds for the Hereafter].", "And they are with Us, verily, of the chosen and the best!", "And remember Ismâ’il (Ishmael), Al­Yasa’â (Elisha), and Dhul-Kifl (Isaiah), all are among the best.", "This is a Reminder, and verily, for the Muttaqûn (pious and righteous persons - see V.2:2) is a good final return (Paradise), -,", "’Adn (Edn) Paradise (everlasting  Gardens), whose doors will be open for them, [It is said (in Tafsir  At-Tabarî, Part 23, Page 174) that one can speak to the doors, just one  tells it to open and close, and it will open or close as it is ordered].", "Therein they will recline; therein they will call for fruits in abundance and drinks;", "And beside them will be chaste females (virgins) restraining their glances only for their husbands, (and) of equal ages.", "This it is what you (Al-Muttaqûn - the pious) are promised for the Day of Reckoning!", "(It will be said to them)! Verily, this is Our Provision which will never finish;", "This is so! And for the Tâghûn  (transgressors, disobedient to Allâh and His Messenger - disbelievers  in the Oneness of Allâh, criminals, etc.), will be an evil final return  (Fire),", "Hell! Where they will burn, and worst (indeed) is that place to rest!", "This is so! Then let them taste it, a boiling fluid and dirty wound discharges.", "And other torments of similar kind, all together!", "This is a troop entering with you (in Hell), no welcome for them! Verily, they shall burn in the Fire!", "(The followers of the misleaders will  say): ”Nay, you (too)! No welcome for you! It is you (misleaders) who  brought this upon us (because you misled us in the world), so evil is  this place to stay in!”", "They will say: ”Our Lord! Whoever brought this upon us, add to him a double torment in the Fire!”", "And they will say: ”What is the matter with us that we see not men whom we used to count among the bad ones?”", "Did we take them as an object of mockery, or have (our) eyes failed to perceive them?”", "Verily, that is the very truth, the mutual dispute of the people of the Fire!", "Say (O Muhammad SAW): ”I am only a  warner and there is no Ilâh (God) except Allâh (none has the right to  be worshipped but Allâh) the One, the Irresistible,", "”The Lord of the heavens and the earth and all that is between them, the All-Mighty, the Oft-Forgiving.”", "Say: ”That (this Qur’ân) is a great news,", "”From which you turn away!", "”I had no knowledge of the chiefs (angels) on high when they were disputing and discussing (about the creation of Adam).", "”Only this has been inspired to me, that I am a plain warner.”", "(Remember) when your Lord said to the angels: ”Truly, I am going to create man from clay”.", "So when I have fashioned him and breathed into him (his) soul created by Me, then you fall down prostrate to him.”", "So the angels prostrated themselves, all of them:", "Except Iblîs (Satan) he was proud and was one of the disbelievers.", "(Allâh) said: ”O Iblîs (Satan)! What  prevents you from prostrating yourself to one whom I have created with  Both My Hands. Are you too proud (to fall prostrate to Adam) or are you  one of the high exalted?”", "[Iblîs (Satan)] said: ”I am better than he, You created me from fire, and You created him from clay.”", "(Allâh) said: ”Then get out from here, for verily, you are outcast.", "”And verily!, My Curse is on you till the Day of Recompense.”", "[Iblîs (Satan)] said: ”My Lord! Give me then respite till the Day the (dead) are resurrected.”", "(Allâh) said: ”Verily! You are of those allowed respite", "”Till the Day of the time appointed.”", "[Iblîs (Satan)] said: ”By Your Might, then I will surely mislead them all,", "”Except Your chosen slaves amongst them (faithful, obedient, true believers of Islâmic Monotheism).”", "(Allâh) said: ”The Truth is, and the Truth I say,", "That I will fill Hell with you [Iblîs (Satan)] and those of them (mankind) that follow you, together.”", "Say (O Muhammad SAW): ”No wage do I ask  of you for this (the Qur’ân), nor am I one of the Mutakallifûn (those  who pretend and fabricate things which do not exist).", "”It (this Qur’ân) is only a Reminder for all the ’Alamîn (mankind and jinns).", "”And you shall certainly know the truth of it after a while.”"]}