{"name_ar": "سورة غافر", "ayahs_ar": ["حم", "تَنزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْعَلِيمِ", "غَافِرِ الذَّنبِ وَقَابِلِ التَّوْبِ شَدِيدِ الْعِقَابِ ذِي الطَّوْلِ لَا إِلَهَ إِلَّا هُوَ إِلَيْهِ الْمَصِيرُ", "مَا يُجَادِلُ فِي آيَاتِ اللَّهِ إِلَّا الَّذِينَ كَفَرُوا فَلَا يَغْرُرْكَ تَقَلُّبُهُمْ فِي الْبِلَادِ", "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَالْأَحْزَابُ مِن بَعْدِهِمْ وَهَمَّتْ كُلُّ أُمَّةٍ بِرَسُولِهِمْ لِيَأْخُذُوهُ وَجَادَلُوا بِالْبَاطِلِ لِيُدْحِضُوا بِهِ الْحَقَّ فَأَخَذْتُهُمْ فَكَيْفَ كَانَ عِقَابِ", "وَكَذَلِكَ حَقَّتْ كَلِمَتُ رَبِّكَ عَلَى الَّذِينَ كَفَرُوا أَنَّهُمْ أَصْحَابُ النَّارِ", "الَّذِينَ يَحْمِلُونَ الْعَرْشَ وَمَنْ حَوْلَهُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُونَ بِهِ وَيَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ", "رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدتَّهُم وَمَن صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ", "وَقِهِمُ السَّيِّئَاتِ وَمَن تَقِ السَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ وَذَلِكَ هُوَ الْفَوْزُ الْعَظِيمُ", "إِنَّ الَّذِينَ كَفَرُوا يُنَادَوْنَ لَمَقْتُ اللَّهِ أَكْبَرُ مِن مَّقْتِكُمْ أَنفُسَكُمْ إِذْ تُدْعَوْنَ إِلَى الْإِيمَانِ فَتَكْفُرُونَ", "قَالُوا رَبَّنَا أَمَتَّنَا اثْنَتَيْنِ وَأَحْيَيْتَنَا اثْنَتَيْنِ فَاعْتَرَفْنَا بِذُنُوبِنَا فَهَلْ إِلَى خُرُوجٍ مِّن سَبِيلٍ", "ذَلِكُم بِأَنَّهُ إِذَا دُعِيَ اللَّهُ وَحْدَهُ كَفَرْتُمْ وَإِن يُشْرَكْ بِهِ تُؤْمِنُوا فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ", "هُوَ الَّذِي يُرِيكُمْ آيَاتِهِ وَيُنَزِّلُ لَكُم مِّنَ السَّمَاء رِزْقًا وَمَا يَتَذَكَّرُ إِلَّا مَن يُنِيبُ", "فَادْعُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ", "رَفِيعُ الدَّرَجَاتِ ذُو الْعَرْشِ يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَى مَن يَشَاء مِنْ عِبَادِهِ لِيُنذِرَ يَوْمَ التَّلَاقِ", "يَوْمَ هُم بَارِزُونَ لَا يَخْفَى عَلَى اللَّهِ مِنْهُمْ شَيْءٌ لِّمَنِ الْمُلْكُ الْيَوْمَ لِلَّهِ الْوَاحِدِ الْقَهَّارِ", "الْيَوْمَ تُجْزَى كُلُّ نَفْسٍ بِمَا كَسَبَتْ لَا ظُلْمَ الْيَوْمَ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ", "وَأَنذِرْهُمْ يَوْمَ الْآزِفَةِ إِذِ الْقُلُوبُ لَدَى الْحَنَاجِرِ كَاظِمِينَ مَا لِلظَّالِمِينَ مِنْ حَمِيمٍ وَلَا شَفِيعٍ يُطَاعُ", "يَعْلَمُ خَائِنَةَ الْأَعْيُنِ وَمَا تُخْفِي الصُّدُورُ", "وَاللَّهُ يَقْضِي بِالْحَقِّ وَالَّذِينَ يَدْعُونَ مِن دُونِهِ لَا يَقْضُونَ بِشَيْءٍ إِنَّ اللَّهَ هُوَ السَّمِيعُ الْبَصِيرُ", "أَوَ لَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ كَانُوا مِن قَبْلِهِمْ كَانُوا هُمْ أَشَدَّ مِنْهُمْ قُوَّةً وَآثَارًا فِي الْأَرْضِ فَأَخَذَهُمُ اللَّهُ بِذُنُوبِهِمْ وَمَا كَانَ لَهُم مِّنَ اللَّهِ مِن وَاقٍ", "ذَلِكَ بِأَنَّهُمْ كَانَت تَّأْتِيهِمْ رُسُلُهُم بِالْبَيِّنَاتِ فَكَفَرُوا فَأَخَذَهُمُ اللَّهُ إِنَّهُ قَوِيٌّ شَدِيدُ الْعِقَابِ", "وَلَقَدْ أَرْسَلْنَا مُوسَى بِآيَاتِنَا وَسُلْطَانٍ مُّبِينٍ", "إِلَى فِرْعَوْنَ وَهَامَانَ وَقَارُونَ فَقَالُوا سَاحِرٌ كَذَّابٌ", "فَلَمَّا جَاءهُم بِالْحَقِّ مِنْ عِندِنَا قَالُوا اقْتُلُوا أَبْنَاء الَّذِينَ آمَنُوا مَعَهُ وَاسْتَحْيُوا نِسَاءهُمْ وَمَا كَيْدُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ", "وَقَالَ فِرْعَوْنُ ذَرُونِي أَقْتُلْ مُوسَى وَلْيَدْعُ رَبَّهُ إِنِّي أَخَافُ أَن يُبَدِّلَ دِينَكُمْ أَوْ أَن يُظْهِرَ فِي الْأَرْضِ الْفَسَادَ", "وَقَالَ مُوسَى إِنِّي عُذْتُ بِرَبِّي وَرَبِّكُم مِّن كُلِّ مُتَكَبِّرٍ لَّا يُؤْمِنُ بِيَوْمِ الْحِسَابِ", "وَقَالَ رَجُلٌ مُّؤْمِنٌ مِّنْ آلِ فِرْعَوْنَ يَكْتُمُ إِيمَانَهُ أَتَقْتُلُونَ رَجُلًا أَن يَقُولَ رَبِّيَ اللَّهُ وَقَدْ جَاءكُم بِالْبَيِّنَاتِ مِن رَّبِّكُمْ وَإِن يَكُ كَاذِبًا فَعَلَيْهِ كَذِبُهُ وَإِن يَكُ صَادِقًا يُصِبْكُم بَعْضُ الَّذِي يَعِدُكُمْ إِنَّ اللَّهَ لَا يَهْدِي مَنْ هُوَ مُسْرِفٌ كَذَّابٌ", "يَا قَوْمِ لَكُمُ الْمُلْكُ الْيَوْمَ ظَاهِرِينَ فِي الْأَرْضِ فَمَن يَنصُرُنَا مِن بَأْسِ اللَّهِ إِنْ جَاءنَا قَالَ فِرْعَوْنُ مَا أُرِيكُمْ إِلَّا مَا أَرَى وَمَا أَهْدِيكُمْ إِلَّا سَبِيلَ الرَّشَادِ", "وَقَالَ الَّذِي آمَنَ يَا قَوْمِ إِنِّي أَخَافُ عَلَيْكُم مِّثْلَ يَوْمِ الْأَحْزَابِ", "مِثْلَ دَأْبِ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ وَالَّذِينَ مِن بَعْدِهِمْ وَمَا اللَّهُ يُرِيدُ ظُلْمًا لِّلْعِبَادِ", "وَيَا قَوْمِ إِنِّي أَخَافُ عَلَيْكُمْ يَوْمَ التَّنَادِ", "يَوْمَ تُوَلُّونَ مُدْبِرِينَ مَا لَكُم مِّنَ اللَّهِ مِنْ عَاصِمٍ وَمَن يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ", "وَلَقَدْ جَاءكُمْ يُوسُفُ مِن قَبْلُ بِالْبَيِّنَاتِ فَمَا زِلْتُمْ فِي شَكٍّ مِّمَّا جَاءكُم بِهِ حَتَّى إِذَا هَلَكَ قُلْتُمْ لَن يَبْعَثَ اللَّهُ مِن بَعْدِهِ رَسُولًا كَذَلِكَ يُضِلُّ اللَّهُ مَنْ هُوَ مُسْرِفٌ مُّرْتَابٌ", "الَّذِينَ يُجَادِلُونَ فِي آيَاتِ اللَّهِ بِغَيْرِ سُلْطَانٍ أَتَاهُمْ كَبُرَ مَقْتًا عِندَ اللَّهِ وَعِندَ الَّذِينَ آمَنُوا كَذَلِكَ يَطْبَعُ اللَّهُ عَلَى كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ", "وَقَالَ فِرْعَوْنُ يَا هَامَانُ ابْنِ لِي صَرْحًا لَّعَلِّي أَبْلُغُ الْأَسْبَابَ", "أَسْبَابَ السَّمَاوَاتِ فَأَطَّلِعَ إِلَى إِلَهِ مُوسَى وَإِنِّي لَأَظُنُّهُ كَاذِبًا وَكَذَلِكَ زُيِّنَ لِفِرْعَوْنَ سُوءُ عَمَلِهِ وَصُدَّ عَنِ السَّبِيلِ وَمَا كَيْدُ فِرْعَوْنَ إِلَّا فِي تَبَابٍ", "وَقَالَ الَّذِي آمَنَ يَا قَوْمِ اتَّبِعُونِ أَهْدِكُمْ سَبِيلَ الرَّشَادِ", "يَا قَوْمِ إِنَّمَا هَذِهِ الْحَيَاةُ الدُّنْيَا مَتَاعٌ وَإِنَّ الْآخِرَةَ هِيَ دَارُ الْقَرَارِ", "مَنْ عَمِلَ سَيِّئَةً فَلَا يُجْزَى إِلَّا مِثْلَهَا وَمَنْ عَمِلَ صَالِحًا مِّن ذَكَرٍ أَوْ أُنثَى وَهُوَ مُؤْمِنٌ فَأُوْلَئِكَ يَدْخُلُونَ الْجَنَّةَ يُرْزَقُونَ فِيهَا بِغَيْرِ حِسَابٍ", "وَيَا قَوْمِ مَا لِي أَدْعُوكُمْ إِلَى النَّجَاةِ وَتَدْعُونَنِي إِلَى النَّارِ", "تَدْعُونَنِي لِأَكْفُرَ بِاللَّهِ وَأُشْرِكَ بِهِ مَا لَيْسَ لِي بِهِ عِلْمٌ وَأَنَا أَدْعُوكُمْ إِلَى الْعَزِيزِ الْغَفَّارِ", "لَا جَرَمَ أَنَّمَا تَدْعُونَنِي إِلَيْهِ لَيْسَ لَهُ دَعْوَةٌ فِي الدُّنْيَا وَلَا فِي الْآخِرَةِ وَأَنَّ مَرَدَّنَا إِلَى اللَّهِ وَأَنَّ الْمُسْرِفِينَ هُمْ أَصْحَابُ النَّارِ", "فَسَتَذْكُرُونَ مَا أَقُولُ لَكُمْ وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ إِنَّ اللَّهَ بَصِيرٌ بِالْعِبَادِ", "فَوَقَاهُ اللَّهُ سَيِّئَاتِ مَا مَكَرُوا وَحَاقَ بِآلِ فِرْعَوْنَ سُوءُ الْعَذَابِ", "النَّارُ يُعْرَضُونَ عَلَيْهَا غُدُوًّا وَعَشِيًّا وَيَوْمَ تَقُومُ السَّاعَةُ أَدْخِلُوا آلَ فِرْعَوْنَ أَشَدَّ الْعَذَابِ", "وَإِذْ يَتَحَاجُّونَ فِي النَّارِ فَيَقُولُ الضُّعَفَاء لِلَّذِينَ اسْتَكْبَرُوا إِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ أَنتُم مُّغْنُونَ عَنَّا نَصِيبًا مِّنَ النَّارِ", "قَالَ الَّذِينَ اسْتَكْبَرُوا إِنَّا كُلٌّ فِيهَا إِنَّ اللَّهَ قَدْ حَكَمَ بَيْنَ الْعِبَادِ", "وَقَالَ الَّذِينَ فِي النَّارِ لِخَزَنَةِ جَهَنَّمَ ادْعُوا رَبَّكُمْ يُخَفِّفْ عَنَّا يَوْمًا مِّنَ الْعَذَابِ", "قَالُوا أَوَلَمْ تَكُ تَأْتِيكُمْ رُسُلُكُم بِالْبَيِّنَاتِ قَالُوا بَلَى قَالُوا فَادْعُوا وَمَا دُعَاء الْكَافِرِينَ إِلَّا فِي ضَلَالٍ", "إِنَّا لَنَنصُرُ رُسُلَنَا وَالَّذِينَ آمَنُوا فِي الْحَيَاةِ الدُّنْيَا وَيَوْمَ يَقُومُ الْأَشْهَادُ", "يَوْمَ لَا يَنفَعُ الظَّالِمِينَ مَعْذِرَتُهُمْ وَلَهُمُ اللَّعْنَةُ وَلَهُمْ سُوءُ الدَّارِ", "وَلَقَدْ آتَيْنَا مُوسَى الْهُدَى وَأَوْرَثْنَا بَنِي إِسْرَائِيلَ الْكِتَابَ", "هُدًى وَذِكْرَى لِأُولِي الْأَلْبَابِ", "فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ وَاسْتَغْفِرْ لِذَنبِكَ وَسَبِّحْ بِحَمْدِ رَبِّكَ بِالْعَشِيِّ وَالْإِبْكَارِ", "إِنَّ الَّذِينَ يُجَادِلُونَ فِي آيَاتِ اللَّهِ بِغَيْرِ سُلْطَانٍ أَتَاهُمْ إِن فِي صُدُورِهِمْ إِلَّا كِبْرٌ مَّا هُم بِبَالِغِيهِ فَاسْتَعِذْ بِاللَّهِ إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ", "لَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ", "وَمَا يَسْتَوِي الْأَعْمَى وَالْبَصِيرُ وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَلَا الْمُسِيءُ قَلِيلًا مَّا تَتَذَكَّرُونَ", "إِنَّ السَّاعَةَ لَآتِيَةٌ لَّا رَيْبَ فِيهَا وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ", "وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ", "اللَّهُ الَّذِي جَعَلَ لَكُمُ اللَّيْلَ لِتَسْكُنُوا فِيهِ وَالنَّهَارَ مُبْصِرًا إِنَّ اللَّهَ لَذُو فَضْلٍ عَلَى النَّاسِ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَشْكُرُونَ", "ذَلِكُمُ اللَّهُ رَبُّكُمْ خَالِقُ كُلِّ شَيْءٍ لَّا إِلَهَ إِلَّا هُوَ فَأَنَّى تُؤْفَكُونَ", "كَذَلِكَ يُؤْفَكُ الَّذِينَ كَانُوا بِآيَاتِ اللَّهِ يَجْحَدُونَ", "اللَّهُ الَّذِي جَعَلَ لَكُمُ الْأَرْضَ قَرَارًا وَالسَّمَاء بِنَاء وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ وَرَزَقَكُم مِّنَ الطَّيِّبَاتِ ذَلِكُمُ اللَّهُ رَبُّكُمْ فَتَبَارَكَ اللَّهُ رَبُّ الْعَالَمِينَ", "هُوَ الْحَيُّ لَا إِلَهَ إِلَّا هُوَ فَادْعُوهُ مُخْلِصِينَ لَهُ الدِّينَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ", "قُلْ إِنِّي نُهِيتُ أَنْ أَعْبُدَ الَّذِينَ تَدْعُونَ مِن دُونِ اللَّهِ لَمَّا جَاءنِيَ الْبَيِّنَاتُ مِن رَّبِّي وَأُمِرْتُ أَنْ أُسْلِمَ لِرَبِّ الْعَالَمِينَ", "هُوَ الَّذِي خَلَقَكُم مِّن تُرَابٍ ثُمَّ مِن نُّطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ يُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوا أَشُدَّكُمْ ثُمَّ لِتَكُونُوا شُيُوخًا وَمِنكُم مَّن يُتَوَفَّى مِن قَبْلُ وَلِتَبْلُغُوا أَجَلًا مُّسَمًّى وَلَعَلَّكُمْ تَعْقِلُونَ", "هُوَ الَّذِي يُحْيِي وَيُمِيتُ فَإِذَا قَضَى أَمْرًا فَإِنَّمَا يَقُولُ لَهُ كُن فَيَكُونُ", "أَلَمْ تَرَ إِلَى الَّذِينَ يُجَادِلُونَ فِي آيَاتِ اللَّهِ أَنَّى يُصْرَفُونَ", "الَّذِينَ كَذَّبُوا بِالْكِتَابِ وَبِمَا أَرْسَلْنَا بِهِ رُسُلَنَا فَسَوْفَ يَعْلَمُونَ", "إِذِ الْأَغْلَالُ فِي أَعْنَاقِهِمْ وَالسَّلَاسِلُ يُسْحَبُونَ", "فِي الْحَمِيمِ ثُمَّ فِي النَّارِ يُسْجَرُونَ", "ثُمَّ قِيلَ لَهُمْ أَيْنَ مَا كُنتُمْ تُشْرِكُونَ", "مِن دُونِ اللَّهِ قَالُوا ضَلُّوا عَنَّا بَل لَّمْ نَكُن نَّدْعُو مِن قَبْلُ شَيْئًا كَذَلِكَ يُضِلُّ اللَّهُ الْكَافِرِينَ", "ذَلِكُم بِمَا كُنتُمْ تَفْرَحُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَبِمَا كُنتُمْ تَمْرَحُونَ", "ادْخُلُوا أَبْوَابَ جَهَنَّمَ خَالِدِينَ فِيهَا فَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ", "فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ فَإِمَّا نُرِيَنَّكَ بَعْضَ الَّذِي نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِلَيْنَا يُرْجَعُونَ", "وَلَقَدْ أَرْسَلْنَا رُسُلًا مِّن قَبْلِكَ مِنْهُم مَّن قَصَصْنَا عَلَيْكَ وَمِنْهُم مَّن لَّمْ نَقْصُصْ عَلَيْكَ وَمَا كَانَ لِرَسُولٍ أَنْ يَأْتِيَ بِآيَةٍ إِلَّا بِإِذْنِ اللَّهِ فَإِذَا جَاء أَمْرُ اللَّهِ قُضِيَ بِالْحَقِّ وَخَسِرَ هُنَالِكَ الْمُبْطِلُونَ", "اللَّهُ الَّذِي جَعَلَ لَكُمُ الْأَنْعَامَ لِتَرْكَبُوا مِنْهَا وَمِنْهَا تَأْكُلُونَ", "وَلَكُمْ فِيهَا مَنَافِعُ وَلِتَبْلُغُوا عَلَيْهَا حَاجَةً فِي صُدُورِكُمْ وَعَلَيْهَا وَعَلَى الْفُلْكِ تُحْمَلُونَ", "وَيُرِيكُمْ آيَاتِهِ فَأَيَّ آيَاتِ اللَّهِ تُنكِرُونَ", "أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِن قَبْلِهِمْ كَانُوا أَكْثَرَ مِنْهُمْ وَأَشَدَّ قُوَّةً وَآثَارًا فِي الْأَرْضِ فَمَا أَغْنَى عَنْهُم مَّا كَانُوا يَكْسِبُونَ", "فَلَمَّا جَاءتْهُمْ رُسُلُهُم بِالْبَيِّنَاتِ فَرِحُوا بِمَا عِندَهُم مِّنَ الْعِلْمِ وَحَاقَ بِهِم مَّا كَانُوا بِهِ يَسْتَهْزِؤُون", "فَلَمَّا رَأَوْا بَأْسَنَا قَالُوا آمَنَّا بِاللَّهِ وَحْدَهُ وَكَفَرْنَا بِمَا كُنَّا بِهِ مُشْرِكِينَ", "فَلَمْ يَكُ يَنفَعُهُمْ إِيمَانُهُمْ لَمَّا رَأَوْا بَأْسَنَا سُنَّتَ اللَّهِ الَّتِي قَدْ خَلَتْ فِي عِبَادِهِ وَخَسِرَ هُنَالِكَ الْكَافِرُونَ"], "name_en": "Ghafir", "ayahs_en": ["Hâ-Mîm. [These letters are one of the miracles of the Qur’ân, and none but Allâh (Alone) knows their meanings].", "The revelation of the Book (this Qur’ân) is from Allâh the All-Mighty, the All-Knower.", "The Forgiver of sin, the Acceptor of  repentance, the Severe in punishment, the Bestower (of favours), Lâ  ilâha illa Huwa (none has the right to be worshipped but He), to Him is  the final return.", "None disputes in the Ayât (proofs,  evidences, verses, lessons, signs, revelations, etc.) of Allâh but  those who disbelieve. So let not their ability of going about here and  there through the land (for their purposes) deceive you [O Muhammad  SAW, their ultimate end will be the Fire of Hell]!", "The people of Nûh (Noah) and the  confederates after them denied (their Messengers) before these, and  every (disbelieving) nation plotted against their Messenger to seize  him, and disputed by means of falsehood to refute therewith the  truth. So I seized them (with punishment), and how (terrible) was My  punishment!", "Thus has the Word of your Lord been justified against those who disbelieved, that they will be the dwellers of the Fire.", "Those (angels) who bear the Throne (of  Allâh) and those around it glorify the praises of their Lord, and  believe in Him, and ask forgiveness for those who believe (in the  Oneness of Allâh) (saying): ”Our Lord! You comprehend all things in  mercy and knowledge, so forgive those who repent and follow Your Way,  and save them from the torment of the blazing Fire!", "”Our Lord! And make them enter the ’Adn  (Eden) Paradise (everlasting Gardens) which you have promised them, and  to the righteous among their fathers, their wives, and their offspring!  Verily, You are the All-Mighty, the All-Wise.", "”And save them from (the punishment,  because of what they did of) the sins, and whomsoever You save from  (the punishment, because of what they did of) the sins (i.e. excuse  them) that Day, him verily, You have taken into mercy.” And that is the  supreme success.", "Those who disbelieve will be addressed  (at the time of entering into the Fire): ”Allâh’s aversion was greater  towards you (in the worldly life when you used to reject the Faith)  than your aversion towards one another (now in the Fire of Hell, as you  are now enemies to one another), when you were called to the Faith but  you used to refuse.”", "They will say: ”Our Lord! You have made  us to die twice (i.e. we were dead in the loins of our fathers and dead  after our deaths in this world), and You have given us life twice (i.e.  life when we were born and life when we are Resurrected)! Now we  confess our sins, then is there any way to get out (of the Fire)?”", "(It will be said): ”This is because,  when Allâh Alone was invoked (in worship, etc.) you disbelieved, but  when partners were joined to Him, you believed! So the judgement is  only with Allâh, the Most High, the Most Great!”", "It is He, Who shows you His Ayât  (proofs, evidences, verses, lessons, signs, revelations, etc.) and  sends down (rain with which grows) provision for you from the sky. And  none remembers but those who turn (to Allâh) in obedience and in  repentance (by begging His Pardon and by worshipping and obeying Him  Alone and none else).", "So, call you (O Muhammad SAW and the  believers) upon (or invoke) Allâh making (your) worship pure for Him  (Alone) (by worshipping none but Him and by doing religious deeds  sincerely for Allâh’s sake only and not to show-off and not to set up  rivals with Him in worship). However much the disbelievers (in the  Oneness of Allâh) may hate (it).", "(He is Allâh) Owner of High Ranks and  Degrees, the Owner of the Throne. He sends the Inspiration by His  Command to any of His slaves He wills, that he (the person who receives  inspiration) may warn (men) of the Day of Mutual Meeting (i.e. The Day  of Resurrection).", "The Day when they will (all) come out,  nothing of them will be hidden from Allâh. Whose is the kingdom this  Day? (Allâh Himself will reply to His Question): It is Allâh’s the One,  the Irresistible!", "This Day shall every person be  recompensed for what he earned. No injustice (shall be done to  anybody). Truly, Allâh is Swift in reckoning.", "And warn them (O Muhammad SAW) of the  Day that is drawing near (i.e. the Day of Resurrection), when the  hearts will be choking the throats, and they can neither return them  (hearts) to their chests nor can they throw them out. There will be no  friend, nor an intercessor for the Zâlimûn (polytheists and  wrong-doers, etc.), who could be given heed to.", "Allâh knows the fraud of the eyes, and all that the breasts conceal.", "And Allâh judges with truth, while those  to whom they invoke besides Him, cannot judge anything. Certainly,  Allâh! He is the All-Hearer, the All-Seer.", "Have they not travelled in the land and  seen what was the end of those who were before them? They were superior  to them in strength, and in the traces (which they left) in the land.  But Allâh seized them with punishment for their sins. And none had they  to protect them from Allâh.", "That was because there came to them  their Messengers with clear evidences, proofs and signs but they  disbelieved (in them). So Allâh seized them with punishment. Verily, He  is All-Strong, Severe in punishment.", "And indeed We sent Mûsa (Moses) with Our  Ayât (proofs, evidences, verses, lessons, signs, revelations, etc.),  and a manifest authority,", "To Fir’aun (Pharaoh), Hâmân and Qârûn (Korah), but they called (him): ”A sorcerer, a liar!”", "Then, when he brought them the Truth  from Us, they said: ”Kill the sons of those who believe with him and  let their women live”, but the plots of disbelievers are nothing but  errors!", "Fir’aun (Pharaoh) said: ”Leave me to  kill Mûsa (Moses), and let him call his Lord (to stop me from killing  him)! I fear that he may change your religion, or that he may cause  mischief to appear in the land!”", "Mûsa (Moses) said: ”Verily, I seek  refuge in my Lord and your Lord from every arrogant who believes not in  the Day of Reckoning!”", "And a believing man of Fir’aun’s  (Pharaoh) family, who hid his faith said: ”Would you kill a man because  he says: My Lord is Allâh, and he has come to you with clear signs  (proofs) from your Lord? And if he is a liar, upon him will be (the sin  of) his lie; but if he is telling the truth, then some of that  (calamity) wherewith he threatens you will befall on you.” Verily,  Allâh guides not one who is a Musrif (a polytheist, or a murderer who  shed blood without a right, or those who commit great sins, oppressor,  transgressor), a liar!", "”O my people! Yours is the kingdom this  day, you are uppermost in the land. But who will save us from the  Torment of Allâh, should it befall us?” Fir’aun (Pharaoh) said: ”I show  you only that which I see (correct), and I guide you only to the path  of right policy!”", "And he who believed said: ”O my people! Verily, I fear for you a fate like that day (of disaster) of the Confederates (of old)!", "”Like the fate of the people of Nûh  (Noah), and ’Ad, and Thamûd and those who came after them. And Allâh  wills no injustice for (His) slaves.", "”And, O my people! Verily! I fear for  you the Day when there will be mutual calling (between the people of  Hell and of Paradise).”", "A Day when you will turn your backs and  flee having no protector from Allâh, And whomsoever Allâh sends astray,  for him there is no guide.", "And indeed Yûsuf (Joseph) did come to  you, in times gone by, with clear signs, but you ceased not to doubt in  that which he did bring to you, till when he died you said: ”No  Messenger will Allâh send after him.” Thus Allâh leaves astray him who  is a Musrif (a polytheist, oppressor, a criminal, sinner who commit  great sins) and a Murtâb (one who doubts Allâh’s Warning and His  Oneness).", "Those who dispute about the Ayât  (proofs, evidences, verses, lessons, signs, revelations, etc.) of  Allâh, without any authority that has come to them, it is greatly  hateful and disgusting to Allâh and to those who believe. Thus does  Allâh seal up the heart of every arrogant, tyrant. (So they cannot  guide themselves to the Right Path).", "And Fir’aun (Pharaoh) said: ”O Hâmân! Build me a tower that I may arrive at the ways,", "”The ways of the heavens, and I may look  upon the Ilâh (God) of Mûsa (Moses) but verily, I think him to be a  liar.” Thus it was made fair-seeming, in Fir’aun’s (Pharaoh) eyes, the  evil of his deeds, and he was hindered from the (Right) Path, and the  plot of Fir’aun (Pharaoh) led to nothing but loss and destruction (for  him).", "And the man who believed said: ”O my  people! Follow me, I will guide you to the way of right conduct [i.e.  guide you to Allâh’s religion of Islâmic Monotheism with which Mûsa  (Moses) has been sent].", "”O my people! Truly, this life of the  world is nothing but a (quick passing) enjoyment, and verily, the  Hereafter that is the home that will remain forever.”", "”Whosoever does an evil deed, will not  be requited except the like thereof, and whosoever does a righteous  deed, whether male or female and is a true believer (in the Oneness of  Allâh), such will enter Paradise, where they will be provided therein  (with all things in abundance) without limit.", "”And O my people! How is it that I call you to salvation while you call me to the Fire!", "”You invite me to disbelieve in Allâh  (and in His Oneness), and to join partners in worship with Him; of  which I have no knowledge, and I invite you to the All-Mighty, the  Oft-Forgiving!", "”No doubt you call me to (worship) one  who cannot grant (me) my request (or respond to my invocation) in this  world or in the Hereafter. And our return will be to Allâh, and  Al-Musrifûn (i.e. polytheists and arrogants, those who commit great  sins, the transgressors of Allâh’s set limits)! They shall be the  dwellers of the Fire!", "”And you will remember what I am telling you, and my affair I leave it to Allâh. Verily, Allâh is the All-Seer of (His) slaves.”", "So Allâh saved him from the evils that they plotted (against him), while an evil torment encompassed Fir’aun’s (Pharaoh) people.", "The Fire; they are exposed to it,  morning and afternoon, and on the Day when the Hour will be established  (it will be said to the angels): ”Cause Fir’aun’s (Pharaoh) people to  enter the severest torment!”", "And, when they will dispute in the Fire,  the weak will say to those who were arrogant; ”Verily! We followed you,  can you then take from us some portion of the Fire?”", "Those who were arrogant will say: ”We are all (together) in this (Fire)! Verily Allâh has judged between (His) slaves!”", "And those in the Fire will say to the keepers (angels) of Hell: ”Call upon your Lord to lighten for us the torment for a day!”", "They will say: ”Did there not come to  you, your Messengers with (clear) evidences and signs? They will say:  ”Yes.” They will reply: ”Then call (as you like)! And the invocation of  the disbelievers is nothing but in error!”", "Verily, We will indeed make victorious  Our Messengers and those who believe (in the Oneness of Allâh Islâmic  Monotheism) in this world’s life and on the Day when the witnesses will  stand forth, (i.e. Day of Resurrection),", "The Day when their excuses will be of no  profit to Zâlimûn (polytheists, wrong-doers and disbelievers in the  Oneness of Allâh). Theirs will be the curse, and theirs will be the  evil abode (i.e. painful torment in Hell-fire).", "And, indeed We gave Mûsa (Moses) the  guidance, and We caused the Children of Israel to inherit the Scripture  [i.e. the Taurât (Torah)],", "A guide and a reminder for men of understanding.", "So be patient (O Muhammad SAW). Verily,  the Promise of Allâh is true, and ask forgiveness for your fault, and  glorify the praises of your Lord in the Ashi (i.e. the time period  after the midnoon till sunset) and in the Ibkâr (i.e. the time period  from early morning or sunrise till before midnoon) [it is said that,  that means the five compulsory congregational Salât (prayers) or the  ’Asr and Fajr prayers].", "Verily, those who dispute about the Ayât  (proofs, evidences, verses, lessons, signs, revelations, etc.) of  Allâh, without any authority having come to them, there is nothing else  in their breasts except pride [to accept you (Muhammad SAW) as a  Messenger of Allâh and to obey you]. They will never have it (i.e.  Prophethood which Allâh has bestowed upon you). So seek refuge in Allâh  (O Muhammad SAW from the arrogants). Verily, it is He Who is the  All-Hearer, the All-Seer.", "The creation of the heavens and the earth is indeed greater than the creation of mankind, yet most of mankind know not.", "And not equal are the blind and those  who see, nor are (equal) those who believe (in the Oneness of Allâh  Islâmic Monotheism), and do righteous good deeds, and those who do  evil. Little do you remember!", "Verily, the Hour (Day of Judgement) is surely coming, therein is no doubt, yet most men believe not.", "And your Lord said: ”Invoke Me, [i.e.  believe in My Oneness (Islâmic Monotheism)] (and ask Me for anything) I  will respond to your (invocation). Verily! Those who scorn My worship  [i.e. do not invoke Me, and do not believe in My Oneness, (Islâmic  Monotheism)] they will surely enter Hell in humiliation!”", "Allâh, it is He Who has made the night  for you that you may rest therein and the day for you to see. Truly,  Allâh is full of Bounty to mankind, yet most of mankind give no thanks.", "That is Allâh, your Lord, the Creator of  all things, Lâ ilâha illa Huwa (none has the right to be worshipped but  He), where then you are turning away (from Allâh, by worshipping others  instead of Him)!", "Thus were turned away those who used to deny the Ayât (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allâh.", "Allâh, it is He Who has made for you the  earth as a dwelling place and the sky as a canopy, and has given you  shape and made your shapes good (looking) and has provided you with  good things. That is Allâh, your Lord, then blessed be Allâh, the Lord  of the ’Alamîn (mankind, jinns and all that exists).", "He is the Ever Living, Lâ ilâha illa  Huwa (none has the right to be worshipped but He), so invoke Him making  your worship pure for Him Alone (by worshipping Him Alone, and none  else, and by doing righteous deeds sincerely for Allâh’s sake only, and  not to show off, and not to set up rivals with Him in worship). All the  praises and thanks be to Allâh, the Lord of the ’Alamîn (mankind, jinns  and all that exists).", "Say (O Muhammad SAW): ”I have been  forbidden to worship those whom you worship besides Allâh, since there  have come to me evidences from my Lord, and I am commanded to submit  (in Islâm) to the Lord of the ’Alamîn (mankind, jinns and all that  exists).", "He, it is Who has created you (Adam)  from dust, then from a Nutfah [mixed semen drops of male and female  discharge (i.e. Adam’s offspring)] then from a clot (a piece of  coagulated blood), then brings you forth as children, then (makes you  grow) to reach the age of full strength, and afterwards to be old (men  and women), though some among you die before, and that you reach an  appointed term, in order that you may understand.", "He it is Who gives life and causes death. And when He decides upon a thing He says to it only: ”Be!” and it is.", "See you not those who dispute about the  Ayât (proofs, evidences, verses, lessons, signs, revelations, etc.) of  Allâh? How are they turning away (from the truth, i.e. Islâmic  Monotheism to the falsehood of polytheism)?", "Those who deny the Book (this Qur’ân),  and that with which We sent Our Messengers (i.e. to worship none but  Allâh Alone sincerely, and to reject all false deities and to confess  resurrection after the death for recompense) they will come to know  (when they will be cast into the Fire of Hell).", "When iron collars will be rounded over their necks, and the chains, they shall be dragged along.", "In the boiling water, then they will be burned in the Fire.", "Then it will be said to them: ”Where are (all) those whom you used to join in worship as partners", "”Besides Allâh” They will say: ”They  have vanished from us: Nay, we did not invoke (worship) anything  before.” Thus Allâh leads astray the disbelievers.", "That was because you had been exulting  in the earth without any right (by worshipping others instead of Allâh  and by committing crimes), and that you used to rejoice extremely (in  your error).", "Enter the gates of Hell to abide therein, and (indeed) what an evil abode of the arrogant!", "So be patient (O Muhammad SAW), verily,  the Promise of Allâh is true, and whether We show you (O Muhammad SAW  in this world) some part of what We have promised them, or We cause you  to die, then it is to Us they all shall be returned.", "And, indeed We have sent Messengers  before you (O Muhammad SAW); of some of them We have related to you  their story and of some We have not related to you their story, and it  was not given to any Messenger that he should bring a sign except by  the Leave of Allâh. So, when comes the Commandment of Allâh, the matter  will be decided with truth, and the followers of falsehood will then be  lost.", "Allâh, it is He Who has made cattle for you, that you may ride on some of them and of some you eat.", "And you have (many other) benefits from  them, and that you may reach by their means a desire that is in your  breasts (i.e. carry your goods, loads, etc.), and on them and on ships  you are carried.", "And He shows you His Signs and Proofs  (of His Oneness in all the above mentioned things). Which, then of the  Signs and Proofs of Allâh do you deny?", "Have they not travelled through the  earth and seen what was the end of those before them? They were more  numerous than them and mightier in strength, and in the traces (they  have left behind them) in the land, yet all that they used to earn  availed them not.", "Then when their Messengers came to them  with clear proofs, they were glad (and proud) with that which they had  of the knowledge (of worldly things): And that at which they used to  mock, surrounded them (i.e. the punishment).", "So when they saw Our punishment, they  said: ”We believe in Allâh Alone and reject (all) that we used to  associate with Him as (His) partners.", "Then their Faith (in Islâmic Monotheism)  could not avail them when they saw Our punishment. (Like) this has been  the way of Allâh in dealing with His slaves. And there the disbelievers  lost utterly (when Our Torment covered them)."]}