{"name_ar": "سورة المائدة", "ayahs_ar": ["يَا أَيُّهَا الَّذِينَ آمَنُواْ  أَوْفُواْ بِالْعُقُودِ أُحِلَّتْ لَكُم بَهِيمَةُ الأَنْعَامِ إِلاَّ مَا  يُتْلَى عَلَيْكُمْ غَيْرَ مُحِلِّي الصَّيْدِ وَأَنتُمْ حُرُمٌ إِنَّ  اللّهَ يَحْكُمُ مَا يُرِيدُ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ لاَ  تُحِلُّواْ شَعَآئِرَ اللّهِ وَلاَ الشَّهْرَ الْحَرَامَ وَلاَ الْهَدْيَ  وَلاَ الْقَلآئِدَ وَلا آمِّينَ الْبَيْتَ الْحَرَامَ يَبْتَغُونَ فَضْلاً  مِّن رَّبِّهِمْ وَرِضْوَانًا وَإِذَا حَلَلْتُمْ فَاصْطَادُواْ وَلاَ  يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ أَن صَدُّوكُمْ عَنِ الْمَسْجِدِ  الْحَرَامِ أَن تَعْتَدُواْ وَتَعَاوَنُواْ عَلَى الْبرِّ وَالتَّقْوَى  وَلاَ تَعَاوَنُواْ عَلَى الإِثْمِ وَالْعُدْوَانِ وَاتَّقُواْ اللّهَ  إِنَّ اللّهَ شَدِيدُ الْعِقَابِ", "حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ  وَالْدَّمُ وَلَحْمُ الْخِنْزِيرِ وَمَا أُهِلَّ لِغَيْرِ اللّهِ بِهِ  وَالْمُنْخَنِقَةُ وَالْمَوْقُوذَةُ وَالْمُتَرَدِّيَةُ وَالنَّطِيحَةُ  وَمَا أَكَلَ السَّبُعُ إِلاَّ مَا ذَكَّيْتُمْ وَمَا ذُبِحَ عَلَى  النُّصُبِ وَأَن تَسْتَقْسِمُواْ بِالأَزْلاَمِ ذَلِكُمْ فِسْقٌ الْيَوْمَ  يَئِسَ الَّذِينَ كَفَرُواْ مِن دِينِكُمْ فَلاَ تَخْشَوْهُمْ وَاخْشَوْنِ  الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي  وَرَضِيتُ لَكُمُ الإِسْلاَمَ دِينًا فَمَنِ اضْطُرَّ فِي مَخْمَصَةٍ  غَيْرَ مُتَجَانِفٍ لِّإِثْمٍ فَإِنَّ اللّهَ غَفُورٌ رَّحِيمٌ", "يَسْأَلُونَكَ مَاذَا أُحِلَّ لَهُمْ قُلْ  أُحِلَّ لَكُمُ الطَّيِّبَاتُ وَمَا عَلَّمْتُم مِّنَ الْجَوَارِحِ  مُكَلِّبِينَ تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ اللّهُ فَكُلُواْ  مِمَّا أَمْسَكْنَ عَلَيْكُمْ وَاذْكُرُواْ اسْمَ اللّهِ عَلَيْهِ  وَاتَّقُواْ اللّهَ إِنَّ اللّهَ سَرِيعُ الْحِسَابِ", "الْيَوْمَ أُحِلَّ لَكُمُ الطَّيِّبَاتُ  وَطَعَامُ الَّذِينَ أُوتُواْ الْكِتَابَ حِلٌّ لَّكُمْ وَطَعَامُكُمْ  حِلُّ لَّهُمْ وَالْمُحْصَنَاتُ مِنَ الْمُؤْمِنَاتِ وَالْمُحْصَنَاتُ  مِنَ الَّذِينَ أُوتُواْ الْكِتَابَ مِن قَبْلِكُمْ إِذَا آتَيْتُمُوهُنَّ  أُجُورَهُنَّ مُحْصِنِينَ غَيْرَ مُسَافِحِينَ وَلاَ مُتَّخِذِي أَخْدَانٍ  وَمَن يَكْفُرْ بِالإِيمَانِ فَقَدْ حَبِطَ عَمَلُهُ وَهُوَ فِي الآخِرَةِ  مِنَ الْخَاسِرِينَ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ إِذَا  قُمْتُمْ إِلَى الصَّلاةِ فاغْسِلُواْ وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى  الْمَرَافِقِ وَامْسَحُواْ بِرُؤُوسِكُمْ وَأَرْجُلَكُمْ إِلَى  الْكَعْبَينِ وَإِن كُنتُمْ جُنُبًا فَاطَّهَّرُواْ وَإِن كُنتُم مَّرْضَى  أَوْ عَلَى سَفَرٍ أَوْ جَاء أَحَدٌ مَّنكُم مِّنَ الْغَائِطِ أَوْ  لاَمَسْتُمُ النِّسَاء فَلَمْ تَجِدُواْ مَاء فَتَيَمَّمُواْ صَعِيدًا  طَيِّبًا فَامْسَحُواْ بِوُجُوهِكُمْ وَأَيْدِيكُم مِّنْهُ مَا يُرِيدُ  اللّهُ لِيَجْعَلَ عَلَيْكُم مِّنْ حَرَجٍ وَلَـكِن يُرِيدُ  لِيُطَهَّرَكُمْ وَلِيُتِمَّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ  تَشْكُرُونَ", "وَاذْكُرُواْ نِعْمَةَ اللّهِ عَلَيْكُمْ  وَمِيثَاقَهُ الَّذِي وَاثَقَكُم بِهِ إِذْ قُلْتُمْ سَمِعْنَا  وَأَطَعْنَا وَاتَّقُواْ اللّهَ إِنَّ اللّهَ عَلِيمٌ بِذَاتِ الصُّدُورِ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ كُونُواْ  قَوَّامِينَ لِلّهِ شُهَدَاء بِالْقِسْطِ وَلاَ يَجْرِمَنَّكُمْ شَنَآنُ  قَوْمٍ عَلَى أَلاَّ تَعْدِلُواْ اعْدِلُواْ هُوَ أَقْرَبُ لِلتَّقْوَى  وَاتَّقُواْ اللّهَ إِنَّ اللّهَ خَبِيرٌ بِمَا تَعْمَلُونَ", "وَعَدَ اللّهُ الَّذِينَ آمَنُواْ وَعَمِلُواْ الصَّالِحَاتِ لَهُم مَّغْفِرَةٌ وَأَجْرٌ عَظِيمٌ", "وَالَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِآيَاتِنَا أُوْلَـئِكَ أَصْحَابُ الْجَحِيمِ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ  اذْكُرُواْ نِعْمَتَ اللّهِ عَلَيْكُمْ إِذْ هَمَّ قَوْمٌ أَن يَبْسُطُواْ  إِلَيْكُمْ أَيْدِيَهُمْ فَكَفَّ أَيْدِيَهُمْ عَنكُمْ وَاتَّقُواْ اللّهَ  وَعَلَى اللّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ", "وَلَقَدْ أَخَذَ اللّهُ مِيثَاقَ بَنِي  إِسْرَآئِيلَ وَبَعَثْنَا مِنهُمُ اثْنَيْ عَشَرَ نَقِيبًا وَقَالَ اللّهُ  إِنِّي مَعَكُمْ لَئِنْ أَقَمْتُمُ الصَّلاَةَ وَآتَيْتُمُ الزَّكَاةَ  وَآمَنتُم بِرُسُلِي وَعَزَّرْتُمُوهُمْ وَأَقْرَضْتُمُ اللّهَ قَرْضًا  حَسَنًا لَّأُكَفِّرَنَّ عَنكُمْ سَيِّئَاتِكُمْ وَلأُدْخِلَنَّكُمْ  جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ فَمَن كَفَرَ بَعْدَ ذَلِكَ  مِنكُمْ فَقَدْ ضَلَّ سَوَاء السَّبِيلِ", "فَبِمَا نَقْضِهِم مِّيثَاقَهُمْ  لَعنَّاهُمْ وَجَعَلْنَا قُلُوبَهُمْ قَاسِيَةً يُحَرِّفُونَ الْكَلِمَ  عَن مَّوَاضِعِهِ وَنَسُواْ حَظًّا مِّمَّا ذُكِّرُواْ بِهِ وَلاَ تَزَالُ  تَطَّلِعُ عَلَىَ خَآئِنَةٍ مِّنْهُمْ إِلاَّ قَلِيلاً مِّنْهُمُ فَاعْفُ  عَنْهُمْ وَاصْفَحْ إِنَّ اللّهَ يُحِبُّ الْمُحْسِنِينَ", "وَمِنَ الَّذِينَ قَالُواْ إِنَّا  نَصَارَى أَخَذْنَا مِيثَاقَهُمْ فَنَسُواْ حَظًّا مِّمَّا ذُكِّرُواْ  بِهِ فَأَغْرَيْنَا بَيْنَهُمُ الْعَدَاوَةَ وَالْبَغْضَاء إِلَى يَوْمِ  الْقِيَامَةِ وَسَوْفَ يُنَبِّئُهُمُ اللّهُ بِمَا كَانُواْ يَصْنَعُونَ", "يَا أَهْلَ الْكِتَابِ قَدْ جَاءكُمْ  رَسُولُنَا يُبَيِّنُ لَكُمْ كَثِيرًا مِّمَّا كُنتُمْ تُخْفُونَ مِنَ  الْكِتَابِ وَيَعْفُو عَن كَثِيرٍ قَدْ جَاءكُم مِّنَ اللّهِ نُورٌ  وَكِتَابٌ مُّبِينٌ", "يَهْدِي بِهِ اللّهُ مَنِ اتَّبَعَ  رِضْوَانَهُ سُبُلَ السَّلاَمِ وَيُخْرِجُهُم مِّنِ الظُّلُمَاتِ إِلَى  النُّورِ بِإِذْنِهِ وَيَهْدِيهِمْ إِلَى صِرَاطٍ مُّسْتَقِيمٍ", "لَّقَدْ كَفَرَ الَّذِينَ قَآلُواْ إِنَّ  اللّهَ هُوَ الْمَسِيحُ ابْنُ مَرْيَمَ قُلْ فَمَن يَمْلِكُ مِنَ اللّهِ  شَيْئًا إِنْ أَرَادَ أَن يُهْلِكَ الْمَسِيحَ ابْنَ مَرْيَمَ وَأُمَّهُ  وَمَن فِي الأَرْضِ جَمِيعًا وَلِلّهِ مُلْكُ السَّمَاوَاتِ وَالأَرْضِ  وَمَا بَيْنَهُمَا يَخْلُقُ مَا يَشَاء وَاللّهُ عَلَى كُلِّ شَيْءٍ  قَدِيرٌ", "وَقَالَتِ الْيَهُودُ وَالنَّصَارَى  نَحْنُ أَبْنَاء اللّهِ وَأَحِبَّاؤُهُ قُلْ فَلِمَ يُعَذِّبُكُم  بِذُنُوبِكُم بَلْ أَنتُم بَشَرٌ مِّمَّنْ خَلَقَ يَغْفِرُ لِمَن يَشَاء  وَيُعَذِّبُ مَن يَشَاء وَلِلّهِ مُلْكُ السَّمَاوَاتِ وَالأَرْضِ وَمَا  بَيْنَهُمَا وَإِلَيْهِ الْمَصِيرُ", "يَا أَهْلَ الْكِتَابِ قَدْ جَاءكُمْ  رَسُولُنَا يُبَيِّنُ لَكُمْ عَلَى فَتْرَةٍ مِّنَ الرُّسُلِ أَن  تَقُولُواْ مَا جَاءنَا مِن بَشِيرٍ وَلاَ نَذِيرٍ فَقَدْ جَاءكُم بَشِيرٌ  وَنَذِيرٌ وَاللّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ", "وَإِذْ قَالَ مُوسَى لِقَوْمِهِ يَا  قَوْمِ اذْكُرُواْ نِعْمَةَ اللّهِ عَلَيْكُمْ إِذْ جَعَلَ فِيكُمْ  أَنبِيَاء وَجَعَلَكُم مُّلُوكًا وَآتَاكُم مَّا لَمْ يُؤْتِ أَحَدًا مِّن  الْعَالَمِينَ", "يَا قَوْمِ ادْخُلُوا الأَرْضَ  المُقَدَّسَةَ الَّتِي كَتَبَ اللّهُ لَكُمْ وَلاَ تَرْتَدُّوا عَلَى  أَدْبَارِكُمْ فَتَنقَلِبُوا خَاسِرِينَ", "قَالُوا يَا مُوسَى إِنَّ فِيهَا قَوْمًا  جَبَّارِينَ وَإِنَّا لَن نَّدْخُلَهَا حَتَّىَ يَخْرُجُواْ مِنْهَا فَإِن  يَخْرُجُواْ مِنْهَا فَإِنَّا دَاخِلُونَ", "قَالَ رَجُلاَنِ مِنَ الَّذِينَ  يَخَافُونَ أَنْعَمَ اللّهُ عَلَيْهِمَا ادْخُلُواْ عَلَيْهِمُ الْبَابَ  فَإِذَا دَخَلْتُمُوهُ فَإِنَّكُمْ غَالِبُونَ وَعَلَى اللّهِ  فَتَوَكَّلُواْ إِن كُنتُم مُّؤْمِنِينَ", "قَالُواْ يَا مُوسَى إِنَّا لَن  نَّدْخُلَهَا أَبَدًا مَّا دَامُواْ فِيهَا فَاذْهَبْ أَنتَ وَرَبُّكَ  فَقَاتِلا إِنَّا هَاهُنَا قَاعِدُونَ", "قَالَ رَبِّ إِنِّي لا أَمْلِكُ إِلاَّ نَفْسِي وَأَخِي فَافْرُقْ بَيْنَنَا وَبَيْنَ الْقَوْمِ الْفَاسِقِينَ", "قَالَ فَإِنَّهَا مُحَرَّمَةٌ عَلَيْهِمْ أَرْبَعِينَ سَنَةً يَتِيهُونَ فِي الأَرْضِ فَلاَ تَأْسَ عَلَى الْقَوْمِ الْفَاسِقِينَ", "وَاتْلُ عَلَيْهِمْ نَبَأَ ابْنَيْ آدَمَ  بِالْحَقِّ إِذْ قَرَّبَا قُرْبَانًا فَتُقُبِّلَ مِن أَحَدِهِمَا وَلَمْ  يُتَقَبَّلْ مِنَ الآخَرِ قَالَ لَأَقْتُلَنَّكَ قَالَ إِنَّمَا  يَتَقَبَّلُ اللّهُ مِنَ الْمُتَّقِينَ", "لَئِن بَسَطتَ إِلَيَّ يَدَكَ  لِتَقْتُلَنِي مَا أَنَاْ بِبَاسِطٍ يَدِيَ إِلَيْكَ لَأَقْتُلَكَ إِنِّي  أَخَافُ اللّهَ رَبَّ الْعَالَمِينَ", "إِنِّي أُرِيدُ أَن تَبُوءَ بِإِثْمِي وَإِثْمِكَ فَتَكُونَ مِنْ أَصْحَابِ النَّارِ وَذَلِكَ جَزَاء الظَّالِمِينَ", "فَطَوَّعَتْ لَهُ نَفْسُهُ قَتْلَ أَخِيهِ فَقَتَلَهُ فَأَصْبَحَ مِنَ الْخَاسِرِينَ", "فَبَعَثَ اللّهُ غُرَابًا يَبْحَثُ فِي  الأَرْضِ لِيُرِيَهُ كَيْفَ يُوَارِي سَوْءةَ أَخِيهِ قَالَ يَا وَيْلَتَا  أَعَجَزْتُ أَنْ أَكُونَ مِثْلَ هَـذَا الْغُرَابِ فَأُوَارِيَ سَوْءةَ  أَخِي فَأَصْبَحَ مِنَ النَّادِمِينَ", "مِنْ أَجْلِ ذَلِكَ كَتَبْنَا عَلَى بَنِي  إِسْرَائِيلَ أَنَّهُ مَن قَتَلَ نَفْسًا بِغَيْرِ نَفْسٍ أَوْ فَسَادٍ  فِي الأَرْضِ فَكَأَنَّمَا قَتَلَ النَّاسَ جَمِيعًا وَمَنْ أَحْيَاهَا  فَكَأَنَّمَا أَحْيَا النَّاسَ جَمِيعًا وَلَقَدْ جَاء تْهُمْ رُسُلُنَا  بِالبَيِّنَاتِ ثُمَّ إِنَّ كَثِيرًا مِّنْهُم بَعْدَ ذَلِكَ فِي الأَرْضِ  لَمُسْرِفُونَ", "إِنَّمَا جَزَاء الَّذِينَ يُحَارِبُونَ  اللّهَ وَرَسُولَهُ وَيَسْعَوْنَ فِي الأَرْضِ فَسَادًا أَن يُقَتَّلُواْ  أَوْ يُصَلَّبُواْ أَوْ تُقَطَّعَ أَيْدِيهِمْ وَأَرْجُلُهُم مِّنْ خِلافٍ  أَوْ يُنفَوْاْ مِنَ الأَرْضِ ذَلِكَ لَهُمْ خِزْيٌ فِي الدُّنْيَا  وَلَهُمْ فِي الآخِرَةِ عَذَابٌ عَظِيمٌ", "إِلاَّ الَّذِينَ تَابُواْ مِن قَبْلِ أَن تَقْدِرُواْ عَلَيْهِمْ فَاعْلَمُواْ أَنَّ اللّهَ غَفُورٌ رَّحِيمٌ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ  اتَّقُواْ اللّهَ وَابْتَغُواْ إِلَيهِ الْوَسِيلَةَ وَجَاهِدُواْ فِي  سَبِيلِهِ لَعَلَّكُمْ تُفْلِحُونَ", "إِنَّ الَّذِينَ كَفَرُواْ لَوْ أَنَّ  لَهُم مَّا فِي الأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لِيَفْتَدُواْ بِهِ  مِنْ عَذَابِ يَوْمِ الْقِيَامَةِ مَا تُقُبِّلَ مِنْهُمْ وَلَهُمْ  عَذَابٌ أَلِيمٌ", "يُرِيدُونَ أَن يَخْرُجُواْ مِنَ النَّارِ وَمَا هُم بِخَارِجِينَ مِنْهَا وَلَهُمْ عَذَابٌ مُّقِيمٌ", "وَالسَّارِقُ وَالسَّارِقَةُ فَاقْطَعُواْ أَيْدِيَهُمَا جَزَاء بِمَا كَسَبَا نَكَالاً مِّنَ اللّهِ وَاللّهُ عَزِيزٌ حَكِيمٌ", "فَمَن تَابَ مِن بَعْدِ ظُلْمِهِ وَأَصْلَحَ فَإِنَّ اللّهَ يَتُوبُ عَلَيْهِ إِنَّ اللّهَ غَفُورٌ رَّحِيمٌ", "أَلَمْ تَعْلَمْ أَنَّ اللّهَ لَهُ مُلْكُ  السَّمَاوَاتِ وَالأَرْضِ يُعَذِّبُ مَن يَشَاء وَيَغْفِرُ لِمَن يَشَاء  وَاللّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ", "يَا أَيُّهَا الرَّسُولُ لاَ يَحْزُنكَ  الَّذِينَ يُسَارِعُونَ فِي الْكُفْرِ مِنَ الَّذِينَ قَالُواْ آمَنَّا  بِأَفْوَاهِهِمْ وَلَمْ تُؤْمِن قُلُوبُهُمْ وَمِنَ الَّذِينَ هِادُواْ  سَمَّاعُونَ لِلْكَذِبِ سَمَّاعُونَ لِقَوْمٍ آخَرِينَ لَمْ يَأْتُوكَ  يُحَرِّفُونَ الْكَلِمَ مِن بَعْدِ مَوَاضِعِهِ يَقُولُونَ إِنْ  أُوتِيتُمْ هَـذَا فَخُذُوهُ وَإِن لَّمْ تُؤْتَوْهُ فَاحْذَرُواْ وَمَن  يُرِدِ اللّهُ فِتْنَتَهُ فَلَن تَمْلِكَ لَهُ مِنَ اللّهِ شَيْئًا  أُوْلَـئِكَ الَّذِينَ لَمْ يُرِدِ اللّهُ أَن يُطَهِّرَ قُلُوبَهُمْ  لَهُمْ فِي الدُّنْيَا خِزْيٌ وَلَهُمْ فِي الآخِرَةِ عَذَابٌ عَظِيمٌ", "سَمَّاعُونَ لِلْكَذِبِ أَكَّالُونَ  لِلسُّحْتِ فَإِن جَآؤُوكَ فَاحْكُم بَيْنَهُم أَوْ أَعْرِضْ عَنْهُمْ  وَإِن تُعْرِضْ عَنْهُمْ فَلَن يَضُرُّوكَ شَيْئًا وَإِنْ حَكَمْتَ  فَاحْكُم بَيْنَهُمْ بِالْقِسْطِ إِنَّ اللّهَ يُحِبُّ الْمُقْسِطِينَ", "وَكَيْفَ يُحَكِّمُونَكَ وَعِندَهُمُ  التَّوْرَاةُ فِيهَا حُكْمُ اللّهِ ثُمَّ يَتَوَلَّوْنَ مِن بَعْدِ ذَلِكَ  وَمَا أُوْلَـئِكَ بِالْمُؤْمِنِينَ", "إِنَّا أَنزَلْنَا التَّوْرَاةَ فِيهَا  هُدًى وَنُورٌ يَحْكُمُ بِهَا النَّبِيُّونَ الَّذِينَ أَسْلَمُواْ  لِلَّذِينَ هَادُواْ وَالرَّبَّانِيُّونَ وَالأَحْبَارُ بِمَا  اسْتُحْفِظُواْ مِن كِتَابِ اللّهِ وَكَانُواْ عَلَيْهِ شُهَدَاء فَلاَ  تَخْشَوُاْ النَّاسَ وَاخْشَوْنِ وَلاَ تَشْتَرُواْ بِآيَاتِي ثَمَنًا  قَلِيلاً وَمَن لَّمْ يَحْكُم بِمَا أَنزَلَ اللّهُ فَأُوْلَـئِكَ هُمُ  الْكَافِرُونَ", "وَكَتَبْنَا عَلَيْهِمْ فِيهَا أَنَّ  النَّفْسَ بِالنَّفْسِ وَالْعَيْنَ بِالْعَيْنِ وَالأَنفَ بِالأَنفِ  وَالأُذُنَ بِالأُذُنِ وَالسِّنَّ بِالسِّنِّ وَالْجُرُوحَ قِصَاصٌ فَمَن  تَصَدَّقَ بِهِ فَهُوَ كَفَّارَةٌ لَّهُ وَمَن لَّمْ يَحْكُم بِمَا أنزَلَ  اللّهُ فَأُوْلَـئِكَ هُمُ الظَّالِمُونَ", "وَقَفَّيْنَا عَلَى آثَارِهِم بِعَيسَى  ابْنِ مَرْيَمَ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ التَّوْرَاةِ  وَآتَيْنَاهُ الإِنجِيلَ فِيهِ هُدًى وَنُورٌ وَمُصَدِّقًا لِّمَا بَيْنَ  يَدَيْهِ مِنَ التَّوْرَاةِ وَهُدًى وَمَوْعِظَةً لِّلْمُتَّقِينَ", "وَلْيَحْكُمْ أَهْلُ الإِنجِيلِ بِمَا  أَنزَلَ اللّهُ فِيهِ وَمَن لَّمْ يَحْكُم بِمَا أَنزَلَ اللّهُ  فَأُوْلَـئِكَ هُمُ الْفَاسِقُونَ", "وَأَنزَلْنَا إِلَيْكَ الْكِتَابَ  بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ الْكِتَابِ  وَمُهَيْمِنًا عَلَيْهِ فَاحْكُم بَيْنَهُم بِمَا أَنزَلَ اللّهُ وَلاَ  تَتَّبِعْ أَهْوَاءهُمْ عَمَّا جَاءكَ مِنَ الْحَقِّ لِكُلٍّ جَعَلْنَا  مِنكُمْ شِرْعَةً وَمِنْهَاجًا وَلَوْ شَاء اللّهُ لَجَعَلَكُمْ أُمَّةً  وَاحِدَةً وَلَـكِن لِّيَبْلُوَكُمْ فِي مَآ آتَاكُم فَاسْتَبِقُوا  الخَيْرَاتِ إِلَى الله مَرْجِعُكُمْ جَمِيعًا فَيُنَبِّئُكُم بِمَا  كُنتُمْ فِيهِ تَخْتَلِفُونَ", "وَأَنِ احْكُم بَيْنَهُم بِمَآ أَنزَلَ  اللّهُ وَلاَ تَتَّبِعْ أَهْوَاءهُمْ وَاحْذَرْهُمْ أَن يَفْتِنُوكَ عَن  بَعْضِ مَا أَنزَلَ اللّهُ إِلَيْكَ فَإِن تَوَلَّوْاْ فَاعْلَمْ أَنَّمَا  يُرِيدُ اللّهُ أَن يُصِيبَهُم بِبَعْضِ ذُنُوبِهِمْ وَإِنَّ كَثِيرًا  مِّنَ النَّاسِ لَفَاسِقُونَ", "أَفَحُكْمَ الْجَاهِلِيَّةِ يَبْغُونَ وَمَنْ أَحْسَنُ مِنَ اللّهِ حُكْمًا لِّقَوْمٍ يُوقِنُونَ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ لاَ  تَتَّخِذُواْ الْيَهُودَ وَالنَّصَارَى أَوْلِيَاء بَعْضُهُمْ أَوْلِيَاء  بَعْضٍ وَمَن يَتَوَلَّهُم مِّنكُمْ فَإِنَّهُ مِنْهُمْ إِنَّ اللّهَ لاَ  يَهْدِي الْقَوْمَ الظَّالِمِينَ", "فَتَرَى الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ  يُسَارِعُونَ فِيهِمْ يَقُولُونَ نَخْشَى أَن تُصِيبَنَا دَآئِرَةٌ  فَعَسَى اللّهُ أَن يَأْتِيَ بِالْفَتْحِ أَوْ أَمْرٍ مِّنْ عِندِهِ  فَيُصْبِحُواْ عَلَى مَا أَسَرُّواْ فِي أَنْفُسِهِمْ نَادِمِينَ", "وَيَقُولُ الَّذِينَ آمَنُواْ أَهَـؤُلاء  الَّذِينَ أَقْسَمُواْ بِاللّهِ جَهْدَ أَيْمَانِهِمْ إِنَّهُمْ  لَمَعَكُمْ حَبِطَتْ أَعْمَالُهُمْ فَأَصْبَحُواْ خَاسِرِينَ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ مَن  يَرْتَدَّ مِنكُمْ عَن دِينِهِ فَسَوْفَ يَأْتِي اللّهُ بِقَوْمٍ  يُحِبُّهُمْ وَيُحِبُّونَهُ أَذِلَّةٍ عَلَى الْمُؤْمِنِينَ أَعِزَّةٍ  عَلَى الْكَافِرِينَ يُجَاهِدُونَ فِي سَبِيلِ اللّهِ وَلاَ يَخَافُونَ  لَوْمَةَ لآئِمٍ ذَلِكَ فَضْلُ اللّهِ يُؤْتِيهِ مَن يَشَاء وَاللّهُ  وَاسِعٌ عَلِيمٌ", "إِنَّمَا وَلِيُّكُمُ اللّهُ وَرَسُولُهُ  وَالَّذِينَ آمَنُواْ الَّذِينَ يُقِيمُونَ الصَّلاَةَ وَيُؤْتُونَ  الزَّكَاةَ وَهُمْ رَاكِعُونَ", "وَمَن يَتَوَلَّ اللّهَ وَرَسُولَهُ وَالَّذِينَ آمَنُواْ فَإِنَّ حِزْبَ اللّهِ هُمُ الْغَالِبُونَ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ لاَ  تَتَّخِذُواْ الَّذِينَ اتَّخَذُواْ دِينَكُمْ هُزُوًا وَلَعِبًا مِّنَ  الَّذِينَ أُوتُواْ الْكِتَابَ مِن قَبْلِكُمْ وَالْكُفَّارَ أَوْلِيَاء  وَاتَّقُواْ اللّهَ إِن كُنتُم مُّؤْمِنِينَ", "وَإِذَا نَادَيْتُمْ إِلَى الصَّلاَةِ اتَّخَذُوهَا هُزُوًا وَلَعِبًا ذَلِكَ بِأَنَّهُمْ قَوْمٌ لاَّ يَعْقِلُونَ", "قُلْ يَا أَهْلَ الْكِتَابِ هَلْ  تَنقِمُونَ مِنَّا إِلاَّ أَنْ آمَنَّا بِاللّهِ وَمَا أُنزِلَ إِلَيْنَا  وَمَا أُنزِلَ مِن قَبْلُ وَأَنَّ أَكْثَرَكُمْ فَاسِقُونَ", "قُلْ هَلْ أُنَبِّئُكُم بِشَرٍّ مِّن  ذَلِكَ مَثُوبَةً عِندَ اللّهِ مَن لَّعَنَهُ اللّهُ وَغَضِبَ عَلَيْهِ  وَجَعَلَ مِنْهُمُ الْقِرَدَةَ وَالْخَنَازِيرَ وَعَبَدَ الطَّاغُوتَ  أُوْلَـئِكَ شَرٌّ مَّكَاناً وَأَضَلُّ عَن سَوَاء السَّبِيلِ", "وَإِذَا جَآؤُوكُمْ قَالُوَاْ آمَنَّا  وَقَد دَّخَلُواْ بِالْكُفْرِ وَهُمْ قَدْ خَرَجُواْ بِهِ وَاللّهُ  أَعْلَمُ بِمَا كَانُواْ يَكْتُمُونَ", "وَتَرَى كَثِيرًا مِّنْهُمْ يُسَارِعُونَ فِي الإِثْمِ وَالْعُدْوَانِ وَأَكْلِهِمُ السُّحْتَ لَبِئْسَ مَا كَانُواْ يَعْمَلُونَ", "لَوْلاَ يَنْهَاهُمُ الرَّبَّانِيُّونَ  وَالأَحْبَارُ عَن قَوْلِهِمُ الإِثْمَ وَأَكْلِهِمُ السُّحْتَ لَبِئْسَ  مَا كَانُواْ يَصْنَعُونَ", "وَقَالَتِ الْيَهُودُ يَدُ اللّهِ  مَغْلُولَةٌ غُلَّتْ أَيْدِيهِمْ وَلُعِنُواْ بِمَا قَالُواْ بَلْ يَدَاهُ  مَبْسُوطَتَانِ يُنفِقُ كَيْفَ يَشَاء وَلَيَزِيدَنَّ كَثِيرًا مِّنْهُم  مَّا أُنزِلَ إِلَيْكَ مِن رَّبِّكَ طُغْيَانًا وَكُفْرًا وَأَلْقَيْنَا  بَيْنَهُمُ الْعَدَاوَةَ وَالْبَغْضَاء إِلَى يَوْمِ الْقِيَامَةِ  كُلَّمَا أَوْقَدُواْ نَارًا لِّلْحَرْبِ أَطْفَأَهَا اللّهُ وَيَسْعَوْنَ  فِي الأَرْضِ فَسَادًا وَاللّهُ لاَ يُحِبُّ الْمُفْسِدِينَ", "وَلَوْ أَنَّ أَهْلَ الْكِتَابِ آمَنُواْ وَاتَّقَوْاْ لَكَفَّرْنَا عَنْهُمْ سَيِّئَاتِهِمْ وَلأدْخَلْنَاهُمْ جَنَّاتِ النَّعِيمِ", "وَلَوْ أَنَّهُمْ أَقَامُواْ التَّوْرَاةَ  وَالإِنجِيلَ وَمَا أُنزِلَ إِلَيهِم مِّن رَّبِّهِمْ لأكَلُواْ مِن  فَوْقِهِمْ وَمِن تَحْتِ أَرْجُلِهِم مِّنْهُمْ أُمَّةٌ مُّقْتَصِدَةٌ  وَكَثِيرٌ مِّنْهُمْ سَاء مَا يَعْمَلُونَ", "يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا  أُنزِلَ إِلَيْكَ مِن رَّبِّكَ وَإِن لَّمْ تَفْعَلْ فَمَا بَلَّغْتَ  رِسَالَتَهُ وَاللّهُ يَعْصِمُكَ مِنَ النَّاسِ إِنَّ اللّهَ لاَ يَهْدِي  الْقَوْمَ الْكَافِرِينَ", "قُلْ يَا أَهْلَ الْكِتَابِ لَسْتُمْ  عَلَى شَيْءٍ حَتَّىَ تُقِيمُواْ التَّوْرَاةَ وَالإِنجِيلَ وَمَا أُنزِلَ  إِلَيْكُم مِّن رَّبِّكُمْ وَلَيَزِيدَنَّ كَثِيرًا مِّنْهُم مَّا أُنزِلَ  إِلَيْكَ مِن رَّبِّكَ طُغْيَانًا وَكُفْرًا فَلاَ تَأْسَ عَلَى الْقَوْمِ  الْكَافِرِينَ", "إِنَّ الَّذِينَ آمَنُواْ وَالَّذِينَ  هَادُواْ وَالصَّابِؤُونَ وَالنَّصَارَى مَنْ آمَنَ بِاللّهِ وَالْيَوْمِ  الآخِرِ وعَمِلَ صَالِحًا فَلاَ خَوْفٌ عَلَيْهِمْ وَلاَ هُمْ يَحْزَنُونَ", "لَقَدْ أَخَذْنَا مِيثَاقَ بَنِي  إِسْرَائِيلَ وَأَرْسَلْنَا إِلَيْهِمْ رُسُلاً كُلَّمَا جَاءهُمْ رَسُولٌ  بِمَا لاَ تَهْوَى أَنْفُسُهُمْ فَرِيقًا كَذَّبُواْ وَفَرِيقًا  يَقْتُلُونَ", "وَحَسِبُواْ أَلاَّ تَكُونَ فِتْنَةٌ  فَعَمُواْ وَصَمُّواْ ثُمَّ تَابَ اللّهُ عَلَيْهِمْ ثُمَّ عَمُواْ  وَصَمُّواْ كَثِيرٌ مِّنْهُمْ وَاللّهُ بَصِيرٌ بِمَا يَعْمَلُونَ", "لَقَدْ كَفَرَ الَّذِينَ قَالُواْ إِنَّ  اللّهَ هُوَ الْمَسِيحُ ابْنُ مَرْيَمَ وَقَالَ الْمَسِيحُ يَا بَنِي  إِسْرَائِيلَ اعْبُدُواْ اللّهَ رَبِّي وَرَبَّكُمْ إِنَّهُ مَن يُشْرِكْ  بِاللّهِ فَقَدْ حَرَّمَ اللّهُ عَلَيهِ الْجَنَّةَ وَمَأْوَاهُ النَّارُ  وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ", "لَّقَدْ كَفَرَ الَّذِينَ قَالُواْ إِنَّ  اللّهَ ثَالِثُ ثَلاَثَةٍ وَمَا مِنْ إِلَـهٍ إِلاَّ إِلَـهٌ وَاحِدٌ  وَإِن لَّمْ يَنتَهُواْ عَمَّا يَقُولُونَ لَيَمَسَّنَّ الَّذِينَ  كَفَرُواْ مِنْهُمْ عَذَابٌ أَلِيمٌ", "أَفَلاَ يَتُوبُونَ إِلَى اللّهِ وَيَسْتَغْفِرُونَهُ وَاللّهُ غَفُورٌ رَّحِيمٌ", "مَّا الْمَسِيحُ ابْنُ مَرْيَمَ إِلاَّ  رَسُولٌ قَدْ خَلَتْ مِن قَبْلِهِ الرُّسُلُ وَأُمُّهُ صِدِّيقَةٌ كَانَا  يَأْكُلاَنِ الطَّعَامَ انظُرْ كَيْفَ نُبَيِّنُ لَهُمُ الآيَاتِ ثُمَّ  انظُرْ أَنَّى يُؤْفَكُونَ", "قُلْ أَتَعْبُدُونَ مِن دُونِ اللّهِ مَا لاَ يَمْلِكُ لَكُمْ ضَرًّا وَلاَ نَفْعًا وَاللّهُ هُوَ السَّمِيعُ الْعَلِيمُ", "قُلْ يَا أَهْلَ الْكِتَابِ لاَ تَغْلُواْ  فِي دِينِكُمْ غَيْرَ الْحَقِّ وَلاَ تَتَّبِعُواْ أَهْوَاء قَوْمٍ قَدْ  ضَلُّواْ مِن قَبْلُ وَأَضَلُّواْ كَثِيرًا وَضَلُّواْ عَن سَوَاء  السَّبِيلِ", "لُعِنَ الَّذِينَ كَفَرُواْ مِن بَنِي  إِسْرَائِيلَ عَلَى لِسَانِ دَاوُودَ وَعِيسَى ابْنِ مَرْيَمَ ذَلِكَ  بِمَا عَصَوا وَّكَانُواْ يَعْتَدُونَ", "كَانُواْ لاَ يَتَنَاهَوْنَ عَن مُّنكَرٍ فَعَلُوهُ لَبِئْسَ مَا كَانُواْ يَفْعَلُونَ", "تَرَى كَثِيرًا مِّنْهُمْ يَتَوَلَّوْنَ  الَّذِينَ كَفَرُواْ لَبِئْسَ مَا قَدَّمَتْ لَهُمْ أَنفُسُهُمْ أَن  سَخِطَ اللّهُ عَلَيْهِمْ وَفِي الْعَذَابِ هُمْ خَالِدُونَ", "وَلَوْ كَانُوا يُؤْمِنُونَ بِالله  والنَّبِيِّ وَمَا أُنزِلَ إِلَيْهِ مَا اتَّخَذُوهُمْ أَوْلِيَاء  وَلَـكِنَّ كَثِيرًا مِّنْهُمْ فَاسِقُونَ", "لَتَجِدَنَّ أَشَدَّ النَّاسِ عَدَاوَةً  لِّلَّذِينَ آمَنُواْ الْيَهُودَ وَالَّذِينَ أَشْرَكُواْ وَلَتَجِدَنَّ  أَقْرَبَهُمْ مَّوَدَّةً لِّلَّذِينَ آمَنُواْ الَّذِينَ قَالُوَاْ إِنَّا  نَصَارَى ذَلِكَ بِأَنَّ مِنْهُمْ قِسِّيسِينَ وَرُهْبَانًا وَأَنَّهُمْ  لاَ يَسْتَكْبِرُونَ", "وَإِذَا سَمِعُواْ مَا أُنزِلَ إِلَى  الرَّسُولِ تَرَى أَعْيُنَهُمْ تَفِيضُ مِنَ الدَّمْعِ مِمَّا عَرَفُواْ  مِنَ الْحَقِّ يَقُولُونَ رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ  الشَّاهِدِينَ", "وَمَا لَنَا لاَ نُؤْمِنُ بِاللّهِ وَمَا جَاءنَا مِنَ الْحَقِّ وَنَطْمَعُ أَن يُدْخِلَنَا رَبَّنَا مَعَ الْقَوْمِ الصَّالِحِينَ", "فَأَثَابَهُمُ اللّهُ بِمَا قَالُواْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا وَذَلِكَ جَزَاء الْمُحْسِنِينَ", "وَالَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِآيَاتِنَا أُوْلَـئِكَ أَصْحَابُ الْجَحِيمِ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ لاَ  تُحَرِّمُواْ طَيِّبَاتِ مَا أَحَلَّ اللّهُ لَكُمْ وَلاَ تَعْتَدُواْ  إِنَّ اللّهَ لاَ يُحِبُّ الْمُعْتَدِينَ", "وَكُلُواْ مِمَّا رَزَقَكُمُ اللّهُ حَلاَلاً طَيِّبًا وَاتَّقُواْ اللّهَ الَّذِيَ أَنتُم بِهِ مُؤْمِنُونَ", "لاَ يُؤَاخِذُكُمُ اللّهُ بِاللَّغْوِ فِي  أَيْمَانِكُمْ وَلَـكِن يُؤَاخِذُكُم بِمَا عَقَّدتُّمُ الأَيْمَانَ  فَكَفَّارَتُهُ إِطْعَامُ عَشَرَةِ مَسَاكِينَ مِنْ أَوْسَطِ مَا  تُطْعِمُونَ أَهْلِيكُمْ أَوْ كِسْوَتُهُمْ أَوْ تَحْرِيرُ رَقَبَةٍ فَمَن  لَّمْ يَجِدْ فَصِيَامُ ثَلاَثَةِ أَيَّامٍ ذَلِكَ كَفَّارَةُ  أَيْمَانِكُمْ إِذَا حَلَفْتُمْ وَاحْفَظُواْ أَيْمَانَكُمْ كَذَلِكَ  يُبَيِّنُ اللّهُ لَكُمْ آيَاتِهِ لَعَلَّكُمْ تَشْكُرُونَ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ إِنَّمَا  الْخَمْرُ وَالْمَيْسِرُ وَالأَنصَابُ وَالأَزْلاَمُ رِجْسٌ مِّنْ عَمَلِ  الشَّيْطَانِ فَاجْتَنِبُوهُ لَعَلَّكُمْ تُفْلِحُونَ", "إِنَّمَا يُرِيدُ الشَّيْطَانُ أَن  يُوقِعَ بَيْنَكُمُ الْعَدَاوَةَ وَالْبَغْضَاء فِي الْخَمْرِ  وَالْمَيْسِرِ وَيَصُدَّكُمْ عَن ذِكْرِ اللّهِ وَعَنِ الصَّلاَةِ فَهَلْ  أَنتُم مُّنتَهُونَ", "وَأَطِيعُواْ اللّهَ وَأَطِيعُواْ  الرَّسُولَ وَاحْذَرُواْ فَإِن تَوَلَّيْتُمْ فَاعْلَمُواْ أَنَّمَا عَلَى  رَسُولِنَا الْبَلاَغُ الْمُبِينُ", "لَيْسَ عَلَى الَّذِينَ آمَنُواْ  وَعَمِلُواْ الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُواْ إِذَا مَا اتَّقَواْ  وَّآمَنُواْ وَعَمِلُواْ الصَّالِحَاتِ ثُمَّ اتَّقَواْ وَّآمَنُواْ ثُمَّ  اتَّقَواْ وَّأَحْسَنُواْ وَاللّهُ يُحِبُّ الْمُحْسِنِينَ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ  لَيَبْلُوَنَّكُمُ اللّهُ بِشَيْءٍ مِّنَ الصَّيْدِ تَنَالُهُ أَيْدِيكُمْ  وَرِمَاحُكُمْ لِيَعْلَمَ اللّهُ مَن يَخَافُهُ بِالْغَيْبِ فَمَنِ  اعْتَدَى بَعْدَ ذَلِكَ فَلَهُ عَذَابٌ أَلِيمٌ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ لاَ  تَقْتُلُواْ الصَّيْدَ وَأَنتُمْ حُرُمٌ وَمَن قَتَلَهُ مِنكُم  مُّتَعَمِّدًا فَجَزَاء مِّثْلُ مَا قَتَلَ مِنَ النَّعَمِ يَحْكُمُ بِهِ  ذَوَا عَدْلٍ مِّنكُمْ هَدْيًا بَالِغَ الْكَعْبَةِ أَوْ كَفَّارَةٌ  طَعَامُ مَسَاكِينَ أَو عَدْلُ ذَلِكَ صِيَامًا لِّيَذُوقَ وَبَالَ  أَمْرِهِ عَفَا اللّهُ عَمَّا سَلَف وَمَنْ عَادَ فَيَنتَقِمُ اللّهُ  مِنْهُ وَاللّهُ عَزِيزٌ ذُو انْتِقَامٍ", "أُحِلَّ لَكُمْ صَيْدُ الْبَحْرِ  وَطَعَامُهُ مَتَاعًا لَّكُمْ وَلِلسَّيَّارَةِ وَحُرِّمَ عَلَيْكُمْ  صَيْدُ الْبَرِّ مَا دُمْتُمْ حُرُمًا وَاتَّقُواْ اللّهَ الَّذِيَ  إِلَيْهِ تُحْشَرُونَ", "جَعَلَ اللّهُ الْكَعْبَةَ الْبَيْتَ  الْحَرَامَ قِيَامًا لِّلنَّاسِ وَالشَّهْرَ الْحَرَامَ وَالْهَدْيَ  وَالْقَلاَئِدَ ذَلِكَ لِتَعْلَمُواْ أَنَّ اللّهَ يَعْلَمُ مَا فِي  السَّمَاوَاتِ وَمَا فِي الأَرْضِ وَأَنَّ اللّهَ بِكُلِّ شَيْءٍ عَلِيمٌ", "اعْلَمُواْ أَنَّ اللّهَ شَدِيدُ الْعِقَابِ وَأَنَّ اللّهَ غَفُورٌ رَّحِيمٌ", "مَّا عَلَى الرَّسُولِ إِلاَّ الْبَلاَغُ وَاللّهُ يَعْلَمُ مَا تُبْدُونَ وَمَا تَكْتُمُونَ", "قُل لاَّ يَسْتَوِي الْخَبِيثُ  وَالطَّيِّبُ وَلَوْ أَعْجَبَكَ كَثْرَةُ الْخَبِيثِ فَاتَّقُواْ اللّهَ  يَا أُوْلِي الأَلْبَابِ لَعَلَّكُمْ تُفْلِحُونَ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ لاَ  تَسْأَلُواْ عَنْ أَشْيَاء إِن تُبْدَ لَكُمْ تَسُؤْكُمْ وَإِن  تَسْأَلُواْ عَنْهَا حِينَ يُنَزَّلُ الْقُرْآنُ تُبْدَ لَكُمْ عَفَا  اللّهُ عَنْهَا وَاللّهُ غَفُورٌ حَلِيمٌ", "قَدْ سَأَلَهَا قَوْمٌ مِّن قَبْلِكُمْ ثُمَّ أَصْبَحُواْ بِهَا كَافِرِينَ", "مَا جَعَلَ اللّهُ مِن بَحِيرَةٍ وَلاَ  سَآئِبَةٍ وَلاَ وَصِيلَةٍ وَلاَ حَامٍ وَلَـكِنَّ الَّذِينَ كَفَرُواْ  يَفْتَرُونَ عَلَى اللّهِ الْكَذِبَ وَأَكْثَرُهُمْ لاَ يَعْقِلُونَ", "وَإِذَا قِيلَ لَهُمْ تَعَالَوْاْ إِلَى  مَا أَنزَلَ اللّهُ وَإِلَى الرَّسُولِ قَالُواْ حَسْبُنَا مَا وَجَدْنَا  عَلَيْهِ آبَاءنَا أَوَلَوْ كَانَ آبَاؤُهُمْ لاَ يَعْلَمُونَ شَيْئًا  وَلاَ يَهْتَدُونَ", "يَا أَيُّهَا الَّذِينَ آمَنُواْ  عَلَيْكُمْ أَنفُسَكُمْ لاَ يَضُرُّكُم مَّن ضَلَّ إِذَا اهْتَدَيْتُمْ  إِلَى اللّهِ مَرْجِعُكُمْ جَمِيعًا فَيُنَبِّئُكُم بِمَا كُنتُمْ  تَعْمَلُونَ", "يِا أَيُّهَا الَّذِينَ آمَنُواْ  شَهَادَةُ بَيْنِكُمْ إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ حِينَ  الْوَصِيَّةِ اثْنَانِ ذَوَا عَدْلٍ مِّنكُمْ أَوْ آخَرَانِ مِنْ  غَيْرِكُمْ إِنْ أَنتُمْ ضَرَبْتُمْ فِي الأَرْضِ فَأَصَابَتْكُم  مُّصِيبَةُ الْمَوْتِ تَحْبِسُونَهُمَا مِن بَعْدِ الصَّلاَةِ  فَيُقْسِمَانِ بِاللّهِ إِنِ ارْتَبْتُمْ لاَ نَشْتَرِي بِهِ ثَمَنًا  وَلَوْ كَانَ ذَا قُرْبَى وَلاَ نَكْتُمُ شَهَادَةَ اللّهِ إِنَّا إِذًا  لَّمِنَ الآثِمِينَ", "فَإِنْ عُثِرَ عَلَى أَنَّهُمَا  اسْتَحَقَّا إِثْمًا فَآخَرَانِ يِقُومَانُ مَقَامَهُمَا مِنَ الَّذِينَ  اسْتَحَقَّ عَلَيْهِمُ الأَوْلَيَانِ فَيُقْسِمَانِ بِاللّهِ  لَشَهَادَتُنَا أَحَقُّ مِن شَهَادَتِهِمَا وَمَا اعْتَدَيْنَا إِنَّا  إِذًا لَّمِنَ الظَّالِمِينَ", "ذَلِكَ أَدْنَى أَن يَأْتُواْ  بِالشَّهَادَةِ عَلَى وَجْهِهَا أَوْ يَخَافُواْ أَن تُرَدَّ أَيْمَانٌ  بَعْدَ أَيْمَانِهِمْ وَاتَّقُوا اللّهَ وَاسْمَعُواْ وَاللّهُ لاَ  يَهْدِي الْقَوْمَ الْفَاسِقِينَ", "يَوْمَ يَجْمَعُ اللّهُ الرُّسُلَ فَيَقُولُ مَاذَا أُجِبْتُمْ قَالُواْ لاَ عِلْمَ لَنَا إِنَّكَ أَنتَ عَلاَّمُ الْغُيُوبِ", "إِذْ قَالَ اللّهُ يَا عِيسى ابْنَ  مَرْيَمَ اذْكُرْ نِعْمَتِي عَلَيْكَ وَعَلَى وَالِدَتِكَ إِذْ  أَيَّدتُّكَ بِرُوحِ الْقُدُسِ تُكَلِّمُ النَّاسَ فِي الْمَهْدِ  وَكَهْلاً وَإِذْ عَلَّمْتُكَ الْكِتَابَ وَالْحِكْمَةَ وَالتَّوْرَاةَ  وَالإِنجِيلَ وَإِذْ تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ  بِإِذْنِي فَتَنفُخُ فِيهَا فَتَكُونُ طَيْرًا بِإِذْنِي وَتُبْرِىءُ  الأَكْمَهَ وَالأَبْرَصَ بِإِذْنِي وَإِذْ تُخْرِجُ الْمَوتَى بِإِذْنِي  وَإِذْ كَفَفْتُ بَنِي إِسْرَائِيلَ عَنكَ إِذْ جِئْتَهُمْ  بِالْبَيِّنَاتِ فَقَالَ الَّذِينَ كَفَرُواْ مِنْهُمْ إِنْ هَـذَا إِلاَّ  سِحْرٌ مُّبِينٌ", "وَإِذْ أَوْحَيْتُ إِلَى الْحَوَارِيِّينَ أَنْ آمِنُواْ بِي وَبِرَسُولِي قَالُوَاْ آمَنَّا وَاشْهَدْ بِأَنَّنَا مُسْلِمُونَ", "إِذْ قَالَ الْحَوَارِيُّونَ يَا عِيسَى  ابْنَ مَرْيَمَ هَلْ يَسْتَطِيعُ رَبُّكَ أَن يُنَزِّلَ عَلَيْنَا  مَآئِدَةً مِّنَ السَّمَاء قَالَ اتَّقُواْ اللّهَ إِن كُنتُم مُّؤْمِنِينَ", "قَالُواْ نُرِيدُ أَن نَّأْكُلَ مِنْهَا  وَتَطْمَئِنَّ قُلُوبُنَا وَنَعْلَمَ أَن قَدْ صَدَقْتَنَا وَنَكُونَ  عَلَيْهَا مِنَ الشَّاهِدِينَ", "قَالَ عِيسَى ابْنُ مَرْيَمَ اللَّهُمَّ  رَبَّنَا أَنزِلْ عَلَيْنَا مَآئِدَةً مِّنَ السَّمَاء تَكُونُ لَنَا  عِيداً لِّأَوَّلِنَا وَآخِرِنَا وَآيَةً مِّنكَ وَارْزُقْنَا وَأَنتَ  خَيْرُ الرَّازِقِينَ", "قَالَ اللّهُ إِنِّي مُنَزِّلُهَا  عَلَيْكُمْ فَمَن يَكْفُرْ بَعْدُ مِنكُمْ فَإِنِّي أُعَذِّبُهُ عَذَابًا  لاَّ أُعَذِّبُهُ أَحَدًا مِّنَ الْعَالَمِينَ", "وَإِذْ قَالَ اللّهُ يَا عِيسَى ابْنَ  مَرْيَمَ أَأَنتَ قُلتَ لِلنَّاسِ اتَّخِذُونِي وَأُمِّيَ إِلَـهَيْنِ مِن  دُونِ اللّهِ قَالَ سُبْحَانَكَ مَا يَكُونُ لِي أَنْ أَقُولَ مَا لَيْسَ  لِي بِحَقٍّ إِن كُنتُ قُلْتُهُ فَقَدْ عَلِمْتَهُ تَعْلَمُ مَا فِي  نَفْسِي وَلاَ أَعْلَمُ مَا فِي نَفْسِكَ إِنَّكَ أَنتَ عَلاَّمُ  الْغُيُوبِ", "مَا قُلْتُ لَهُمْ إِلاَّ مَا أَمَرْتَنِي  بِهِ أَنِ اعْبُدُواْ اللّهَ رَبِّي وَرَبَّكُمْ وَكُنتُ عَلَيْهِمْ  شَهِيدًا مَّا دُمْتُ فِيهِمْ فَلَمَّا تَوَفَّيْتَنِي كُنتَ أَنتَ  الرَّقِيبَ عَلَيْهِمْ وَأَنتَ عَلَى كُلِّ شَيْءٍ شَهِيدٌ", "إِن تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِن تَغْفِرْ لَهُمْ فَإِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ", "قَالَ اللّهُ هَذَا يَوْمُ يَنفَعُ  الصَّادِقِينَ صِدْقُهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا  الأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا رَّضِيَ اللّهُ عَنْهُمْ وَرَضُواْ  عَنْهُ ذَلِكَ الْفَوْزُ الْعَظِيمُ", "لِلّهِ مُلْكُ السَّمَاوَاتِ وَالأَرْضِ وَمَا فِيهِنَّ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ"], "name_en": "Al-Ma'idah", "ayahs_en": ["O you who believe! Fulfill (your) obligations. Lawful to you (for food) are all the beasts of cattle except that which will be announced to you (herein), game (also) being unlawful when you assume Ihrâm for Hajj or ’Umrah (pilgrimage). Verily, Allâh commands that which He wills.", "O you who believe! Violate not the sanctity of the Symbols of Allâh, nor of the Sacred Month, nor of the animals brought for sacrifice, nor the garlanded people or animals, etc. [Marked by the garlands on their necks made from the outer part of the tree­stems (of Makkah) for their security], nor the people coming to the Sacred House (Makkah), seeking the bounty and good pleasure of their Lord. But when you finish the Ihrâm (of Hajj or ’Umrah), you may hunt, and let not the hatred of some people in (once) stopping you from Al­Masjid­al­Harâm (at Makkah) lead you to transgression (and hostility on your part). Help you one another in Al­Birr and At­Taqwa (virtue, righteousness and piety); but do not help one another in sin and transgression. And fear Allâh. Verily, Allâh is Severe in punishment.", "Forbidden to you (for food) are: Al-Maytatah (the dead animals - cattle-beast not slaughtered), blood, the flesh of swine, and the meat of that which has been slaughtered as a sacrifice for others than Allâh, or has been slaughtered for idols, etc., or on which Allâh’s Name has not been mentioned while slaughtering, and that which has been killed by strangling, or by a violent blow, or by a headlong fall, or by the goring of horns - and that which has been (partly) eaten by a wild animal - unless you are able to slaughter it (before its death) ­ and that which is sacrificed (slaughtered) on An­Nusub (stone altars). (Forbidden) also is to use arrows seeking luck or decision, (all) that is Fisqun (disobedience of Allâh and sin). This day, those who disbelieved have given up all hope of your religion, so fear them not, but fear Me. This day, I have perfected your religion for you, completed My Favour upon you, and have chosen for you Islâm as your religion. But as for him who is forced by severe hunger, with no inclination to sin (such can eat these above-mentioned meats), then surely, Allâh is Oft­Forgiving, Most Merciful.", "They ask you (O Muhammad SAW) what is lawful for them (as food ). Say: ”Lawful unto you are At­Tayyibât [all kind of Halâl (lawful­good) foods which Allâh has made lawful (meat of slaughtered eatable animals, milk products, fats, vegetables and fruits, etc.)]. And those beasts and birds of prey which you have trained as hounds, training and teaching them (to catch) in the manner as directed to you by Allâh; so eat of what they catch for you, but pronounce the Name of Allâh over it, and fear Allâh. Verily, Allâh is Swift in reckoning.”", "Made lawful to you this day are At­Tayyibât [all kinds of Halâl (lawful) foods, which Allâh has made lawful (meat of slaughtered eatable animals, etc., milk products, fats, vegetables and fruits, etc.). The food (slaughtered cattle, eatable animals, etc.) of the people of the Scripture (Jews and Christians) is lawful to you and yours is lawful to them. (Lawful to you in marriage) are chaste women from the believers and chaste women from those who were given the Scripture (Jews and Christians) before your time, when you have given their due Mahr (bridal money given by the husband to his wife at the time of marriage), desiring chastity (i.e. taking them in legal wedlock) not committing illegal sexual intercourse, nor taking them as girl-friends. And whosoever disbelieves in the Oneness of Allâh and in all the other Articles of Faith [i.e. His (Allâh’s), Angels, His Holy Books, His Messengers, the Day of Resurrection and Al­Qadar (Divine Preordainments)], then fruitless is his work, and in the Hereafter he will be among the losers.", "O you who believe! When you intend to offer As-Salât (the prayer), wash your faces and your hands (forearms) up to the elbows, rub (by passing wet hands over) your heads, and (wash) your feet up to ankles. If you are in a state of Janâba (i.e. had a sexual discharge), purify yourself (bathe your whole body). But if you are ill or on a journey or any of you comes from answering the call of nature, or you have been in contact with women (i.e. sexual intercourse) and you find no water, then perform Tayammum with clean earth and rub therewith your faces and hands. Allâh does not want to place you in difficulty, but He wants to purify you, and to complete His Favour on you that you may be thankful.", "And remember Allâh’s Favour upon you and His Covenant with which He bound you when you said: ”We hear and we obey.” And fear Allâh. Verily, Allâh is All­Knower of the secrets of (your) breasts.", "O you who believe! Stand out firmly for Allâh and be just witnesses and let not the enmity and hatred of others make you avoid justice. Be just: that is nearer to piety, and fear Allâh. Verily, Allâh is Well­Acquainted with what you do.", "Allâh has promised those who believe (in the Oneness of Allâh - Islâmic Monotheism) and do deeds of righteousness, that for them there is forgiveness and a great reward (i.e. Paradise).", "They who disbelieve and deny our Ayât (proofs, evidences, verses, lessons, signs, revelations, etc.) are those who will be the dwellers of the Hell­fire.", "O you who believe! Remember the Favour of Allâh unto you when some people desired (made a plan) to stretch out their hands against you, but (Allâh) withheld their hands from you. So fear Allâh. And in Allâh let believers put their trust.", "Indeed Allâh took the covenant from the Children of Israel (Jews), and We appointed twelve leaders among them. And Allâh said: ”I am with you if you perform As-Salât (Iqâmat-as-Salât) and give Zakât and believe in My Messengers; honour and assist them, and lend to Allâh a good loan. Verily, I will remit your sins and admit you to Gardens under which rivers flow (in Paradise). But if any of you after this, disbelieved, he has indeed gone astray from the Straight Path.”", "So because of their breach of their covenant, We cursed them, and made their hearts grow hard. They change the words from their (right) places and have abandoned a good part of the Message that was sent to them. And you will not cease to discover deceit in them, except a few of them. But forgive them, and overlook (their misdeeds). Verily, Allâh loves Al­Muhsinûn (good­doers - see V.2:112).", "And from those who call themselves Christians, We took their covenant, but they have abandoned a good part of the Message that was sent to them. So We planted amongst them enmity and hatred till the Day of Resurrection (when they discarded Allâh’s Book, disobeyed Allâh’s Messengers and His Orders and transgressed beyond bounds in Allâh’s disobedience), and Allâh will inform them of what they used to do.", "O people of the Scripture (Jews and Christians)! Now has come to you Our Messenger (Muhammad SAW) explaining to you much of that which you used to hide from the Scripture and passing over (i.e. leaving out without explaining) much. Indeed, there has come to you from Allâh a light (Prophet Muhammad SAW ) and a plain Book (this Qur’ân).", "Wherewith Allâh guides all those who seek His Good Pleasure to ways of peace, and He brings them out of darkness by His Will unto light and guides them to a Straight Way (Islâmic Monotheism).", "Surely, in disbelief are they who say that Allâh is the Messiah, son of Maryam (Mary). Say (O Muhammad SAW): ”Who then has the least power against Allâh, if He were to destroy the Messiah, son of Maryam (Mary), his mother, and all those who are on the earth together?” And to Allâh belongs the dominion of the heavens and the earth, and all that is between them. He creates what He wills. And Allâh is Able to do all things.", "And (both) the Jews and the Christians say: ”We are the children of Allâh and His loved ones.” Say: ”Why then does He punish you for your sins?” Nay, you are but human beings, of those He has created, He forgives whom He wills and He punishes whom He wills. And to Allâh belongs the dominion of the heavens and the earth and all that is between them, and to Him is the return (of all).", "O people of the Scripture (Jews and Christians)! Now has come to you Our Messenger (Muhammad SAW) making (things) clear unto you, after a break in (the series of) Messengers, lest you say: ”There came unto us no bringer of glad tidings and no warner.” But now has come unto you a bringer of glad tidings and a warner. And Allâh is Able to do all things.", "And (remember) when Mûsa (Moses) said to his people: ”O my people! Remember the Favour of Allâh to you, when He made Prophets among you, made you kings, and gave you what He had not given to any other among the ’Alamîn (mankind and jinns, in the past).”", "”O my people! Enter the holy land (Palestine) which Allâh has assigned to you, and turn not back (in flight) for then you will be returned as losers.”", "They said: ”O Mûsa (Moses)! In it (this holy land) are a people of great strength, and we shall never enter it, till they leave it; when they leave, then we will enter.”", "Two men of those who feared (Allâh and) on whom Allâh had bestowed His Grace [they were íæÔÚ æ ßÇáÈ Yûsha’ (Joshua) and Kâlab (Caleb)] said: ”Assault them through the gate, for when you are in, victory will be yours, and put your trust in Allâh if you are believers indeed.”", "They said: ”O Mûsa (Moses)! We shall never enter it as long as they are there. So go you and your Lord and fight you two, we are sitting right here.”", "He [Mûsa (Moses)] said: ”O my Lord! I have power only over myself and my brother, so separate us from the people who are the Fâsiqûn (rebellious and disobedient to Allâh)!”", "(Allâh) said: ”Therefore it (this holy land) is forbidden to them for forty years; in distraction they will wander through the land. So be not sorrowful over the people who are the Fâsiqûn (rebellious and disobedient to Allâh).”", "And (O Muhammad SAW) recite to them (the Jews) the story of the two sons of Adam [Hâbil (Abel) and Qâbil (Cain)] in truth; when each offered a sacrifice (to Allâh), it was accepted from the one but not from the other. The latter said to the former: ”I will surely kill you.” The former said: ”Verily, Allâh accepts only from those who are Al-Muttaqûn (the pious - see V.2:2).”", "”If you do stretch your hand against me to kill me, I shall never stretch my hand against you to kill you, for I fear Allâh; the Lord of the ’Alamîn (mankind, jinns, and all that exists).”", "”Verily, I intend to let you draw my sin on yourself as well as yours, then you will be one of the dwellers of the Fire, and that is the recompense of the Zâlimûn (polytheists and wrong­doers).”", "So the Nafs (self) of the other (latter one) encouraged him and made fair­seeming to him the murder of his brother; he murdered him and became one of the losers.", "Then Allâh sent a crow who scratched the ground to show him to hide the dead body of his brother. He (the murderer) said: ”Woe to me! Am I not even able to be as this crow and to hide the dead body of my brother?” Then he became one of those who regretted.", "Because of that We ordained for the Children of Israel that if anyone killed a person not in retaliation of murder, or (and) to spread mischief in the land - it would be as if he killed all mankind, and if anyone saved a life, it would be as if he saved the life of all mankind. And indeed, there came to them Our Messengers with clear proofs, evidences, and signs, even then after that many of them continued to exceed the limits (e.g. by doing oppression unjustly and exceeding beyond the limits set by Allâh by committing the major sins) in the land!.", "The recompense of those who wage war against Allâh and His Messenger and do mischief in the land is only that they shall be killed or crucified or their hands and their feet be cut off on the opposite sides, or be exiled from the land. That is their disgrace in this world, and a great torment is theirs in the Hereafter.", "Except for those who (having fled away and then) came back (as Muslims) with repentance before they fall into your power; in that case, know that Allâh is Oft­Forgiving, Most Merciful.", "O you who believe! Do your duty to Allâh and fear Him. Seek the means of approach to Him, and strive hard in His Cause as much as you can. So that you may be successful.", "Verily, those who disbelieve, if they had all that is in the earth, and as much again therewith to ransom themselves thereby from the torment on the Day of Resurrection, it would never be accepted of them, and theirs would be a painful torment.", "They will long to get out of the Fire, but never will they get out therefrom, and theirs will be a lasting torment.", "Cut off (from the wrist joint) the (right) hand of the thief, male or female, as a recompense for that which they committed, a punishment by way of example from Allâh. And Allâh is All­Powerful, All­Wise.", "But whosoever repents after his crime and does righteous good deeds (by obeying Allâh), then verily, Allâh will pardon him (accept his repentance). Verily, Allâh is Oft­Forgiving, Most Merciful.", "Know you not that to Allâh (Alone) belongs the dominion of the heavens and the earth! He punishes whom He wills and He forgives whom He wills. And Allâh is Able to do all things.", "O Messenger (Muhammad SAW)! Let not those who hurry to fall into disbelief grieve you, of such who say: ”We believe” with their mouths but their hearts have no faith. And of the Jews are men who listen much and eagerly to lies - listen to others who have not come to you. They change the words from their places; they say, ”If you are given this, take it, but if you are not given this, then beware!” And whomsoever Allâh wants to put in Al­Fitnah [error, because of his rejecting the Faith], you can do nothing for him against Allâh. Those are the ones whose hearts Allâh does not want to purify (from disbelief and hypocrisy); for them there is a disgrace in this world, and in the Hereafter a great torment.", "(They like to) listen to falsehood, to devour anything forbidden. So if they come to you (O Muhammad SAW), either judge between them, or turn away from them. If you turn away from them, they cannot hurt you in the least. And if you judge, judge with justice between them. Verily, Allâh loves those who act justly.", "But how do they come to you for decision while they have the Taurât (Torah), in which is the (plain) Decision of Allâh; yet even after that, they turn away. For they are not (really) believers.", "Verily, We did send down the Taurât (Torah) [to Mûsa (Moses)], therein was guidance and light, by which the Prophets, who submitted themselves to Allâh’s Will, judged the Jews. And the rabbis and the priests [too judged the Jews by the Taurât (Torah) after those Prophets] for to them was entrusted the protection of Allâh’s Book, and they were witnesses thereto. Therefore fear not men but fear Me (O Jews) and sell not My Verses for a miserable price. And whosoever does not judge by what Allâh has revealed, such are the Kâfirûn (i.e. disbelievers - of a lesser degree as they do not act on Allâh’s Laws).", "And We ordained therein for them: ”Life for life, eye for eye, nose for nose, ear for ear, tooth for tooth, and wounds equal for equal.” But if anyone remits the retaliation by way of charity, it shall be for him an expiation. And whosoever does not judge by that which Allâh has revealed, such are the Zâlimûn (polytheists and wrong­doers - of a lesser degree).", "And in their footsteps, We sent ’Iesa (Jesus), son of Maryam (Mary), confirming the Taurât (Torah) that had come before him, and We gave him the Injeel (Gospel), in which was guidance and light and confirmation of the Taurât (Torah) that had come before it, a guidance and an admonition for Al-Muttaqûn (the pious - see V.2:2).", "Let the people of the Injeel (Gospel) judge by what Allâh has revealed therein. And whosoever does not judge by what Allâh has revealed (then) such (people) are the Fâsiqûn (the rebellious i.e. disobedient (of a lesser degree) to Allâh.", "And We have sent down to you (O Muhammad SAW) the Book (this Qur’ân) in truth, confirming the Scripture that came before it and Mohayminan (trustworthy in highness and a witness) over it (old Scriptures). So judge between them by what Allâh has revealed, and follow not their vain desires, diverging away from the truth that has come to you. To each among you, We have prescribed a law and a clear way. If Allâh willed, He would have made you one nation, but that (He) may test you in what He has given you; so strive as in a race in good deeds. The return of you (all) is to Allâh; then He will inform you about that in which you used to differ.", ". And so judge (you O Muhammad SAW) between them by what Allâh has revealed and follow not their vain desires, but beware of them lest they turn you (O Muhammad SAW) far away from some of that which Allâh has sent down to you. And if they turn away, then know that Allâh’s Will is to punish them for some sins of theirs. And truly, most of men are Fâsiqûn (rebellious and disobedient to Allâh).", "Do they then seek the judgement of (the Days of) Ignorance? And who is better in judgement than Allâh for a people who have firm Faith.", "O you who believe! Take not the Jews and the Christians as Auliyâ’ (friends, protectors, helpers, etc.), they are but Auliyâ’ to one another. And if any amongst you takes them as Auliyâ’, then surely he is one of them. Verily, Allâh guides not those people who are the Zâlimûn (polytheists and wrong­doers and unjust).", "And you see those in whose hearts there is a disease (of hypocrisy), they hurry to their friendship, saying: ”We fear lest some misfortune of a disaster may befall us.” Perhaps Allâh may bring a victory or a decision according to His Will. Then they will become regretful for what they have been keeping as a secret in themselves.", "And those who believe will say: ”Are these the men (hypocrites) who swore their strongest oaths by Allâh that they were with you (Muslims)?” All that they did has been in vain (because of their hypocrisy), and they have become the losers.", "O you who believe! Whoever from among you turns back from his religion (Islâm), Allâh will bring a people whom He will love and they will love Him; humble towards the believers, stern towards the disbelievers, fighting in the Way of Allâh, and never afraid of the blame of the blamers. That is the Grace of Allâh which He bestows on whom He wills. And Allâh is All­Sufficient for His creatures’ needs, All­Knower.", "Verily, your Walî (Protector or Helper) is Allâh, His Messenger, and the believers, - those who perform As-Salât (Iqâmat-as-Salât), and give Zakât, and they bow down (submit themselves with obedience to Allâh in prayer).", "And whosoever takes Allâh, His Messenger, and those who have believed, as Protectors, then the party of Allâh will be the victorious.", "O you who believe! Take not for Auliyâ’ (protectors and helpers) those who take your religion for a mockery and fun from among those who received the Scripture (Jews and Christians) before you, nor from among the disbelievers; and fear Allâh if you indeed are true believers.", "And when you proclaim the call for As-Salât [call for the prayer (Adhân)], they take it (but) as a mockery and fun; that is because they are a people who understand not.", "Say: ”O people of the Scripture (Jews and Christians)! Do you criticize us for no other reason than that we believe in Allâh, and in (the revelation) which has been sent down to us and in that which has been sent down before (us), and that most of you are Fâsiqûn [rebellious and disobedient (to Allâh)]?”", "Say (O Muhammad SAW to the people of the Scripture): ”Shall I inform you of something worse than that, regarding the recompense from Allâh: those (Jews) who incurred the Curse of Allâh and His Wrath, those of whom (some) He transformed into monkeys and swines, those who worshipped Tâghût (false deities); such are worse in rank (on the Day of Resurrection in the Hell­fire), and far more astray from the Right Path (in the life of this world).”", "When they come to you, they say: ”We believe.” But in fact they enter with (an intention of) disbelief and they go out with the same. And Allâh knows all what they were hiding.", "And you see many of them (Jews) hurrying for sin and transgression, and eating illegal things [as bribes and Ribâ (usury), etc.]. Evil indeed is that which they have been doing.", "Why do not the rabbis and the religious learned men forbid them from uttering sinful words and from eating illegal things. Evil indeed is that which they have been performing.", "The Jews say: ”Allâh’s Hand is tied up (i.e. He does not give and spend of His Bounty).” Be their hands tied up and be they accursed for what they uttered. Nay, both His Hands are widely outstretched. He spends (of His Bounty) as He wills. Verily, the Revelation that has come to you from Allâh increases in most of them their obstinate rebellion and disbelief. We have put enmity and hatred amongst them till the Day of Resurrection. Every time they kindled the fire of war, Allâh extinguished it; and they (ever) strive to make mischief on earth. And Allâh does not like the Mufsidûn (mischief­makers).", "And if only the people of the Scripture (Jews and Christians) had believed (in Muhammad SAW) and warded off evil (sin, ascribing partners to Allâh) and had become Al­Muttaqûn (the pious - see V.2:2) We would indeed have blotted out their sins and admitted them to Gardens of pleasure (in Paradise).", "And if only they had acted according to the Taurât (Torah), the Injeel (Gospel), and what has (now) been sent down to them from their Lord (the Qur’ân), they would surely have gotten provision from above them and from underneath their feet. There are from among them people who are on the right course (i.e. they act on the revelation and believe in Prophet Muhammad SAW like ’Abdullâh bin Salâm ÑÖì ), but many of them do evil deeds.", "O Messenger (Muhammad SAW)! Proclaim (the Message) which has been sent down to you from your Lord. And if you do not, then you have not conveyed His Message. Allâh will protect you from mankind. Verily, Allâh guides not the people who disbelieve.", "Say (O Muhammad SAW) ”O people of the Scripture (Jews and Christians)! You have nothing (as regards guidance) till you act according to the Taurât (Torah), the Injeel (Gospel), and what has (now) been sent down to you from your Lord (the Qur’ân).” Verily, that which has been sent down to you (Muhammad SAW) from your Lord increases in many of them their obstinate rebellion and disbelief. So be not sorrowful over the people who disbelieve.", "Surely, those who believe (in the Oneness of Allâh, in His Messenger Muhammad SAW and all that was revealed to him from Allâh), those who are the Jews and the Sabians and the Christians, - whosoever believed in Allâh and the Last Day, and worked righteousness, on them shall be no fear, nor shall they grieve.", "Verily, We took the covenant of the Children of Israel and sent them Messengers. Whenever there came to them a Messenger with what they themselves desired not - a group of them they called liars, and others among them they killed.", "They thought there will be no Fitnah (trial or punishment), so they became blind and deaf; after that Allâh turned to them (with Forgiveness); yet again many of them became blind and deaf. And Allâh is the All­Seer of what they do.", "Surely, they have disbelieved who say: ”Allâh is the Messiah [’Iesa (Jesus)], son of Maryam (Mary).” But the Messiah [’Iesa (Jesus)] said: ”O Children of Israel! Worship Allâh, my Lord and your Lord.” Verily, whosoever sets up partners in worship with Allâh, then Allâh has forbidden Paradise for him, and the Fire will be his abode. And for the Zâlimûn (polytheists and wrong­doers) there are no helpers.", "Surely, disbelievers are those who said: ”Allâh is the third of the three (in a Trinity).” But there is no ilâh (god) (none who has the right to be worshipped) but One Ilâh (God -Allâh). And if they cease not from what they say, verily, a painful torment will befall the disbelievers among them.", "Will they not repent to Allâh and ask His Forgiveness? For Allâh is Oft­Forgiving, Most Merciful.", "The Messiah [’Iesa (Jesus)], son of Maryam (Mary), was no more than a Messenger; many were the Messengers that passed away before him. His mother [Maryam (Mary)] was a Siddiqah [i.e. she believed in the words of Allâh and His Books (see Verse 66:12)]. They both used to eat food (as any other human being, while Allâh does not eat). Look how We make the Ayât (proofs, evidences, verses, lessons, signs, revelations, etc.) clear to them, yet look how they are deluded away (from the truth).", "Say (O Muhammad SAW to mankind): ”How do you worship besides Allâh something which has no power either to harm or to benefit you? But it is Allâh Who is the All­Hearer, All­Knower.”", "Say (O Muhammad SAW): ”O people of the Scripture (Jews and Christians)! Exceed not the limits in your religion (by believing in something) other than the truth, and do not follow the vain desires of people who went astray in times gone by, and who misled many, and strayed (themselves) from the Right Path.”", "Those among the Children of Israel who disbelieved were cursed by the tongue of Dawûd (David) and ’Iesa (Jesus), son of Maryam (Mary). That was because they disobeyed (Allâh and the Messengers) and were ever transgressing beyond bounds.", "They used not to forbid one another from the Munkar (wrong, evil­doing, sins, polytheism, disbelief, etc.) which they committed. Vile indeed was what they used to do.", "You see many of them taking the disbelievers as their Auliyâ’ (protectors and helpers). Evil indeed is that which their ownselves have sent forward before them, for that (reason) Allâh’s Wrath fell upon them and in torment they will abide.", "And had they believed in Allâh, and in the Prophet (Muhammad SAW) and in what has been revealed to him, never would they have taken them (the disbelievers) as Auliyâ’ (protectors and helpers), but many of them are the Fâsiqûn (rebellious, disobedient to Allâh).", "Verily, you will find the strongest among men in enmity to the believers (Muslims) the Jews and those who are Al-Mushrikûn (see V.2:105), and you will find the nearest in love to the believers (Muslims) those who say: ”We are Christians.” That is because amongst them are priests and monks, and they are not proud.", "And when they (who call themselves Christians) listen to what has been sent down to the Messenger (Muhammad SAW), you see their eyes overflowing with tears because of the truth they have recognised. They say: ”Our Lord! We believe; so write us down among the witnesses.", "”And why should we not believe in Allâh and in that which has come to us of the truth (Islâmic Monotheism)? And we wish that our Lord will admit us (in Paradise on the Day of Resurrection) along with the righteous people (Prophet Muhammad SAW and his Companions ÑÖì ã).”", "So because of what they said, Allâh rewarded them Gardens under which rivers flow (in Paradise), they will abide therein forever. Such is the reward of good­doers.", "But those who disbelieved and belied Our Ayât (proofs, evidences, verses, lessons, signs, revelations, etc.), they shall be the dwellers of the (Hell) Fire.", "O you who believe! Make not unlawful the Taiyibât (all that is good as regards foods, things, deeds, beliefs, persons, etc.) which Allâh has made lawful to you, and transgress not. Verily, Allâh does not like the transgressors.", "And eat of the things which Allâh has provided for you, lawful and good, and fear Allâh in Whom you believe.", "Allâh will not punish you for what is uninentional in your oaths, but He will punish you for your deliberate oaths; for its expiation (a deliberate oath) feed ten Masâkin (poor persons), on a scale of the average of that with which you feed your own families; or clothe them; or manumit a slave. But whosoever cannot afford (that), then he should fast for three days. That is the expiation for the oaths when you have sworn. And protect your oaths (i.e. do not swear much). Thus Allâh make clear to you His Ayât (proofs, evidences, verses, lessons, signs, revelations, etc.) that you may be grateful.", "O you who believe! Intoxicants (all kinds of alcoholic drinks), gambling, Al­Ansâb, and Al­Azlâm (arrows for seeking luck or decision) are an abomination of Shaitân’s (Satan) handiwork. So avoid (strictly all) that (abomination) in order that you may be successful.", "Shaitân (Satan) wants only to excite enmity and hatred between you with intoxicants (alcoholic drinks) and gambling, and hinder you from the remembrance of Allâh and from As-Salât (the prayer). So, will you not then abstain?", "And obey Allâh and the Messenger (Muhammad SAW), and beware (of even coming near to drinking or gambling or Al­Ansâb, or Al­Azlâm, etc.) and fear Allâh. Then if you turn away, you should know that it is Our Messenger’s duty to convey (the Message) in the clearest way.", "Those who believe and do righteous good deeds, there is no sin on them for what they ate (in the past), if they fear Allâh (by keeping away from His forbidden things), and believe and do righteous good deeds, and again fear Allâh and believe, and once again fear Allâh and do good deeds with Ihsân (perfection). And Allâh loves the good­doers.", "O you who believe! Allâh will certainly make a trial of you with something in (the matter of) the game that is well within reach of your hands and your lances, that Allâh may test who fears Him unseen. Then whoever transgresses thereafter, for him there is a painful torment.", "O you who believe! Kill not game while you are in a state of Ihrâm for Hajj or ’Umrah (pilgrimage), and whosoever of you kills it intentionally, the penalty is an offering, brought to the Ka’bah, of an eatable animal (i.e. sheep, goat, cow, etc.) equivalent to the one he killed, as adjudged by two just men among you; or, for expiation, he should feed Masâkin (poor persons), or its equivalent in Saum (fasting), that he may taste the heaviness (punishment) of his deed. Allâh has forgiven what is past, but whosoever commits it again, Allâh will take retribution from him. And Allâh is All­Mighty, All-Able of Retribution.", "Lawful to you is (the pursuit of) water­game and its use for food - for the benefit of yourselves and those who travel, but forbidden is (the pursuit of) land­game as long as you are in a state of Ihrâm (for Hajj or ’Umrah). And fear Allâh to Whom you shall be gathered back.", "Allâh has made the Ka’bah, the Sacred House, an asylum of security and Hajj and ’Umrah (pilgrimage) for mankind, and also the Sacred Month and the animals of offerings and the garlanded (people or animals, etc. marked with the garlands on their necks made from the outer part of the stem of the Makkah trees for their security), that you may know that Allâh has knowledge of all that is in the heavens and all that is in the earth, and that Allâh is the All­Knower of each and everything.", "Know that Allâh is Severe in punishment and that Allâh is Oft­Forgiving, Most Merciful.", "The Messenger’s duty [i.e. Our Messenger Muhammad SAW whom We have sent to you, (O mankind)] is but to convey (the Message). And Allâh knows all that you reveal and all that you conceal.", "Say (O Muhammad SAW): ”Not equal are Al­Khabîth (all that is evil and bad as regards things, deeds, beliefs, persons, foods, etc.) and At­Taiyib (all that is good as regards things, deeds, beliefs, persons, foods, etc.), even though the abundance of Al-Khabîth (evil) may please you.” So fear Allâh much [(abstain from all kinds of sins and evil deeds which He has forbidden) and love Allâh much (perform all kinds of good deeds which He has ordained)], O men of understanding in order that you may be successful.", "O you who believe! Ask not about things which, if made plain to you, may cause you trouble. But if you ask about them while the Qur’ân is being revealed, they will be made plain to you. Allâh has forgiven that, and Allâh is Oft­Forgiving, Most Forbearing.", "Before you, a community asked such questions, then on that account they became disbelievers.", "Allâh has not instituted things like Bahîrah (a she­camel whose milk was spared for the idols and nobody was allowed to milk it) or a Sâ’ibah (a she­camel let loose for free pasture for their false gods, e.g. idols, etc., and nothing was allowed to be carried on it), or a Wasîlah (a she­camel set free for idols because it has given birth to a she­camel at its first delivery and then again gives birth to a she­camel at its second delivery) or a Hâm (a stallion­camel freed from work for their idols, after it had finished a number of copulations assigned for it, all these animals were liberated in honour of idols as practised by pagan Arabs in the pre­Islâmic period). But those who disbelieve invent lies against Allâh, and most of them have no understanding.", "And when it is said to them: ”Come to what Allâh has revealed and unto the Messenger (Muhammad SAW for the verdict of that which you have made unlawful).” They say: ”Enough for us is that which we found our fathers following,” even though their fathers had no knowledge whatsoever and no guidance.", "O you who believe! Take care of your ownselves, [do righteous deeds, fear Allâh much (abstain from all kinds of sins and evil deeds which He has forbidden) and love Allâh much (perform all kinds of good deeds which He has ordained)]. If you follow the right guidance and enjoin what is right (Islâmic Monotheism and all that Islâm orders one to do) and forbid what is wrong (polytheism, disbelief and all that Islâm has forbidden) no hurt can come to you from those who are in error. The return of you all is to Allâh, then He will inform you about (all) that which you used to do.", "O you who believe! When death approaches any of you, and you make a bequest, then take the testimony of two just men of your own folk or two others from outside, if you are travelling through the land and the calamity of death befalls you. Detain them both after As-Salât (the prayer), (then) if you are in doubt (about their truthfulness), let them both swear by Allâh (saying): ”We wish not for any worldly gain in this, even though he (the beneficiary) be our near relative. We shall not hide Testimony of Allâh, for then indeed we should be of the sinful.”", "If then it gets known that these two had been guilty of sin, let two others stand forth in their places, nearest in kin from among those who claim a lawful right. Let them swear by Allâh (saying): ”We affirm that our testimony is truer than that of both of them, and that we have not trespassed (the truth), for then indeed we should be of the wrong­doers.”", "That should make it closer (to the fact) that their testimony would be in its true nature and shape (and thus accepted), or else they would fear that (other) oaths would be admitted after their oaths. And fear Allâh and listen ( with obedience to Him). And Allâh guides not the people who are Al-Fâsiqûn (the rebellious and disobedient).", "On the Day when Allâh will gather the Messengers together and say to them: ”What was the response you received (from men to your teaching)? They will say: ”We have no knowledge, verily, only You are the All­Knower of all that is hidden (or unseen, etc.).”", "(Remember) when Allâh will say (on the Day of Resurrection). ”O ’Iesa (Jesus), son of Maryam (Mary)! Remember My Favour to you and to your mother when I supported you with Rûh­ul­Qudus [Jibrael (Gabriel)] so that you spoke to the people in the cradle and in maturity; and when I taught you writing, Al­Hikmah (the power of understanding), the Taurât (Torah) and the Injeel (Gospel); and when you made out of the clay, as it were, the figure of a bird, by My Permission, and you breathed into it, and it became a bird by My Permission, and you healed those born blind, and the lepers by My Permission, and when you brought forth the dead by My Permission; and when I restrained the Children of Israel from you (when they resolved to kill you) since you came unto them with clear proofs, and the disbelievers among them said: ’This is nothing but evident magic.’ ”", "And when I (Allâh) put in the hearts of Al-Hawârîeen (the disciples) [of ’Iesa (Jesus)] to believe in Me and My Messenger, they said: ”We believe. And bear witness that we are Muslims.”", "(Remember) when Al-Hawârîûn (the disciples) said: ”O ’Iesa (Jesus), son of Maryam (Mary)! Can your Lord send down to us a table spread (with food) from heaven?” ’Iesa (Jesus) said: ”Fear Allâh, if you are indeed believers.”", "They said: ”We wish to eat thereof and to be stronger in Faith, and to know that you have indeed told us the truth and that we ourselves be its witnesses.”", "’Iesa (Jesus), son of Maryam (Mary), said: ”O Allâh, our Lord! Send us from heaven a table spread (with food) that there may be for us - for the first and the last of us - a festival and a sign from You; and provide us sustenance, for You are the Best of sustainers.”", "Allâh said: ”I am going to send it down unto you, but if any of you after that disbelieves, then I will punish him with a torment such as I have not inflicted on anyone among (all) the ’Alamîn (mankind and jinns).”", "And (remember) when Allâh will say (on the Day of Resurrection): ”O ’Iesa (Jesus), son of Maryam (Mary)! Did you say unto men: ’Worship me and my mother as two gods besides Allâh?’ ” He will say: ”Glory be to You! It was not for me to say what I had no right (to say). Had I said such a thing, You would surely have known it. You know what is in my inner­self though I do not know what is in Yours, truly, You, only You, are the All­Knower of all that is hidden and unseen.", "”Never did I say to them aught except what You (Allâh) did command me to say: ’Worship Allâh, my Lord and your Lord.’ And I was a witness over them while I dwelt amongst them, but when You took me up, You were the Watcher over them, and You are a Witness to all things. (This is a great admonition and warning to the Christians of the whole world).", "”If You punish them, they are Your slaves, and if You forgive them, verily You, only You are the All­Mighty, the All­Wise.”", "Allâh will say: ”This is a Day on which the truthful will profit from their truth: theirs are Gardens under which rivers flow (in Paradise) - they shall abide therein forever. Allâh is pleased with them and they with Him. That is the great success (Paradise).", "To Allâh belongs the dominion of the heavens and the earth and all that is therein, and He is Able to do all things."]}