{"name_ar": "سورة الذاريات", "ayahs_ar": ["وَالذَّارِيَاتِ ذَرْوًا", "فَالْحَامِلَاتِ وِقْرًا", "فَالْجَارِيَاتِ يُسْرًا", "فَالْمُقَسِّمَاتِ أَمْرًا", "إِنَّمَا تُوعَدُونَ لَصَادِقٌ", "وَإِنَّ الدِّينَ لَوَاقِعٌ", "وَالسَّمَاء ذَاتِ الْحُبُكِ", "إِنَّكُمْ لَفِي قَوْلٍ مُّخْتَلِفٍ", "يُؤْفَكُ عَنْهُ مَنْ أُفِكَ", "قُتِلَ الْخَرَّاصُونَ", "الَّذِينَ هُمْ فِي غَمْرَةٍ سَاهُونَ", "يَسْأَلُونَ أَيَّانَ يَوْمُ الدِّينِ", "يَوْمَ هُمْ عَلَى النَّارِ يُفْتَنُونَ", "ذُوقُوا فِتْنَتَكُمْ هَذَا الَّذِي كُنتُم بِهِ تَسْتَعْجِلُونَ", "إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَعُيُونٍ", "آخِذِينَ مَا آتَاهُمْ رَبُّهُمْ إِنَّهُمْ كَانُوا قَبْلَ ذَلِكَ مُحْسِنِينَ", "كَانُوا قَلِيلًا مِّنَ اللَّيْلِ مَا يَهْجَعُونَ", "وَبِالْأَسْحَارِ هُمْ يَسْتَغْفِرُونَ", "وَفِي أَمْوَالِهِمْ حَقٌّ لِّلسَّائِلِ وَالْمَحْرُومِ", "وَفِي الْأَرْضِ آيَاتٌ لِّلْمُوقِنِينَ", "وَفِي أَنفُسِكُمْ أَفَلَا تُبْصِرُونَ", "وَفِي السَّمَاء رِزْقُكُمْ وَمَا تُوعَدُونَ", "فَوَرَبِّ السَّمَاء وَالْأَرْضِ إِنَّهُ لَحَقٌّ مِّثْلَ مَا أَنَّكُمْ تَنطِقُونَ", "هَلْ أَتَاكَ حَدِيثُ ضَيْفِ إِبْرَاهِيمَ الْمُكْرَمِينَ", "إِذْ دَخَلُوا عَلَيْهِ فَقَالُوا سَلَامًا قَالَ سَلَامٌ قَوْمٌ مُّنكَرُونَ", "فَرَاغَ إِلَى أَهْلِهِ فَجَاء بِعِجْلٍ سَمِينٍ", "فَقَرَّبَهُ إِلَيْهِمْ قَالَ أَلَا تَأْكُلُونَ", "فَأَوْجَسَ مِنْهُمْ خِيفَةً قَالُوا لَا تَخَفْ وَبَشَّرُوهُ بِغُلَامٍ عَلِيمٍ", "فَأَقْبَلَتِ امْرَأَتُهُ فِي صَرَّةٍ فَصَكَّتْ وَجْهَهَا وَقَالَتْ عَجُوزٌ عَقِيمٌ", "قَالُوا كَذَلِكَ قَالَ رَبُّكِ إِنَّهُ هُوَ الْحَكِيمُ الْعَلِيمُ", "قَالَ فَمَا خَطْبُكُمْ أَيُّهَا الْمُرْسَلُونَ", "قَالُوا إِنَّا أُرْسِلْنَا إِلَى قَوْمٍ مُّجْرِمِينَ", "لِنُرْسِلَ عَلَيْهِمْ حِجَارَةً مِّن طِينٍ", "مُسَوَّمَةً عِندَ رَبِّكَ لِلْمُسْرِفِينَ", "فَأَخْرَجْنَا مَن كَانَ فِيهَا مِنَ الْمُؤْمِنِينَ", "فَمَا وَجَدْنَا فِيهَا غَيْرَ بَيْتٍ مِّنَ الْمُسْلِمِينَ", "وَتَرَكْنَا فِيهَا آيَةً لِّلَّذِينَ يَخَافُونَ الْعَذَابَ الْأَلِيمَ", "وَفِي مُوسَى إِذْ أَرْسَلْنَاهُ إِلَى فِرْعَوْنَ بِسُلْطَانٍ مُّبِينٍ", "فَتَوَلَّى بِرُكْنِهِ وَقَالَ سَاحِرٌ أَوْ مَجْنُونٌ", "فَأَخَذْنَاهُ وَجُنُودَهُ فَنَبَذْنَاهُمْ فِي الْيَمِّ وَهُوَ مُلِيمٌ", "وَفِي عَادٍ إِذْ أَرْسَلْنَا عَلَيْهِمُ الرِّيحَ الْعَقِيمَ", "مَا تَذَرُ مِن شَيْءٍ أَتَتْ عَلَيْهِ إِلَّا جَعَلَتْهُ كَالرَّمِيمِ", "وَفِي ثَمُودَ إِذْ قِيلَ لَهُمْ تَمَتَّعُوا حَتَّى حِينٍ", "فَعَتَوْا عَنْ أَمْرِ رَبِّهِمْ فَأَخَذَتْهُمُ الصَّاعِقَةُ وَهُمْ يَنظُرُونَ", "فَمَا اسْتَطَاعُوا مِن قِيَامٍ وَمَا كَانُوا مُنتَصِرِينَ", "وَقَوْمَ نُوحٍ مِّن قَبْلُ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ", "وَالسَّمَاء بَنَيْنَاهَا بِأَيْدٍ وَإِنَّا لَمُوسِعُونَ", "وَالْأَرْضَ فَرَشْنَاهَا فَنِعْمَ الْمَاهِدُونَ", "وَمِن كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ لَعَلَّكُمْ تَذَكَّرُونَ", "فَفِرُّوا إِلَى اللَّهِ إِنِّي لَكُم مِّنْهُ نَذِيرٌ مُّبِينٌ", "وَلَا تَجْعَلُوا مَعَ اللَّهِ إِلَهًا آخَرَ إِنِّي لَكُم مِّنْهُ نَذِيرٌ مُّبِينٌ", "كَذَلِكَ مَا أَتَى الَّذِينَ مِن قَبْلِهِم مِّن رَّسُولٍ إِلَّا قَالُوا سَاحِرٌ أَوْ مَجْنُونٌ", "أَتَوَاصَوْا بِهِ بَلْ هُمْ قَوْمٌ طَاغُونَ", "فَتَوَلَّ عَنْهُمْ فَمَا أَنتَ بِمَلُومٍ", "وَذَكِّرْ فَإِنَّ الذِّكْرَى تَنفَعُ الْمُؤْمِنِينَ", "وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ", "مَا أُرِيدُ مِنْهُم مِّن رِّزْقٍ وَمَا أُرِيدُ أَن يُطْعِمُونِ", "إِنَّ اللَّهَ هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِينُ", "فَإِنَّ لِلَّذِينَ ظَلَمُوا ذَنُوبًا مِّثْلَ ذَنُوبِ أَصْحَابِهِمْ فَلَا يَسْتَعْجِلُونِ", "فَوَيْلٌ لِّلَّذِينَ كَفَرُوا مِن يَوْمِهِمُ الَّذِي يُوعَدُونَ"], "name_en": "Adh-Dhariyat", "ayahs_en": ["By (the winds) that scatter dust.", "And (the clouds) that bear heavy weight of water;", "And (the ships) that float with ease and gentleness;", "And those (angels) who distribute (provisions, rain, and other blessings) by (Allâh’s) Command;­", "Verily, that which you are promised (i.e. Resurrection in the Hereafter and receiving the reward or punishment of good or bad deeds, etc.) is surely true.", "And verily, the Recompense is sure to happen.", "By the heaven full of paths,", "Certainly, you have different ideas (about Muhammad SAW and the Qur’ân).", "Turned aside therefrom (i.e. from Muhammad SAW and the Qur’ân) is he who is turned aside (by the Decree and Preordainment ÇáÞÖÇ æÇáÞÏÑ of Allâh).", "Cursed be the liars,", "Who are under a cover of heedlessness (think not about the gravity of the Hereafter),", "They ask; ”When will be the Day of Recompense?”", "(It will be) a Day when they will be tried (i.e. burnt) over the Fire!", "”Taste you your trial (burning)! This is what you used to ask to be hastened!”", "Verily, the Muttaqûn (pious - see V.2:2) will be in the midst of Gardens and Springs (in the Paradise),", "Taking joy in the things which their Lord has given them. Verily, they were before this Muhsinûn (good-doers - see V.2:112).", "They used to sleep but little by night [invoking their Lord (Allâh) and praying, with fear and hope].", "And in the hours before dawn, they were (found) asking (Allâh) for forgiveness,", "And in their properties there was the right of the beggar, and the Mahrûm (the poor who does not ask the others) ,", "And on the earth are signs for those who have Faith with certainty,", "And also in your ownselves. Will you not then see?", "And in the heaven is your provision, and that which you are promised.", "Then, by the Lord of the heaven and the earth, it is the truth (i.e. what has been promised to you), just as it is the truth that you can speak.", "Has the story reached you, of the honoured guests [three angels; Jibrael (Gabriel) along with another two] of Ibrahîm (Abraham)?", "When they came in to him, and said, ”Salâm, (peace be upon you)!” He answered; ”Salâm, (peace be upon you ),” and said: ”You are a people unknown to me,”", "Then he turned to his household, so brought out a roasted calf [as the property of Ibrahîm (Abraham) was mainly cows].", "And placed it before them, (saying): ”Will you not eat?”", "Then he conceived a fear of them (when they ate not). They said: ”Fear not.” And they gave him glad tidings of an intelligent son, having knowledge (about Allâh and His religion of True Monotheism).", "Then his wife came forward with a loud voice, she smote her face, and said: ”A barren old woman!”", "They said: ”Even so says your Lord. Verily, He is the All-Wise, the All-Knower.”", "[Ibrâhim (Abraham)] said: ”Then for what purpose you have come, O Messengers?”", "They said: ”We have been sent to a people who are Mujrimûn (polytheists, sinners, criminals, disbelievers in Allâh);", "To send down upon them stones of baked clay.", "Marked by your Lord for the Musrifûn (polytheists, criminals, sinners those who trespass Allâh’s set limits in evil-doings by committing great sins).", "So We brought out from therein the believers.", "But We found not there any household of the Muslims except one [i.e. Lout (Lot) and his two daughters].", "And We have left there a sign (i.e. the place of the Dead Sea , well-known in Palestine) for those who fear the painful torment.", "And in Mûsa (Moses) (too, there is a sign). When We sent him to Fir’aun (Pharaoh) with a manifest authority.", "But [Fir’aun (Pharaoh)] turned away (from Belief in might) along with his hosts, and said: ”A sorcerer, or a madman.”", "So We took him and his hosts, and dumped them into the sea, while he was to be blamed.", "And in ’Ad (there is also a sign) when We sent against them the barren wind;", "It spared nothing that it reached, but blew it into broken spreads of rotten ruins.", "And in Thamûd (there is also a sign), when they were told: ”Enjoy yourselves for a while!”", "But they insolently defied the Command of their Lord, so the Sâ’iqah overtook them while they were looking.", "Then they were unable to rise up, nor could they help themselves.", "(So were) the people of Nûh (Noah) before them. Verily, they were a people who were Fâsiqûn (rebellious, disobedient to Allâh).", "With power did We construct the heaven. Verily, We are Able to extend the vastness of space thereof.", "And We have spread out the earth, how Excellent Spreader (thereof) are We!", "And of everything We have created pairs, that you may remember (the Grace of Allâh).", "So flee to Allâh (from His Torment to His Mercy Islâmic Monotheism), verily, I (Muhammad SAW) am a plain warner to you from Him.", "And set not up (or worship) any other ilâhan (god) along with Allâh [Glorified be He (Alone), Exalted above all that they associate as partners with Him]. Verily, I (Muhammad SAW) am a plain warner to you from Him.", "Likewise, no Messenger came to those before them, but they said: ”A sorcerer or a madman!”", "Have they (the people of the past) transmitted this saying to these (Quraish pagans)? Nay, they are themselves a people transgressing beyond bounds (in disbelief)!", "So turn away (O Muhammad SAW) from them (Quraish pagans) you are not to be blamed (as you have conveyed Allâh’s Message).", "And remind (by preaching the Qur’ân, O Muhammad SAW) for verily, the reminding profits the believers.", "And I (Allâh) created not the jinns and humans except they should worship Me (Alone).", "I seek not any provision from them (i.e. provision for themselves or for My creatures) nor do I ask that they should feed Me (i.e. feed themselves or My creatures).", "Verily, Allâh is the All-Provider, Owner of Power, the Most Strong.", "And verily, for those who do wrong, there is a portion of torment like to the evil portion of torment (which came for) their likes (of old), so let them not ask Me to hasten on!", "Then, woe to those who disbelieve (in Allâh and His Oneness Islâmic Monotheism) from (that) their Day which they have been promised (for their punishment)."]}