{"name_ar": "سورة الطور", "ayahs_ar": ["وَالطُّورِ", "وَكِتَابٍ مَّسْطُورٍ", "فِي رَقٍّ مَّنشُورٍ", "وَالْبَيْتِ الْمَعْمُورِ", "وَالسَّقْفِ الْمَرْفُوعِ", "وَالْبَحْرِ الْمَسْجُورِ", "إِنَّ عَذَابَ رَبِّكَ لَوَاقِعٌ", "مَا لَهُ مِن دَافِعٍ", "يَوْمَ تَمُورُ السَّمَاء مَوْرًا", "وَتَسِيرُ الْجِبَالُ سَيْرًا", "فَوَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ", "الَّذِينَ هُمْ فِي خَوْضٍ يَلْعَبُونَ", "يَوْمَ يُدَعُّونَ إِلَى نَارِ جَهَنَّمَ دَعًّا", "هَذِهِ النَّارُ الَّتِي كُنتُم بِهَا تُكَذِّبُونَ", "أَفَسِحْرٌ هَذَا أَمْ أَنتُمْ لَا تُبْصِرُونَ", "اصْلَوْهَا فَاصْبِرُوا أَوْ لَا تَصْبِرُوا سَوَاء عَلَيْكُمْ إِنَّمَا تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ", "إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَنَعِيمٍ", "فَاكِهِينَ بِمَا آتَاهُمْ رَبُّهُمْ وَوَقَاهُمْ رَبُّهُمْ عَذَابَ الْجَحِيمِ", "كُلُوا وَاشْرَبُوا هَنِيئًا بِمَا كُنتُمْ تَعْمَلُونَ", "مُتَّكِئِينَ عَلَى سُرُرٍ مَّصْفُوفَةٍ وَزَوَّجْنَاهُم بِحُورٍ عِينٍ", "وَالَّذِينَ آمَنُوا وَاتَّبَعَتْهُمْ ذُرِّيَّتُهُم بِإِيمَانٍ أَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ وَمَا أَلَتْنَاهُم مِّنْ عَمَلِهِم مِّن شَيْءٍ كُلُّ امْرِئٍ بِمَا كَسَبَ رَهِينٌ", "وَأَمْدَدْنَاهُم بِفَاكِهَةٍ وَلَحْمٍ مِّمَّا يَشْتَهُونَ", "يَتَنَازَعُونَ فِيهَا كَأْسًا لَّا لَغْوٌ فِيهَا وَلَا تَأْثِيمٌ", "وَيَطُوفُ عَلَيْهِمْ غِلْمَانٌ لَّهُمْ كَأَنَّهُمْ لُؤْلُؤٌ مَّكْنُونٌ", "وَأَقْبَلَ بَعْضُهُمْ عَلَى بَعْضٍ يَتَسَاءلُونَ", "قَالُوا إِنَّا كُنَّا قَبْلُ فِي أَهْلِنَا مُشْفِقِينَ", "فَمَنَّ اللَّهُ عَلَيْنَا وَوَقَانَا عَذَابَ السَّمُومِ", "إِنَّا كُنَّا مِن قَبْلُ نَدْعُوهُ إِنَّهُ هُوَ الْبَرُّ الرَّحِيمُ", "فَذَكِّرْ فَمَا أَنتَ بِنِعْمَتِ رَبِّكَ بِكَاهِنٍ وَلَا مَجْنُونٍ", "أَمْ يَقُولُونَ شَاعِرٌ نَّتَرَبَّصُ بِهِ رَيْبَ الْمَنُونِ", "قُلْ تَرَبَّصُوا فَإِنِّي مَعَكُم مِّنَ الْمُتَرَبِّصِينَ", "أَمْ تَأْمُرُهُمْ أَحْلَامُهُم بِهَذَا أَمْ هُمْ قَوْمٌ طَاغُونَ", "أَمْ يَقُولُونَ تَقَوَّلَهُ بَل لَّا يُؤْمِنُونَ", "فَلْيَأْتُوا بِحَدِيثٍ مِّثْلِهِ إِن كَانُوا صَادِقِينَ", "أَمْ خُلِقُوا مِنْ غَيْرِ شَيْءٍ أَمْ هُمُ الْخَالِقُونَ", "أَمْ خَلَقُوا السَّمَاوَاتِ وَالْأَرْضَ بَل لَّا يُوقِنُونَ", "أَمْ عِندَهُمْ خَزَائِنُ رَبِّكَ أَمْ هُمُ الْمُصَيْطِرُونَ", "أَمْ لَهُمْ سُلَّمٌ يَسْتَمِعُونَ فِيهِ فَلْيَأْتِ مُسْتَمِعُهُم بِسُلْطَانٍ مُّبِينٍ", "أَمْ لَهُ الْبَنَاتُ وَلَكُمُ الْبَنُونَ", "أَمْ تَسْأَلُهُمْ أَجْرًا فَهُم مِّن مَّغْرَمٍ مُّثْقَلُونَ", "أَمْ عِندَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُونَ", "أَمْ يُرِيدُونَ كَيْدًا فَالَّذِينَ كَفَرُوا هُمُ الْمَكِيدُونَ", "أَمْ لَهُمْ إِلَهٌ غَيْرُ اللَّهِ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ", "وَإِن يَرَوْا كِسْفًا مِّنَ السَّمَاء سَاقِطًا يَقُولُوا سَحَابٌ مَّرْكُومٌ", "فَذَرْهُمْ حَتَّى يُلَاقُوا يَوْمَهُمُ الَّذِي فِيهِ يُصْعَقُونَ", "يَوْمَ لَا يُغْنِي عَنْهُمْ كَيْدُهُمْ شَيْئًا وَلَا هُمْ يُنصَرُونَ", "وَإِنَّ لِلَّذِينَ ظَلَمُوا عَذَابًا دُونَ ذَلِكَ وَلَكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ", "وَاصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنَا وَسَبِّحْ بِحَمْدِ رَبِّكَ حِينَ تَقُومُ", "وَمِنَ اللَّيْلِ فَسَبِّحْهُ وَإِدْبَارَ النُّجُومِ"], "name_en": "At-Tur", "ayahs_en": ["By the Mount;", "And by the Book Inscribed.", "In parchment unrolled.", "And by the Bait-ul-Ma’mûr (the house over the heavens parable to the Ka’bah at Makkah, continuously visited by the angels);", "And by the roof raised high (i.e. the heaven).", "And by the sea kept filled (or it will be fire kindled on the Day of Resurrection).", "Verily, the Torment of your Lord will surely come to pass,", "There is none that can avert it;", "On the Day when the heaven will shake with a dreadful shaking,", "And the mountains will move away with a (horrible) movement.", "Then woe that Day to the beliers;", "Who are playing in falsehood .", "The Day when they will be pushed down by force to the Fire of Hell, with a horrible, forceful pushing.", "This is the Fire which you used to belie.", "Is this magic, or do you not see?", "Taste you therein its heat, and whether you are patient of it or impatient of it, it is all the same. You are only being requited for what you used to do.", "Verily, the Muttaqûn (pious - see V.2:2) will be in Gardens (Paradise), and Delight.", "Enjoying in that which their Lord has bestowed on them, and (the fact that) their Lord saved them from the torment of the blazing Fire.", "”Eat and drink with happiness because of what you used to do.”", "They will recline (with ease) on thrones arranged in ranks. And We shall marry them to Houris (female, fair ones) with wide lovely eyes.", "And those who believe and whose offspring follow them in Faith, to them shall We join their offspring, and We shall not decrease the reward of their deeds in anything. Every person is a pledge for that which he has earned.", "And We shall provide them with fruit and meat, such as they desire.", "There they shall pass from hand to hand a (wine) cup, free from any Laghw (dirty, false, evil vague talk between them), and free from sin (because it will be legal for them to drink).", "And there will go round boy-servants of theirs, to serve them as if they were preserved pearls.", "And some of them draw near to others, questioning.", "Saying: ”Aforetime, we were afraid with our families (from the punishment of Allâh).", "”But Allâh has been gracious to us, and has saved us from the torment of the Fire.", "”Verily, We used to invoke Him (Alone and none else) before. Verily, He is Al­Barr (the Most Subtle, Kind, Courteous, and Generous), the Most Merciful.”", "Therefore, remind and preach (mankind, O Muhammad SAW of Islâmic Monotheism). By the Grace of Allâh, you are neither a soothsayer, nor a madman.", "Or do they say: ”(Muhammad SAW is) a poet! We await for him some calamity by time.!”", "Say (O Muhammad SAW to them): ”Wait! I am with you, among the waiters!”", "Do their minds command them this [i.e. to tell a lie against you (Muhammad SAW)] or are they people exceeding the bounds (i.e. from Belief in Allâh to disbelief).", "Or do they say: ”He (Muhammad SAW) has forged it (this Qur’ân)?” Nay! They believe not!", "Let them then produce a recital like unto it (the Qur’ân) if they are truthful.", "Were they created by nothing, or were they themselves the creators?", "Or did they create the heavens and the earth? Nay, but they have no firm Belief.", "Or are with them the treasures of your Lord? Or are they the tyrants with the authority to do as they like?", "Or have they a stairway (to heaven), by means of which they listen (to the talks of the angels)? Then let their listener produce some manifest proof.", "Or has He (Allâh) only daughters and you have sons?", "Or is it that you (O Muhammad SAW) ask a wage from them (for your preaching of Islâmic Monotheism) so that they are burdened with a load of debt?", "Or that the Ghaib (unseen) is with them, and they write it down?", "Or do they intend a plot (against you O Muhammad SAW)? But those who disbelieve (in the Oneness of Allâh Islâmic Monotheism) are themselves in a plot!", "Or have they an ilâh (a god) other than Allâh? Glorified be Allâh from all that they ascribe as partners (to Him)", "And if they were to see a piece of the heaven falling down, they would say: ”Clouds gathered in heaps!”", "So leave them alone till they meet their Day, in which they will sink into a fainting (with horror).", "The Day when their plotting shall not avail them at all nor will they be helped (i.e. they will receive their torment in Hell).", "And verily, for those who do wrong, there is another punishment (i.e. the torment in this world and in their graves) before this, but most of them know not. [Tafsir At-Tabarî, Vol. 27, Page 36].", "So wait patiently (O Muhammad SAW) for the Decision of your Lord, for verily, you are under Our Eyes , and glorify the Praises of your Lord when you get up from sleep.", "49. And in the night-time, also glorify His Praises, and at the setting of the stars."]}