{"name_ar": "سورة القمر", "ayahs_ar": ["اقْتَرَبَتِ السَّاعَةُ وَانشَقَّ الْقَمَرُ", "وَإِن يَرَوْا آيَةً يُعْرِضُوا وَيَقُولُوا سِحْرٌ مُّسْتَمِرٌّ", "وَكَذَّبُوا وَاتَّبَعُوا أَهْوَاءهُمْ وَكُلُّ أَمْرٍ مُّسْتَقِرٌّ", "وَلَقَدْ جَاءهُم مِّنَ الْأَنبَاء مَا فِيهِ مُزْدَجَرٌ", "حِكْمَةٌ بَالِغَةٌ فَمَا تُغْنِ النُّذُرُ", "فَتَوَلَّ عَنْهُمْ يَوْمَ يَدْعُ الدَّاعِ إِلَى شَيْءٍ نُّكُرٍ", "خُشَّعًا أَبْصَارُهُمْ يَخْرُجُونَ مِنَ الْأَجْدَاثِ كَأَنَّهُمْ جَرَادٌ مُّنتَشِرٌ", "مُّهْطِعِينَ إِلَى الدَّاعِ يَقُولُ الْكَافِرُونَ هَذَا يَوْمٌ عَسِرٌ", "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ فَكَذَّبُوا عَبْدَنَا وَقَالُوا مَجْنُونٌ وَازْدُجِرَ", "فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٌ فَانتَصِرْ", "فَفَتَحْنَا أَبْوَابَ السَّمَاء بِمَاء مُّنْهَمِرٍ", "وَفَجَّرْنَا الْأَرْضَ عُيُونًا فَالْتَقَى الْمَاء عَلَى أَمْرٍ قَدْ قُدِرَ", "وَحَمَلْنَاهُ عَلَى ذَاتِ أَلْوَاحٍ وَدُسُرٍ", "تَجْرِي بِأَعْيُنِنَا جَزَاء لِّمَن كَانَ كُفِرَ", "وَلَقَد تَّرَكْنَاهَا آيَةً فَهَلْ مِن مُّدَّكِرٍ", "فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ", "وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِن مُّدَّكِرٍ", "كَذَّبَتْ عَادٌ فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ", "إِنَّا أَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِي يَوْمِ نَحْسٍ مُّسْتَمِرٍّ", "تَنزِعُ النَّاسَ كَأَنَّهُمْ أَعْجَازُ نَخْلٍ مُّنقَعِرٍ", "فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ", "وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِن مُّدَّكِرٍ", "كَذَّبَتْ ثَمُودُ بِالنُّذُرِ", "فَقَالُوا أَبَشَرًا مِّنَّا وَاحِدًا نَّتَّبِعُهُ إِنَّا إِذًا لَّفِي ضَلَالٍ وَسُعُرٍ", "أَؤُلْقِيَ الذِّكْرُ عَلَيْهِ مِن بَيْنِنَا بَلْ هُوَ كَذَّابٌ أَشِرٌ", "سَيَعْلَمُونَ غَدًا مَّنِ الْكَذَّابُ الْأَشِرُ", "إِنَّا مُرْسِلُو النَّاقَةِ فِتْنَةً لَّهُمْ فَارْتَقِبْهُمْ وَاصْطَبِرْ", "وَنَبِّئْهُمْ أَنَّ الْمَاء قِسْمَةٌ بَيْنَهُمْ كُلُّ شِرْبٍ مُّحْتَضَرٌ", "فَنَادَوْا صَاحِبَهُمْ فَتَعَاطَى فَعَقَرَ", "فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ", "إِنَّا أَرْسَلْنَا عَلَيْهِمْ صَيْحَةً وَاحِدَةً فَكَانُوا كَهَشِيمِ الْمُحْتَظِرِ", "وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِن مُّدَّكِرٍ", "كَذَّبَتْ قَوْمُ لُوطٍ بِالنُّذُرِ", "إِنَّا أَرْسَلْنَا عَلَيْهِمْ حَاصِبًا إِلَّا آلَ لُوطٍ نَّجَّيْنَاهُم بِسَحَرٍ", "نِعْمَةً مِّنْ عِندِنَا كَذَلِكَ نَجْزِي مَن شَكَرَ", "وَلَقَدْ أَنذَرَهُم بَطْشَتَنَا فَتَمَارَوْا بِالنُّذُرِ", "وَلَقَدْ رَاوَدُوهُ عَن ضَيْفِهِ فَطَمَسْنَا أَعْيُنَهُمْ فَذُوقُوا عَذَابِي وَنُذُرِ", "وَلَقَدْ صَبَّحَهُم بُكْرَةً عَذَابٌ مُّسْتَقِرٌّ", "فَذُوقُوا عَذَابِي وَنُذُرِ", "وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِن مُّدَّكِرٍ", "وَلَقَدْ جَاء آلَ فِرْعَوْنَ النُّذُرُ", "كَذَّبُوا بِآيَاتِنَا كُلِّهَا فَأَخَذْنَاهُمْ أَخْذَ عَزِيزٍ مُّقْتَدِرٍ", "أَكُفَّارُكُمْ خَيْرٌ مِّنْ أُوْلَئِكُمْ أَمْ لَكُم بَرَاءةٌ فِي الزُّبُرِ", "أَمْ يَقُولُونَ نَحْنُ جَمِيعٌ مُّنتَصِرٌ", "سَيُهْزَمُ الْجَمْعُ وَيُوَلُّونَ الدُّبُرَ", "بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ أَدْهَى وَأَمَرُّ", "إِنَّ الْمُجْرِمِينَ فِي ضَلَالٍ وَسُعُرٍ", "يَوْمَ يُسْحَبُونَ فِي النَّارِ عَلَى وُجُوهِهِمْ ذُوقُوا مَسَّ سَقَرَ", "إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ", "وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ كَلَمْحٍ بِالْبَصَرِ", "وَلَقَدْ أَهْلَكْنَا أَشْيَاعَكُمْ فَهَلْ مِن مُّدَّكِرٍ", "وَكُلُّ شَيْءٍ فَعَلُوهُ فِي الزُّبُرِ", "وَكُلُّ صَغِيرٍ وَكَبِيرٍ مُسْتَطَرٌ", "إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَنَهَرٍ", "فِي مَقْعَدِ صِدْقٍ عِندَ مَلِيكٍ مُّقْتَدِرٍ"], "name_en": "Al-Qamar", "ayahs_en": ["The Hour has drawn near, and the moon has been cleft asunder (the people of Makkah requested Prophet Muhammad SAW to show them a miracle, so he showed them the splitting of the moon).", "And if they see a sign, they turn away, and say: ”This is continuous magic.”", "They belied (the Verses of Allâh, this Qur’ân), and followed their own lusts. And every matter will be settled [according to the kind of deeds (for the doer of good deeds, his deeds will take him to Paradise, and similarly evil deeds will take their doers to Hell)].", "And indeed there has come to them news (in this Qur’ân) wherein there is (enough warning) to check (them from evil),", "Perfect wisdom (this Qur’ân), but (the preaching of) warners benefit them not,", "So (O Muhammad SAW) withdraw from them. The Day that the caller will call (them) to a terrible thing.", "They will come forth, with humbled eyes from (their) graves as if they were locusts spread abroad,", "Hastening towards the caller, the disbelievers will say: ”This is a hard Day.”", "The people of Nûh (Noah) denied (their Messenger) before them, they rejected Our slave, and said: ”A madman!” and he was insolently rebuked and threatened.", "Then he invoked his Lord (saying): ”I have been overcome, so help (me)!”", "So We opened the gates of heaven with water pouring forth.", "And We caused the earth to gush forth with springs. So the waters (of the heaven and the earth) met for a matter predestined.", "And We carried him on a (ship) made of planks and nails,", "Floating under Our Eyes, a reward for him who had been rejected!", "And indeed, We have left this as a sign, then is there any that will remember (or receive admonition)?", "Then how (terrible) was My Torment and My Warnings?", "And We have indeed made the Qur’ân easy to understand and remember, then is there any that will remember (or receive admonition)?", "’Ad (people) belied (their Prophet, Hûd), then how (terrible) was My Torment and My Warnings?", "Verily, We sent against them a furious wind of harsh voice on a day of evil omen and continuous calamity.", "Plucking out men as if they were uprooted stems of date-palms.", "Then, how (terrible) was My Torment and My Warnings?", "And We have indeed made the Qur’ân easy to understand and remember, then is there any that will remember (or receive admonition)?", "Thamûd (people also) belied the warnings.", "For they said: ”A man! Alone from among us, that we are to follow? Truly, then we should be in error and distress or madness!”", "”Is it that the Reminder is sent to him [Prophet Sâlih (Saleh) ] alone from among us? Nay, he is an insolent liar!”", "Tomorrow they will come to know, who is the liar, the insolent one!", "Verily, We are sending the she-camel as a test for them. So watch them [O Sâlih (Saleh) ], and be patient!", "And inform them that the water is to be shared between (her and) them. Each one’s right to drink being established (by turns).", "But they called their comrade and he took (a sword) and killed (her).", "Then, how (terrible) was My Torment and My Warnings?", "Verily, We sent against them a single Saîhah (torment - awful cry, etc.), and they became like the dry stubble of a fold-builder.", "And indeed, We have made the Qur’ân easy to understand and remember, then is there any that will remember (or receive admonition)?", "The people of Lout (Lot) belied the warnings.", "Verily, We sent against them a violent storm of stones (which destroyed them all), except the family of Lout (Lot), whom We saved in last hour of the night,", "As a Favour from Us, thus do We reward him who gives thanks (by obeying Us).", "And he [Lout (Lot)] indeed had warned them of Our Grasp, but they did doubt the warnings!", "And they indeed sought to shame his guest (by asking to commit sodomy with them). So We blinded their eyes, ”Then taste you My Torment and My Warnings.”", "And verily, an abiding torment seized them early in the morning.", "”Then taste you My Torment and My Warnings.”", "And indeed, We have made the Qur’ân easy to understand and remember, then is there any that will remember (or receive admonition)?", "And indeed, warnings came to the people of Fir’aun (Pharaoh) [through Mûsa (Moses) and Hârûn (Aaron)].", "(They) belied all Our Signs, so We seized them with a Seizure of the All-Mighty, All-Capable to carry out what he Will (Omnipotent).", "Are your disbelievers (O Quraish!) better than these [nations of Nûh (Noah), Lout (Lot), Sâlih (Saleh), and the people of Fir’aun (Pharaoh), etc., who were destroyed)? Or have you an immunity (against Our Torment) in the Divine Scriptures?", "Or do they say: ”We are a great multitude, and we shall be victorious.?”", "Their multitude will be put to flight, and they will show their backs.", "Nay, but the Hour is their appointed time (for their full recompense), and the Hour will be more grievous and more bitter.", "Verily, the Mujrimûn (polytheists, disbelievers, sinners, criminals, etc.) are in error (in this world) and will burn (in the Hell-fire in the Hereafter).", "The Day they will be dragged in the Fire on their faces (it will be said to them): ”Taste you the touch of Hell!”", "Verily, We have created all things with Qadar (Divine Preordainments of all things before their creation, as written in the Book of Decrees Al-Lauh Al-Mahfûz).", "And Our Commandment is but one, as the twinkling of an eye.", "And indeed, We have destroyed your likes, then is there any that will remember (or receive admonition)?", "And each and everything they have done is noted in (their) Records (of deeds).", "And everything, small and big is written (in Al-Lauh Al-Mahfûz already beforehand i.e. before it befalls, or is done by its doer ÇáÇíä ÈÇáÞÏÑ) (See the Qur’ân V.57:22).", "Verily, The Muttaqûn (pious), will be in the midst of Gardens and Rivers (Paradise).", "In a seat of truth (i.e. Paradise), near the Omnipotent King (Allâh, the All-Blessed, the Most High, the Owner of Majesty and Honour)."]}