{"name_ar": "سورة الحشر", "ayahs_ar": ["سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ", "هُوَ الَّذِي أَخْرَجَ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ مِن دِيَارِهِمْ لِأَوَّلِ الْحَشْرِ مَا ظَنَنتُمْ أَن يَخْرُجُوا وَظَنُّوا أَنَّهُم مَّانِعَتُهُمْ حُصُونُهُم مِّنَ اللَّهِ فَأَتَاهُمُ اللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ يُخْرِبُونَ بُيُوتَهُم بِأَيْدِيهِمْ وَأَيْدِي الْمُؤْمِنِينَ فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ", "وَلَوْلَا أَن كَتَبَ اللَّهُ عَلَيْهِمُ الْجَلَاء لَعَذَّبَهُمْ فِي الدُّنْيَا وَلَهُمْ فِي الْآخِرَةِ عَذَابُ النَّارِ", "ذَلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ وَمَن يُشَاقِّ اللَّهَ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ", "مَا قَطَعْتُم مِّن لِّينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَى أُصُولِهَا فَبِإِذْنِ اللَّهِ وَلِيُخْزِيَ الْفَاسِقِينَ", "وَمَا أَفَاء اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ وَلَكِنَّ اللَّهَ يُسَلِّطُ رُسُلَهُ عَلَى مَن يَشَاء وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ", "مَّا أَفَاء اللَّهُ عَلَى رَسُولِهِ مِنْ أَهْلِ الْقُرَى فَلِلَّهِ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ كَيْ لَا يَكُونَ دُولَةً بَيْنَ الْأَغْنِيَاء مِنكُمْ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانتَهُوا وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ شَدِيدُ الْعِقَابِ", "لِلْفُقَرَاء الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِن دِيارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلًا مِّنَ اللَّهِ وَرِضْوَانًا وَيَنصُرُونَ اللَّهَ وَرَسُولَهُ أُوْلَئِكَ هُمُ الصَّادِقُونَ", "وَالَّذِينَ تَبَوَّؤُوا الدَّارَ وَالْإِيمَانَ مِن قَبْلِهِمْ يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ وَلَا يَجِدُونَ فِي صُدُورِهِمْ حَاجَةً مِّمَّا أُوتُوا وَيُؤْثِرُونَ عَلَى أَنفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ وَمَن يُوقَ شُحَّ نَفْسِهِ فَأُوْلَئِكَ هُمُ الْمُفْلِحُونَ", "وَالَّذِينَ جَاؤُوا مِن بَعْدِهِمْ يَقُولُونَ رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَؤُوفٌ رَّحِيمٌ", "أَلَمْ تَر إِلَى الَّذِينَ نَافَقُوا يَقُولُونَ لِإِخْوَانِهِمُ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ لَئِنْ أُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيعُ فِيكُمْ أَحَدًا أَبَدًا وَإِن قُوتِلْتُمْ لَنَنصُرَنَّكُمْ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ", "لَئِنْ أُخْرِجُوا لَا يَخْرُجُونَ مَعَهُمْ وَلَئِن قُوتِلُوا لَا يَنصُرُونَهُمْ وَلَئِن نَّصَرُوهُمْ لَيُوَلُّنَّ الْأَدْبَارَ ثُمَّ لَا يُنصَرُونَ", "لَأَنتُمْ أَشَدُّ رَهْبَةً فِي صُدُورِهِم مِّنَ اللَّهِ ذَلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَفْقَهُونَ", "لَا يُقَاتِلُونَكُمْ جَمِيعًا إِلَّا فِي قُرًى مُّحَصَّنَةٍ أَوْ مِن وَرَاء جُدُرٍ بَأْسُهُمْ بَيْنَهُمْ شَدِيدٌ تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّى ذَلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْقِلُونَ", "كَمَثَلِ الَّذِينَ مِن قَبْلِهِمْ قَرِيبًا ذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ", "كَمَثَلِ الشَّيْطَانِ إِذْ قَالَ لِلْإِنسَانِ اكْفُرْ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيءٌ مِّنكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ", "فَكَانَ عَاقِبَتَهُمَا أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا وَذَلِكَ جَزَاء الظَّالِمِينَ", "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ", "وَلَا تَكُونُوا كَالَّذِينَ نَسُوا اللَّهَ فَأَنسَاهُمْ أَنفُسَهُمْ أُوْلَئِكَ هُمُ الْفَاسِقُونَ", "لَا يَسْتَوِي أَصْحَابُ النَّارِ وَأَصْحَابُ الْجَنَّةِ أَصْحَابُ الْجَنَّةِ هُمُ الْفَائِزُونَ", "لَوْ أَنزَلْنَا هَذَا الْقُرْآنَ عَلَى جَبَلٍ لَّرَأَيْتَهُ خَاشِعًا مُّتَصَدِّعًا مِّنْ خَشْيَةِ اللَّهِ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ", "هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَنُ الرَّحِيمُ", "هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ", "هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاء الْحُسْنَى يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ"], "name_en": "Al-Hashr", "ayahs_en": ["Whatsoever is in the heavens and whatsoever is on the earth glorifies Allâh. And He is the All-Mighty, the All-Wise.", "He it is Who drove out the disbelievers among the people of the Scripture (i.e. the Jews of the tribe of Banî An-Nadîr) from their homes at the first gathering. You did not think that they would get out. And they thought that their fortresses would defend them from Allâh! But Allâh’s (Torment) reached them from a place whereof they expected it not, and He cast terror into their hearts, so that they destroyed their own dwellings with their own hands and the hands of the believers. Then take admonition, O you with eyes (to see).", "And had it not been that Allâh had decreed exile for them, He would certainly have punished them in this world, and in the Hereafter theirs shall be the torment of the Fire.", "That is because they opposed Allâh and His Messenger (Muhammad SAW). And whosoever opposes Allâh, then verily, Allâh is Severe in punishment.", "What you (O Muslims) cut down of the palm-trees (of the enemy), or you left them standing on their stems, it was by Leave of Allâh, and in order that He might disgrace the Fâsiqûn (rebellious, disobedient to Allâh).", "And what Allâh gave as booty (Fai’) to His Messenger (Muhammad SAW) from them, for which you made no expedition with either cavalry or camelry. But Allâh gives power to His Messengers over whomsoever He wills. And Allâh is Able to do all things.", "What Allâh gave as booty (Fai’) to His Messenger (Muhammad SAW) from the people of the townships, - it is for Allâh, His Messenger (Muhammad SAW), the kindred (of Messenger Muhammad SAW), the orphans, Al­Masâkin (the poor), and the wayfarer, in order that it may not become a fortune used by the rich among you. And whatsoever the Messenger (Muhammad SAW) gives you, take it, and whatsoever he forbids you, abstain (from it) , and fear Allâh. Verily, Allâh is Severe in punishment.", "(And there is also a share in this booty) for the poor emigrants, who were expelled from their homes and their property, seeking Bounties from Allâh and to please Him. And helping Allâh (i.e. helping His religion) and His Messenger (Muhammad SAW). Such are indeed the truthful (to what they say);-", "And those who, before them, had homes (in Al-Madinah) and had adopted the Faith, love those who emigrate to them, and have no jealousy in their breasts for that which they have been given (from the booty of Banî An-Nadîr), and give them (emigrants) preference over themselves, even though they were in need of that. And whosoever is saved from his own covetousness, such are they who will be the successful.", "And those who came after them say: ”Our Lord! Forgive us and our brethren who have preceded us in Faith, and put not in our hearts any hatred against those who have believed. Our Lord! You are indeed full of kindness, Most Merciful.", "Have you (O Muhammad SAW) not observed the hypocrites who say to their friends among the people of the Scripture who disbelieve: ”(By Allâh) If you are expelled, we (too) indeed will go out with you, and we shall never obey any one against you, and if you are attacked (in fight), we shall indeed help you.” But Allâh is Witness, that they verily, are liars.", "Surely, if they (the Jews) are expelled, never will they (hypocrites) go out with them, and if they are attacked, they will never help them. And if they do help them, they (hypocrites) will turn their backs, so they will not be victorious.", "Verily, you (believers in the Oneness of Allâh - Islâmic Monotheism) are more awful as a fear in their (Jews of Banî An-Nadîr) breasts than Allâh. That is because they are a people who comprehend not (the Majesty and Power of Allâh).", "They fight not against you even together, except in fortified townships, or from behind walls. Their enmity among themselves is very great. You would think they were united, but their hearts are divided, that is because they are a people who understand not.", "They are like their immediate predecessors (the Jews of Banî Qainûqâ’, who suffered), they tasted the evil result of their conduct, and (in the Hereafter, there is) for them a painful torment;-", "(Their allies deceived them) like Shaitân (Satan), when he says to man: ”Disbelieve in Allâh.” But when (man) disbelieves in Allâh, Shaitân (Satan) says: ”I am free of you, I fear Allâh, the Lord of the ’Alamîn (mankind, jinns and all that exists)!”", "So the end of both will be that they will be in the Fire, abiding therein. Such is the recompense of the Zâlimûn (i.e. polytheists, wrong-doers, disbelievers in Allâh and in His Oneness, etc.).", "O you who believe! Fear Allâh and keep your duty to Him. And let every person look to what he has sent forth for the morrow, and fear Allâh. Verily, Allâh is All-Aware of what you do .", "And be not like those who forgot Allâh (i.e. became disobedient to Allâh) and He caused them to forget their ownselves, (let them to forget to do righteous deeds). Those are the Fâsiqûn (rebellious, disobedient to Allâh).", "Not equal are the dwellers of the Fire and the dwellers of the Paradise. It is the dwellers of Paradise that will be successful.", "Had We sent down this Qur’ân on a mountain, you would surely have seen it humbling itself and rending asunder by the fear of Allâh. Such are the parables which We put forward to mankind that they may reflect .", "He is Allâh, than Whom there is Lâ ilâha illa Huwa (none has the right to be worshipped but He) the All-Knower of the unseen and the seen (open). He is the Most Beneficent, the Most Merciful.", "He is Allâh than Whom there is Lâ ilâha illa Huwa (none has the right to be worshipped but He) the King, the Holy, the One Free from all defects, the Giver of security, the Watcher over His creatures, the All-Mighty, the Compeller, the Supreme. Glory be to Allâh! (High is He) above all that they associate as partners with Him.", "He is Allâh, the Creator, the Inventor of all things, the Bestower of forms. To Him belong the Best Names . All that is in the heavens and the earth glorify Him. And He is the All-Mighty, the All-Wise."]}