{"name_ar": "سورة الصف", "ayahs_ar": ["سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ", "يَا أَيُّهَا الَّذِينَ آَمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ", "كَبُرَ مَقْتًا عِندَ اللَّهِ أَن تَقُولُوا مَا لَا تَفْعَلُونَ", "إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُم بُنيَانٌ مَّرْصُوصٌ", "وَإِذْ قَالَ مُوسَى لِقَوْمِهِ يَا قَوْمِ لِمَ تُؤْذُونَنِي وَقَد تَّعْلَمُونَ أَنِّي رَسُولُ اللَّهِ إِلَيْكُمْ فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ", "وَإِذْ قَالَ عِيسَى ابْنُ مَرْيَمَ يَا بَنِي إِسْرَائِيلَ إِنِّي رَسُولُ اللَّهِ إِلَيْكُم مُّصَدِّقًا لِّمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَمُبَشِّرًا بِرَسُولٍ يَأْتِي مِن بَعْدِي اسْمُهُ أَحْمَدُ فَلَمَّا جَاءهُم بِالْبَيِّنَاتِ قَالُوا هَذَا سِحْرٌ مُّبِينٌ", "وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَى عَلَى اللَّهِ الْكَذِبَ وَهُوَ يُدْعَى إِلَى الْإِسْلَامِ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ", "يُرِيدُونَ لِيُطْفِؤُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَاللَّهُ مُتِمُّ نُورِهِ وَلَوْ كَرِهَ الْكَافِرُونَ", "هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَى وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ", "يَا أَيُّهَا الَّذِينَ آَمَنُوا هَلْ أَدُلُّكُمْ عَلَى تِجَارَةٍ تُنجِيكُم مِّنْ عَذَابٍ أَلِيمٍ", "تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِكُمْ وَأَنفُسِكُمْ ذَلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ", "يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَيُدْخِلْكُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ ذَلِكَ الْفَوْزُ الْعَظِيمُ", "وَأُخْرَى تُحِبُّونَهَا نَصْرٌ مِّنَ اللَّهِ وَفَتْحٌ قَرِيبٌ وَبَشِّرِ الْمُؤْمِنِينَ", "يَا أَيُّهَا الَّذِينَ آَمَنُوا كُونوا أَنصَارَ اللَّهِ كَمَا قَالَ عِيسَى ابْنُ مَرْيَمَ لِلْحَوَارِيِّينَ مَنْ أَنصَارِي إِلَى اللَّهِ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنصَارُ اللَّهِ فَآَمَنَت طَّائِفَةٌ مِّن بَنِي إِسْرَائِيلَ وَكَفَرَت طَّائِفَةٌ فَأَيَّدْنَا الَّذِينَ آَمَنُوا عَلَى عَدُوِّهِمْ فَأَصْبَحُوا ظَاهِرِينَ"], "name_en": "As-Saf", "ayahs_en": ["Whatsoever is in the heavens and whatsoever is on the earth glorifies Allâh. And He is the All-Mighty, the All-Wise.", "O you who believe! Why do you say that which you do not do?", "Most hateful it is with Allâh that you say that which you do not do.", "Verily, Allâh loves those who fight in His Cause in rows (ranks) as if they were a solid structure .", "And (remember) when Mûsa (Moses) said to his people: ”O my people! Why do you hurt me while you know certainly that I am the Messenger of Allâh to you? So when they turned away (from the Path of Allâh), Allâh turned their hearts away (from the Right Path). And Allâh guides not the people who are Fâsiqûn (rebellious, disobedient to Allâh).", "And (remember) when ’Iesa (Jesus), son of Maryam (Mary), said: ”O Children of Israel! I am the Messenger of Allâh unto you confirming the Taurât [(Torah) which came] before me, and giving glad tidings of a Messenger to come after me, whose name shall be Ahmed . But when he (Ahmed i.e. Muhammad SAW) came to them with clear proofs, they said: ”This is plain magic.”", "And who does more wrong than the one who invents a lie against Allâh, while he is being invited to Islâm? And Allâh guides not the people who are Zâlimûn (polytheists, wrong-doers and disbelievers) folk.", "They intend to put out the Light of Allâh (i.e. the religion of Islâm, this Qur’ân, and Prophet Muhammad SAW) with their mouths. But Allâh will complete His Light even though the disbelievers hate (it).", "He it is Who has sent His Messenger (Muhammad SAW) with guidance and the religion of truth (Islâmic Monotheism) to make it victorious over all (other) religions even though the Mushrikûn (polytheists, pagans, idolaters, and disbelievers in the Oneness of Allâh and in His Messenger Muhammed SAW) hate (it).", "O You who believe! Shall I guide you to a commerce that will save you from a painful torment.", "That you believe in Allâh and His Messenger (Muhammad SAW), and that you strive hard and fight in the Cause of Allâh with your wealth and your lives, that will be better for you, if you but know!", "(If you do so) He will forgive you your sins, and admit you into Gardens under which rivers flow, and pleasant dwelling in Gardens of ’Adn ­ Eternity [’Adn (Edn) Paradise], that is indeed the great success.", "And also (He will give you) another (blessing) which you love, help from Allâh (against your enemies) and a near victory. And give glad tidings (O Muhammad SAW) to the believers.", "O you who believe! Be you helpers (in the Cause) of Allâh as said ’Iesa (Jesus), son of Maryam (Mary), to Al­Hawârîûn (the disciples): ”Who are my helpers (in the Cause) of Allâh?” Al­Hawârîeen (the disciples) said: ”We are Allâh’s helpers” (i.e. we will strive in His Cause!). Then a group of the Children of Israel believed and a group disbelieved. So We gave power to those who believed against their enemies, and they became the uppermost."]}