{"name_ar": "سورة الجمعة", "ayahs_ar": ["يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ الْمَلِكِ الْقُدُّوسِ الْعَزِيزِ الْحَكِيمِ", "هُوَ الَّذِي بَعَثَ فِي الْأُمِّيِّينَ رَسُولًا مِّنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِهِ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَإِن كَانُوا مِن قَبْلُ لَفِي ضَلَالٍ مُّبِينٍ", "وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا بِهِمْ وَهُوَ الْعَزِيزُ الْحَكِيمُ", "ذَلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَن يَشَاء وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ", "مَثَلُ الَّذِينَ حُمِّلُوا التَّوْرَاةَ ثُمَّ لَمْ يَحْمِلُوهَا كَمَثَلِ الْحِمَارِ يَحْمِلُ أَسْفَارًا بِئْسَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِ اللَّهِ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ", "قُلْ يَا أَيُّهَا الَّذِينَ هَادُوا إِن زَعَمْتُمْ أَنَّكُمْ أَوْلِيَاء لِلَّهِ مِن دُونِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ إِن كُنتُمْ صَادِقِينَ", "وَلَا يَتَمَنَّوْنَهُ أَبَدًا بِمَا قَدَّمَتْ أَيْدِيهِمْ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ", "قُلْ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلَاقِيكُمْ ثُمَّ تُرَدُّونَ إِلَى عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ", "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِي لِلصَّلَاةِ مِن يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَى ذِكْرِ اللَّهِ وَذَرُوا الْبَيْعَ ذَلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ", "فَإِذَا قُضِيَتِ الصَّلَاةُ فَانتَشِرُوا فِي الْأَرْضِ وَابْتَغُوا مِن فَضْلِ اللَّهِ وَاذْكُرُوا اللَّهَ كَثِيرًا لَّعَلَّكُمْ تُفْلِحُونَ", "وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا قُلْ مَا عِندَ اللَّهِ خَيْرٌ مِّنَ اللَّهْوِ وَمِنَ التِّجَارَةِ وَاللَّهُ خَيْرُ الرَّازِقِينَ"], "name_en": "Al-Jumu`ah", "ayahs_en": ["Whatsoever is in the heavens and whatsoever is on the earth glorifies Allâh, the King (of everything), the Holy, the All-Mighty, the All-Wise.", "He it is Who sent among the unlettered ones a Messenger (Muhammad SAW) from among themselves, reciting to them His Verses, purifying them (from the filth of disbelief and polytheism), and teaching them the Book (this Qur’ân, Islâmic laws and Islâmic jurisprudence) and Al-Hikmah (As-Sunnah: legal ways, orders, acts of worship, etc. of Prophet Muhammad SAW). And verily, they had been before in mainfest error;", "And He has sent him (Prophet Muhammad SAW) also to others among them (Muslims) who have not yet joined them (but they will come). And He (Allâh) is the All-Mighty, the All-Wise.", "That is the Grace of Allâh, which He bestows on whom He wills. And Allâh is the Owner of Mighty Grace.", "The likeness of those who were entrusted with the (obligation of the) Taurât (Torah) (i.e. to obey its commandments and to practise its legal laws), but who subsequently failed in those (obligations), is as the likeness of a donkey who carries huge burdens of books (but understands nothing from them). How bad is the example (or the likeness) of people who deny the Ayât (proofs, evidences, verses, signs, revelations, etc.) of Allâh. And Allâh guides not the people who are Zâlimûn (polytheists, wrong-doers, disbelievers, etc.).", "Say (O Muhammad SAW): ”O you Jews! If you pretend that you are friends of Allâh, to the exclusion of (all) other mankind, then long for death if you are truthful.”", "But they will never long for it (death), because of what (deeds) their hands have sent before them! And Allâh knows well the Zâlimûn (polytheists, wrong-doers, disbelievers, etc.).", "Say (to them): ”Verily, the death from which you flee will surely meet you, then you will be sent back to (Allâh), the All-Knower of the unseen and the seen, and He will tell you what you used to do.”", "O you who believe (Muslims)! When the call is proclaimed for the Salât (prayer) on the day of Friday (Jumu’ah prayer), come to the remembrance of Allâh [Jumu’ah religious talk (Khutbah) and Salât (prayer)] and leave off business (and every other thing), that is better for you if you did but know!", "Then when the (Jumu’ah) Salât (prayer) is finished, you may disperse through the land, and seek the Bounty of Allâh (by working, etc.), and remember Allâh much, that you may be successful.", "And when they see some merchandise or some amusement [beating of Tambur (drum) etc.] they disperse headlong to it, and leave you (Muhammad SAW) standing [while delivering Jumu’ah’s religious talk (Khutbah)]. Say ”That which Allâh has is better than any amusement or merchandise! And Allâh is the Best of providers.”"]}