{"name_ar": "سورة القلم", "ayahs_ar": ["ن وَالْقَلَمِ وَمَا يَسْطُرُونَ", "مَا أَنتَ بِنِعْمَةِ رَبِّكَ بِمَجْنُونٍ", "وَإِنَّ لَكَ لَأَجْرًا غَيْرَ مَمْنُونٍ", "وَإِنَّكَ لَعَلى خُلُقٍ عَظِيمٍ", "فَسَتُبْصِرُ وَيُبْصِرُونَ", "بِأَييِّكُمُ الْمَفْتُونُ", "إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَن ضَلَّ عَن سَبِيلِهِ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ", "فَلَا تُطِعِ الْمُكَذِّبِينَ", "وَدُّوا لَوْ تُدْهِنُ فَيُدْهِنُونَ", "وَلَا تُطِعْ كُلَّ حَلَّافٍ مَّهِينٍ", "هَمَّازٍ مَّشَّاء بِنَمِيمٍ", "مَنَّاعٍ لِّلْخَيْرِ مُعْتَدٍ أَثِيمٍ", "عُتُلٍّ بَعْدَ ذَلِكَ زَنِيمٍ", "أَن كَانَ ذَا مَالٍ وَبَنِينَ", "إِذَا تُتْلَى عَلَيْهِ آيَاتُنَا قَالَ أَسَاطِيرُ الْأَوَّلِينَ", "سَنَسِمُهُ عَلَى الْخُرْطُومِ", "إِنَّا بَلَوْنَاهُمْ كَمَا بَلَوْنَا أَصْحَابَ الْجَنَّةِ إِذْ أَقْسَمُوا لَيَصْرِمُنَّهَا مُصْبِحِينَ", "وَلَا يَسْتَثْنُونَ", "فَطَافَ عَلَيْهَا طَائِفٌ مِّن رَّبِّكَ وَهُمْ نَائِمُونَ", "فَأَصْبَحَتْ كَالصَّرِيمِ", "فَتَنَادَوا مُصْبِحِينَ", "أَنِ اغْدُوا عَلَى حَرْثِكُمْ إِن كُنتُمْ صَارِمِينَ", "فَانطَلَقُوا وَهُمْ يَتَخَافَتُونَ", "أَن لَّا يَدْخُلَنَّهَا الْيَوْمَ عَلَيْكُم مِّسْكِينٌ", "وَغَدَوْا عَلَى حَرْدٍ قَادِرِينَ", "فَلَمَّا رَأَوْهَا قَالُوا إِنَّا لَضَالُّونَ", "بَلْ نَحْنُ مَحْرُومُونَ", "قَالَ أَوْسَطُهُمْ أَلَمْ أَقُل لَّكُمْ لَوْلَا تُسَبِّحُونَ", "قَالُوا سُبْحَانَ رَبِّنَا إِنَّا كُنَّا ظَالِمِينَ", "فَأَقْبَلَ بَعْضُهُمْ عَلَى بَعْضٍ يَتَلَاوَمُونَ", "قَالُوا يَا وَيْلَنَا إِنَّا كُنَّا طَاغِينَ", "عَسَى رَبُّنَا أَن يُبْدِلَنَا خَيْرًا مِّنْهَا إِنَّا إِلَى رَبِّنَا رَاغِبُونَ", "كَذَلِكَ الْعَذَابُ وَلَعَذَابُ الْآخِرَةِ أَكْبَرُ لَوْ كَانُوا يَعْلَمُونَ", "إِنَّ لِلْمُتَّقِينَ عِندَ رَبِّهِمْ جَنَّاتِ النَّعِيمِ", "أَفَنَجْعَلُ الْمُسْلِمِينَ كَالْمُجْرِمِينَ", "مَا لَكُمْ كَيْفَ تَحْكُمُونَ", "أَمْ لَكُمْ كِتَابٌ فِيهِ تَدْرُسُونَ", "إِنَّ لَكُمْ فِيهِ لَمَا يَتَخَيَّرُونَ", "أَمْ لَكُمْ أَيْمَانٌ عَلَيْنَا بَالِغَةٌ إِلَى يَوْمِ الْقِيَامَةِ إِنَّ لَكُمْ لَمَا تَحْكُمُونَ", "سَلْهُم أَيُّهُم بِذَلِكَ زَعِيمٌ", "أَمْ لَهُمْ شُرَكَاء فَلْيَأْتُوا بِشُرَكَائِهِمْ إِن كَانُوا صَادِقِينَ", "يَوْمَ يُكْشَفُ عَن سَاقٍ وَيُدْعَوْنَ إِلَى السُّجُودِ فَلَا يَسْتَطِيعُونَ", "خَاشِعَةً أَبْصَارُهُمْ تَرْهَقُهُمْ ذِلَّةٌ وَقَدْ كَانُوا يُدْعَوْنَ إِلَى السُّجُودِ وَهُمْ سَالِمُونَ", "فَذَرْنِي وَمَن يُكَذِّبُ بِهَذَا الْحَدِيثِ سَنَسْتَدْرِجُهُم مِّنْ حَيْثُ لَا يَعْلَمُونَ", "وَأُمْلِي لَهُمْ إِنَّ كَيْدِي مَتِينٌ", "أَمْ تَسْأَلُهُمْ أَجْرًا فَهُم مِّن مَّغْرَمٍ مُّثْقَلُونَ", "أَمْ عِندَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُونَ", "فَاصْبِرْ لِحُكْمِ رَبِّكَ وَلَا تَكُن كَصَاحِبِ الْحُوتِ إِذْ نَادَى وَهُوَ مَكْظُومٌ", "لَوْلَا أَن تَدَارَكَهُ نِعْمَةٌ مِّن رَّبِّهِ لَنُبِذَ بِالْعَرَاء وَهُوَ مَذْمُومٌ", "فَاجْتَبَاهُ رَبُّهُ فَجَعَلَهُ مِنَ الصَّالِحِينَ", "وَإِن يَكَادُ الَّذِينَ كَفَرُوا لَيُزْلِقُونَكَ بِأَبْصَارِهِمْ لَمَّا سَمِعُوا الذِّكْرَ وَيَقُولُونَ إِنَّهُ لَمَجْنُونٌ", "وَمَا هُوَ إِلَّا ذِكْرٌ لِّلْعَالَمِينَ"], "name_en": "Al-Qalam", "ayahs_en": ["Nûn. [These letters (Nûn, etc.) are one of the miracles of the Qur’ân, and none but Allâh (Alone) knows their meanings]. By the pen and what the (angels) write (in the Records of men).", "You (O Muhammad SAW) are not, by the Grace of your Lord, a madman.", "And verily, for you (O Muhammad SAW) will be an endless reward.", "And verily, you (O Muhammad SAW) are on an exalted standard of character.", "You will see, and they will see,", "Which of you is afflicted with madness.", "Verily, your Lord knows better, who (among men) has gone astray from His Path, and He knows better those who are guided.", "So (O Muhammad SAW) obey not the deniers [(of Islâmic Monotheism those who belie the Verses of Allâh), the Oneness of Allâh, and the Messenger of Allâh (Muhammad SAW), etc.]", "They wish that you should compromise (in religion out of courtesy) with them, so they (too) would compromise with you.", "And obey not everyone who swears much, and is considered worthless,", "A slanderer, going about with calumnies,", "Hinderer of the good, transgressor, sinful,", "Cruel, after all that base-born (of illegitimate birth),", "(He was so) because he had wealth and children.", "When Our Verses (of the Qur’ân) are recited to him, he says: ”Tales of the men of old!”", "We shall brand him over the nose!", "Verily, We have tried them as We tried the people of the garden, when they swore to pluck the fruits of the (garden) in the morning,", "Without saying: Inshâ’ Allâh (If Allâh will).", "Then there passed by on the (garden) something (fire) from your Lord at night and burnt it while they were asleep.", "So the (garden) became black by the morning, like a pitch dark night (in complete ruins).", "Then they called out one to another as soon as the morning broke,", "Saying: ”Go to your tilth in the morning, if you would pluck the fruits.”", "So they departed, conversing in secret low tones (saying),", "No Miskîn (poor man) shall enter upon you into it today.", "And they went in the morning with strong intention, thinking that they have power (to prevent the poor taking anything of the fruits therefrom).", "But when they saw the (garden), they said: ”Verily, we have gone astray,”", "(Then they said): ”Nay! Indeed we are deprived of (the fruits)!”", "The best among them said: ”Did I not tell you: why do you not say: Inshâ’ Allâh (If Allâh will).”", "They said: ”Glory to Our Lord! Verily, we have been Zâlimûn (wrong-doers, etc.).”", "Then they turned, one against another, in blaming.", "They said: ”Woe to us! Verily, we were Tâghûn (transgressors and disobedient, etc.)", "We hope that our Lord will give us in exchange a better (garden) than this. Truly, we turn to our Lord (wishing for good that He may forgive our sins, and reward us in the Hereafter).”", "Such is the punishment (in this life), but truly, the punishment of the Hereafter is greater, if they but knew.", "Verily, for the Muttaqûn (pious and righteous persons - see V.2:2) are Gardens of delight (Paradise) with their Lord.", "Shall We then treat the (submitting) Muslims like the Mujrimûn (criminals, polytheists and disbelievers, etc.)?", "What is the matter with you? How judge you?", "Or have you a Book through which you learn.", "That you shall have all that you choose?", "Or you have oaths from Us, reaching to the Day of Resurrection that yours will be what you judge.", "Ask them, which of them will stand surety for that!", "Or have they ”partners”? Then let them bring their ”partners” if they are truthful!", "(Remember) the Day when the Shin shall be laid bare (i.e. the Day of Resurrection) and they shall be called to prostrate (to Allâh), but they (hypocrites) shall not be able to do so,", "Their eyes will be cast down, ignominy will cover them; they used to be called to prostrate (offer prayers), while they were healthy and good (in the life of the world, but they did not).", "Then leave Me Alone with such as belie this Qur’ân. We shall punish them gradually from directions they perceive not.", "And I will grant them a respite. Verily, My Plan is strong.", "Or is it that you (O Muhammad SAW) ask them a wage, so that they are heavily burdened with debt?", "Or that the Ghaib (unseen here in this Verse it means Al-Lauh Al-Mahfûz) is in their hands, so that they can write it down?", "So wait with patience for the Decision of your Lord, and be not like the Companion of the Fish, when he cried out (to Us) while he was in deep sorrow. (See the Qur’ân, Verse 21:87).", "Had not a Grace from his Lord reached him, he would indeed have been (left in the stomach of the fish, but We forgave him), so he was cast off on the naked shore, while he was to be blamed.", "But his Lord chose him and made him of the righteous.", "And verily, those who disbelieve would almost make you slip with their eyes through hatredness when they hear the Reminder (the Qur’ân), and they say: ”Verily, he (Muhammad SAW) is a madman!”", "But it is nothing else than a Reminder to all the ’Alamîn (mankind, jinns and all that exists)."]}