{"name_ar": "سورة المعارج", "ayahs_ar": ["سَأَلَ سَائِلٌ بِعَذَابٍ وَاقِعٍ", "لِّلْكَافِرينَ لَيْسَ لَهُ دَافِعٌ", "مِّنَ اللَّهِ ذِي الْمَعَارِجِ", "تَعْرُجُ الْمَلَائِكَةُ وَالرُّوحُ إِلَيْهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ", "فَاصْبِرْ صَبْرًا جَمِيلًا", "إِنَّهُمْ يَرَوْنَهُ بَعِيدًا", "وَنَرَاهُ قَرِيبًا", "يَوْمَ تَكُونُ السَّمَاء كَالْمُهْلِ", "وَتَكُونُ الْجِبَالُ كَالْعِهْنِ", "وَلَا يَسْأَلُ حَمِيمٌ حَمِيمًا", "يُبَصَّرُونَهُمْ يَوَدُّ الْمُجْرِمُ لَوْ يَفْتَدِي مِنْ عَذَابِ يَوْمِئِذٍ بِبَنِيهِ", "وَصَاحِبَتِهِ وَأَخِيهِ", "وَفَصِيلَتِهِ الَّتِي تُؤْويهِ", "وَمَن فِي الْأَرْضِ جَمِيعًا ثُمَّ يُنجِيهِ", "كَلَّا إِنَّهَا لَظَى", "نَزَّاعَةً لِّلشَّوَى", "تَدْعُو مَنْ أَدْبَرَ وَتَوَلَّى", "وَجَمَعَ فَأَوْعَى", "إِنَّ الْإِنسَانَ خُلِقَ هَلُوعًا", "إِذَا مَسَّهُ الشَّرُّ جَزُوعًا", "وَإِذَا مَسَّهُ الْخَيْرُ مَنُوعًا", "إِلَّا الْمُصَلِّينَ", "الَّذِينَ هُمْ عَلَى صَلَاتِهِمْ دَائِمُونَ", "وَالَّذِينَ فِي أَمْوَالِهِمْ حَقٌّ مَّعْلُومٌ", "لِّلسَّائِلِ وَالْمَحْرُومِ", "وَالَّذِينَ يُصَدِّقُونَ بِيَوْمِ الدِّينِ", "وَالَّذِينَ هُم مِّنْ عَذَابِ رَبِّهِم مُّشْفِقُونَ", "إِنَّ عَذَابَ رَبِّهِمْ غَيْرُ مَأْمُونٍ", "وَالَّذِينَ هُمْ لِفُرُوجِهِمْ حَافِظُونَ", "إِلَّا عَلَى أَزْوَاجِهِمْ أَوْ مَا مَلَكَتْ أَيْمَانُهُمْ فَإِنَّهُمْ غَيْرُ مَلُومِينَ", "فَمَنِ ابْتَغَى وَرَاء ذَلِكَ فَأُوْلَئِكَ هُمُ الْعَادُونَ", "وَالَّذِينَ هُمْ لِأَمَانَاتِهِمْ وَعَهْدِهِمْ رَاعُونَ", "وَالَّذِينَ هُم بِشَهَادَاتِهِمْ قَائِمُونَ", "وَالَّذِينَ هُمْ عَلَى صَلَاتِهِمْ يُحَافِظُونَ", "أُوْلَئِكَ فِي جَنَّاتٍ مُّكْرَمُونَ", "فَمَالِ الَّذِينَ كَفَرُوا قِبَلَكَ مُهْطِعِينَ", "عَنِ الْيَمِينِ وَعَنِ الشِّمَالِ عِزِينَ", "أَيَطْمَعُ كُلُّ امْرِئٍ مِّنْهُمْ أَن يُدْخَلَ جَنَّةَ نَعِيمٍ", "كَلَّا إِنَّا خَلَقْنَاهُم مِّمَّا يَعْلَمُونَ", "فَلَا أُقْسِمُ بِرَبِّ الْمَشَارِقِ وَالْمَغَارِبِ إِنَّا لَقَادِرُونَ", "عَلَى أَن نُّبَدِّلَ خَيْرًا مِّنْهُمْ وَمَا نَحْنُ بِمَسْبُوقِينَ", "فَذَرْهُمْ يَخُوضُوا وَيَلْعَبُوا حَتَّى يُلَاقُوا يَوْمَهُمُ الَّذِي يُوعَدُونَ", "يَوْمَ يَخْرُجُونَ مِنَ الْأَجْدَاثِ سِرَاعًا كَأَنَّهُمْ إِلَى نُصُبٍ يُوفِضُونَ", "خَاشِعَةً أَبْصَارُهُمْ تَرْهَقُهُمْ ذِلَّةٌ ذَلِكَ الْيَوْمُ الَّذِي كَانُوا يُوعَدُونَ"], "name_en": "Al-Ma`arij", "ayahs_en": ["A questioner asked concerning a torment about to befall", "Upon the disbelievers, which none can avert,", "From Allâh, the Lord of the ways of ascent.", "The angels and the Rûh [Jibrael (Gabriel)] ascend to Him in a Day the measure whereof is fifty thousand years,", "So be patient (O Muhammad SAW ), with a good patience.", "Verily! They see it (the torment) afar off,", "But We see it (quite) near.", "The Day that the sky will be like the boiling filth of oil, (or molten copper or silver or lead, etc.).", "And the mountains will be like flakes of wool,", "And no friend will ask of a friend,", "Though they shall be made to see one another [(i.e. on the Day of Resurrection), there will be none but see his father, children and relatives, but he will neither speak to them nor will ask them for any help)], - the Mujrim, (criminal, sinner, disbeliever, etc.) would desire to ransom himself from the punishment of that Day by his children.", "And his wife and his brother,", "And his kindred who sheltered him,", "And all that are in the earth, so that it might save him .", "By no means! Verily, it will be the Fire of Hell!", "Taking away (burning completely) the head skin!", "Calling: ”[O Kafir (O disbeliever in Allâh, His angels, His Book, His Messengers, Day of Resurrection and in Al-Qadar (Divine Preordainments), O Mushrik (O polytheist, disbeliever in the Oneness of Allâh)] (all) such as turn their backs and turn away their faces (from Faith) [picking and swallowing them up from that great gathering of mankind (on the Day of Resurrection) just as a bird picks up a food-grain from the earth with its beak and swallows it up] [Tafsir Al-Qurtubî, Vol. 18, Page 289]", "And collect (wealth) and hide it (from spending it in the Cause of Allâh).", "Verily, man (disbeliever) was created very impatient;", "Irritable (discontented) when evil touches him;", "And niggardly when good touches him;-", "Except those devoted to Salât (prayers)", "Those who remain constant in their Salât (prayers);", "And those in whose wealth there is a known right,", "For the beggar who asks, and for the unlucky who has lost his property and wealth, (and his means of living has been straitened);", "And those who believe in the Day of Recompense,", "And those who fear the torment of their Lord,", "Verily! The torment of their Lord is that before which none can feel secure,", "And those who guard their chastity (i.e. private parts from illegal sexual acts) .", "Except with their wives and the (women slaves and captives) whom their right hands possess, for (then) they are not to be blamed,", "But whosoever seeks beyond that, then it is those who are trespassers.", "And those who keep their trusts and covenants;", "And those who stand firm in their testimonies;", "And those who guard their Salât (prayers) well ,", "Such shall dwell in the Gardens (i.e. Paradise) honoured.", "So what is the matter with those who disbelieve that they hasten to listen from you (O Muhammad SAW), in order to belie you and to mock at you, and at Allâh’s Book (this Qur’ân).", "(Sitting) in groups on the right and on the left (of you, O Muhammad SAW)?", "Does every man of them hope to enter the Paradise of delight?", "No, that is not like that! Verily, We have created them out of that which they know!", "So I swear by the Lord of all [the three hundred and sixty (360)] points of sunrise and sunset in the east and the west that surely We are Able", "To replace them by (others) better than them; and We are not to be outrun.", "So leave them to plunge in vain talk and play about, until they meet their Day which they are promised.", "The Day when they will come out of the graves quickly as racing to a goal,", "With their eyes lowered in fear and humility, ignominy covering them (all over)! That is the Day which they were promised!"]}