{"name_ar": "سورة نوح", "ayahs_ar": ["إِنَّا أَرْسَلْنَا نُوحًا إِلَى قَوْمِهِ أَنْ أَنذِرْ قَوْمَكَ مِن قَبْلِ أَن يَأْتِيَهُمْ عَذَابٌ أَلِيمٌ", "قَالَ يَا قَوْمِ إِنِّي لَكُمْ نَذِيرٌ مُّبِينٌ", "أَنِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ وَأَطِيعُونِ", "يَغْفِرْ لَكُم مِّن ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إِلَى أَجَلٍ مُّسَمًّى إِنَّ أَجَلَ اللَّهِ إِذَا جَاء لَا يُؤَخَّرُ لَوْ كُنتُمْ تَعْلَمُونَ", "قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا", "فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا", "وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا", "ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا", "ثُمَّ إِنِّي أَعْلَنتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا", "فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا", "يُرْسِلِ السَّمَاء عَلَيْكُم مِّدْرَارًا", "وَيُمْدِدْكُمْ بِأَمْوَالٍ وَبَنِينَ وَيَجْعَل لَّكُمْ جَنَّاتٍ وَيَجْعَل لَّكُمْ أَنْهَارًا", "مَّا لَكُمْ لَا تَرْجُونَ لِلَّهِ وَقَارًا", "وَقَدْ خَلَقَكُمْ أَطْوَارًا", "أَلَمْ تَرَوْا كَيْفَ خَلَقَ اللَّهُ سَبْعَ سَمَاوَاتٍ طِبَاقًا", "وَجَعَلَ الْقَمَرَ فِيهِنَّ نُورًا وَجَعَلَ الشَّمْسَ سِرَاجًا", "وَاللَّهُ أَنبَتَكُم مِّنَ الْأَرْضِ نَبَاتًا", "ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجًا", "وَاللَّهُ جَعَلَ لَكُمُ الْأَرْضَ بِسَاطًا", "لِتَسْلُكُوا مِنْهَا سُبُلًا فِجَاجًا", "قَالَ نُوحٌ رَّبِّ إِنَّهُمْ عَصَوْنِي وَاتَّبَعُوا مَن لَّمْ يَزِدْهُ مَالُهُ وَوَلَدُهُ إِلَّا خَسَارًا", "وَمَكَرُوا مَكْرًا كُبَّارًا", "وَقَالُوا لَا تَذَرُنَّ آلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا", "وَقَدْ أَضَلُّوا كَثِيرًا وَلَا تَزِدِ الظَّالِمِينَ إِلَّا ضَلَالًا", "مِمَّا خَطِيئَاتِهِمْ أُغْرِقُوا فَأُدْخِلُوا نَارًا فَلَمْ يَجِدُوا لَهُم مِّن دُونِ اللَّهِ أَنصَارًا", "وَقَالَ نُوحٌ رَّبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا", "إِنَّكَ إِن تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا", "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا"], "name_en": "Nuh", "ayahs_en": ["Verily, We sent Nûh (Noah) to his people (Saying): ”Warn your people before there comes to them a painful torment.”", "He said: ”O my people! Verily, I am a plain warner to you,", "”That you should worship Allâh (Alone), be dutiful to Him, and obey me,", "”He (Allâh) will forgive you of your sins and respite you to an appointed term. Verily, the term of Allâh when it comes, cannot be delayed, if you but knew.”", "He said: ”O my Lord! Verily, I have called my people night and day (i.e. secretly and openly to accept the doctrine of Islâmic Monotheism) ,", "”But all my calling added nothing but to (their) flight (from the truth).", "”And verily! Every time I called unto them that You might forgive them, they thrust their fingers into their ears, covered themselves up with their garments, and persisted (in their refusal), and magnified themselves in pride.", "”Then verily, I called to them openly (aloud);", "”Then verily, I proclaimed to them in public, and I have appealed to them in private,", "”I said (to them): ’Ask forgiveness from your Lord; Verily, He is Oft-Forgiving;", "’He will send rain to you in abundance;", "’And give you increase in wealth and children, and bestow on you gardens and bestow on you rivers.’ ”", "What is the matter with you, [that you fear not Allâh (His punishment), and] you hope not for reward (from Allâh or you believe not in His Oneness).", "While He has created you in (different) stages [i.e. first Nutfah, then ’Alaqah and then Mudghah, see (VV.23:13,14) the Qur’ân].", "See you not how Allâh has created the seven heavens one above another,", "And has made the moon a light therein, and made the sun a lamp?", "And Allâh has brought you forth from the (dust of) earth. [Tafsir At-Tabarî, Vol.29, Page 97].", "Afterwards He will return you into it (the earth), and bring you forth (again on the Day of Resurrection)?", "And Allâh has made for you the earth wide spread (an expanse).", "That you may go about therein in broad roads.", "Nûh (Noah) said: ”My Lord! They have disobeyed me, and followed one whose wealth and children give him no increase but only loss.", "”And they have plotted a mighty plot.", "”And they have said: ’You shall not leave your gods, nor shall you leave Wadd, nor Suwâ’, nor Yaghûth, nor Ya’ûq, nor Nasr (names of the idols);", "”And indeed they have led many astray. And (O Allâh): ’Grant no increase to the Zâlimûn (polytheists, wrong-doers, and disbelievers, etc.) save error.’ ”", "Because of their sins they were drowned, then were made to enter the Fire, and they found none to help them instead of Allâh.", "And Nûh (Noah) said: ”My Lord! Leave not one of the disbelievers on the earth!", "”If You leave them, they will mislead Your slaves, and they will beget none but wicked disbelievers.”", "”My Lord! Forgive me, and my parents, and him who enters my home as a believer, and all the believing men and women. And to the Zâlimûn (polytheists, wrong-doers, and disbelievers, etc.) grant You no increase but destruction!”"]}