{"name_ar": "سورة المدّثر", "ayahs_ar": ["يَا أَيُّهَا الْمُدَّثِّرُ", "قُمْ فَأَنذِرْ", "وَرَبَّكَ فَكَبِّرْ", "وَثِيَابَكَ فَطَهِّرْ", "وَالرُّجْزَ فَاهْجُرْ", "وَلَا تَمْنُن تَسْتَكْثِرُ", "وَلِرَبِّكَ فَاصْبِرْ", "فَإِذَا نُقِرَ فِي النَّاقُور", "فَذَلِكَ يَوْمَئِذٍ يَوْمٌ عَسِيرٌ", "عَلَى الْكَافِرِينَ غَيْرُ يَسِيرٍ", "ذَرْنِي وَمَنْ خَلَقْتُ وَحِيدًا", "وَجَعَلْتُ لَهُ مَالًا مَّمْدُودًا", "وَبَنِينَ شُهُودًا", "وَمَهَّدتُّ لَهُ تَمْهِيدًا", "ثُمَّ يَطْمَعُ أَنْ أَزِيدَ", "كَلَّا إِنَّهُ كَانَ لِآيَاتِنَا عَنِيدًا", "سَأُرْهِقُهُ صَعُودًا", "إِنَّهُ فَكَّرَ وَقَدَّرَ", "فَقُتِلَ كَيْفَ قَدَّرَ", "ثُمَّ قُتِلَ كَيْفَ قَدَّرَ", "ثُمَّ نَظَرَ", "ثُمَّ عَبَسَ وَبَسَرَ", "ثُمَّ أَدْبَرَ وَاسْتَكْبَرَ", "فَقَالَ إِنْ هَذَا إِلَّا سِحْرٌ يُؤْثَرُ", "إِنْ هَذَا إِلَّا قَوْلُ الْبَشَر", "سَأُصْلِيهِ سَقَرَ", "وَمَا أَدْرَاكَ مَا سَقَرُ", "لَا تُبْقِي وَلَا تَذَرُ", "لَوَّاحَةٌ لِّلْبَشَر", "عَلَيْهَا تِسْعَةَ عَشَرَ", "وَمَا جَعَلْنَا أَصْحَابَ النَّارِ إِلَّا مَلَائِكَةً وَمَا جَعَلْنَا عِدَّتَهُمْ إِلَّا فِتْنَةً لِّلَّذِينَ كَفَرُوا لِيَسْتَيْقِنَ الَّذِينَ أُوتُوا الْكِتَابَ وَيَزْدَادَ الَّذِينَ آمَنُوا إِيمَانًا وَلَا يَرْتَابَ الَّذِينَ أُوتُوا الْكِتَابَ وَالْمُؤْمِنُونَ وَلِيَقُولَ الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ وَالْكَافِرُونَ مَاذَا أَرَادَ اللَّهُ بِهَذَا مَثَلًا كَذَلِكَ يُضِلُّ اللَّهُ مَن يَشَاء وَيَهْدِي مَن يَشَاء وَمَا يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ وَمَا هِيَ إِلَّا ذِكْرَى لِلْبَشَر", "كَلَّا وَالْقَمَر", "وَاللَّيْلِ إِذْ أَدْبَرَ", "وَالصُّبْحِ إِذَا أَسْفَرَ", "إِنَّهَا لَإِحْدَى الْكُبَر", "نَذِيرًا لِّلْبَشَر", "لِمَن شَاء مِنكُمْ أَن يَتَقَدَّمَ أَوْ يَتَأَخَّرَ", "كُلُّ نَفْسٍ بِمَا كَسَبَتْ رَهِينَةٌ", "إِلَّا أَصْحَابَ الْيَمِين", "فِي جَنَّاتٍ يَتَسَاءلُونَ", "عَنِ الْمُجْرِمِينَ", "مَا سَلَكَكُمْ فِي سَقَرَ", "قَالُوا لَمْ نَكُ مِنَ الْمُصَلِّينَ", "وَلَمْ نَكُ نُطْعِمُ الْمِسْكِينَ", "وَكُنَّا نَخُوضُ مَعَ الْخَائِضِينَ", "وَكُنَّا نُكَذِّبُ بِيَوْمِ الدِّين", "حَتَّى أَتَانَا الْيَقِينُ", "فَمَا تَنفَعُهُمْ شَفَاعَةُ الشَّافِعِينَ", "فَمَا لَهُمْ عَنِ التَّذْكِرَةِ مُعْرِضِينَ", "كَأَنَّهُمْ حُمُرٌ مُّسْتَنفِرَةٌ", "فَرَّتْ مِن قَسْوَرَةٍ", "بَلْ يُرِيدُ كُلُّ امْرِئٍ مِّنْهُمْ أَن يُؤْتَى صُحُفًا مُّنَشَّرَةً", "كَلَّا بَل لَا يَخَافُونَ الْآخِرَةَ", "كَلَّا إِنَّهُ تَذْكِرَةٌ", "فَمَن شَاء ذَكَرَهُ", "وَمَا يَذْكُرُونَ إِلَّا أَن يَشَاء اللَّهُ هُوَ أَهْلُ التَّقْوَى وَأَهْلُ الْمَغْفِرَة"], "name_en": "Al-Muddaththir", "ayahs_en": ["O you (Muhammad SAW) enveloped (in garments)!", "Arise and warn!", "And your Lord (Allâh) magnify!", "And your garments purify!", "And keep away from Ar-Rujz (the idols)!", "And give not a thing in order to have more (or consider not your deeds of Allâh’s obedience as a favour to Allâh).", "And be patient for the sake of your Lord (i.e. perform your duty to Allâh)!", "Then, when the Trumpet is sounded (i.e. its second blowing);", "Truly, that Day will be a Hard Day.", "Far from easy for the disbelievers.", "Leave Me Alone (to deal) with whom I created Alone (without any means, i.e. Al-Walîd bin Al-Mughîrah Al-Makhzûmî)!", "And then granted him resources in abundance.", "And children to be by his side!", "And made life smooth and comfortable for him!", "After all that he desires that I should give more;", "Nay! Verily, he has been stubborn and opposing Our Ayât (proofs, evidences, verses, lessons, signs, revelations, etc.).", "I shall oblige him to (climb a slippery mountain in the Hell-fire called As­Sa’ûd, or to) face a severe torment!", "Verily, he thought and plotted;", "So let him be cursed! How he plotted!", "And once more let him be cursed, how he plotted!", "Then he thought;", "Then he frowned and he looked in a bad tempered way;", "Then he turned back and was proud;", "Then he said: ”This is nothing but magic from that of old;", "”This is nothing but the word of a human being!”", "I will cast him into Hell-fire", "And what will make you know exactly what Hell-fire is?", "It spares not (any sinner), nor does it leave (anything unburnt)!", "Burning the skins!", "Over it are nineteen (angels as guardians and keepers of Hell).", "And We have set none but angels as guardians of the Fire, and We have fixed their number (19) only as a trial for the disbelievers, in order that the people of the Scripture (Jews and Christians) may arrive at a certainty [that this Qur’ân is the truth as it agrees with their Books i.e. their number (19) is written in the Taurât (Torah) and the Injeel (Gospel)] and the believers may increase in Faith (as this Qur’ân is the truth) and that no doubts may be left for the people of the Scripture and the believers, and that those in whose hearts is a disease (of hypocrisy) and the disbelievers may say: ”What Allâh intends by this (curious) example ?” Thus Allâh leads astray whom He wills and guides whom He wills. And none can know the hosts of your Lord but He. And this (Hell) is nothing else than a (warning) reminder to mankind.", "Nay, and by the moon,", "And by the night when it withdraws,", "And by the dawn when it brightens,", "Verily, it (Hell, or their denial of the Prophet Muhammad SAW , or the Day of Resurrection) is but one of the greatest calamities.", "A warning to mankind,", "To any of you that chooses to go forward (by working righteous deeds), or to remain behind (by commiting sins),", "Every person is a pledge for what he has earned,", "Except those on the Right, (i.e. the pious true believers of Islâmic Monotheism);", "In Gardens (Paradise) they will ask one another,", "About Al-Mujrimûn (polytheists, criminals, disbelievers, etc.), (And they will say to them):", "”What has caused you to enter Hell?”", "They will say: ”We were not of those who used to offer their Salât (prayers)", "”Nor we used to feed Al-Miskin (the poor);", "”And we used to talk falsehood (all that which Allâh hated) with vain talkers .", "”And we used to belie the Day of Recompense", "”Until there came to us (the death) that is certain.”", "So no intercession of intercessors will be of any use to them.", "Then what is wrong with them (i.e. the disbelievers) that they turn away from (receiving) admonition?", "As if they were frightened (wild) donkeys.", "Fleeing from a hunter, or a lion, or a beast of prey.", "Nay, everyone of them desires that he should be given pages spread out (coming from Allâh with a writing that Islâm is the right religion, and Muhammad SAW has come with the truth from Allâh the Lord of the heavens and earth, etc.).", "Nay! But they fear not the Hereafter (from Allâh’s punishment).", "Nay, verily, this (Qur’ân) is an admonition,", "So whosoever will (let him read it), and receive admonition (from it)!", "And they will not receive admonition unless Allâh wills; He (Allâh) is the One, deserving that mankind should be afraid of, and should be dutiful to Him, and should not take any Ilâh (God) along with Him, and He is the One Who forgives (sins)."]}