{"name_ar": "سورة القيامة", "ayahs_ar": ["لَا أُقْسِمُ بِيَوْمِ الْقِيَامَةِ", "وَلَا أُقْسِمُ بِالنَّفْسِ اللَّوَّامَةِ", "أَيَحْسَبُ الْإِنسَانُ أَلَّن نَجْمَعَ عِظَامَهُ", "بَلَى قَادِرِينَ عَلَى أَن نُّسَوِّيَ بَنَانَهُ", "بَلْ يُرِيدُ الْإِنسَانُ لِيَفْجُرَ أَمَامَهُ", "يَسْأَلُ أَيَّانَ يَوْمُ الْقِيَامَةِ", "فَإِذَا بَرِقَ الْبَصَرُ", "وَخَسَفَ الْقَمَرُ", "وَجُمِعَ الشَّمْسُ وَالْقَمَرُ", "يَقُولُ الْإِنسَانُ يَوْمَئِذٍ أَيْنَ الْمَفَرُّ", "كَلَّا لَا وَزَرَ", "إِلَى رَبِّكَ يَوْمَئِذٍ الْمُسْتَقَرُّ", "يُنَبَّأُ الْإِنسَانُ يَوْمَئِذٍ بِمَا قَدَّمَ وَأَخَّرَ", "بَلِ الْإِنسَانُ عَلَى نَفْسِهِ بَصِيرَةٌ", "وَلَوْ أَلْقَى مَعَاذِيرَهُ", "لَا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ", "إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ", "فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ", "ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ", "كَلَّا بَلْ تُحِبُّونَ الْعَاجِلَةَ", "وَتَذَرُونَ الْآخِرَةَ", "وُجُوهٌ يَوْمَئِذٍ نَّاضِرَةٌ", "إِلَى رَبِّهَا نَاظِرَةٌ", "وَوُجُوهٌ يَوْمَئِذٍ بَاسِرَةٌ", "تَظُنُّ أَن يُفْعَلَ بِهَا فَاقِرَةٌ", "كَلَّا إِذَا بَلَغَتْ التَّرَاقِيَ", "وَقِيلَ مَنْ رَاقٍ", "وَظَنَّ أَنَّهُ الْفِرَاقُ", "وَالْتَفَّتِ السَّاقُ بِالسَّاقِ", "إِلَى رَبِّكَ يَوْمَئِذٍ الْمَسَاقُ", "فَلَا صَدَّقَ وَلَا صَلَّى", "وَلَكِن كَذَّبَ وَتَوَلَّى", "ثُمَّ ذَهَبَ إِلَى أَهْلِهِ يَتَمَطَّى", "أَوْلَى لَكَ فَأَوْلَى", "ثُمَّ أَوْلَى لَكَ فَأَوْلَى", "أَيَحْسَبُ الْإِنسَانُ أَن يُتْرَكَ سُدًى", "أَلَمْ يَكُ نُطْفَةً مِّن مَّنِيٍّ يُمْنَى", "ثُمَّ كَانَ عَلَقَةً فَخَلَقَ فَسَوَّى", "فَجَعَلَ مِنْهُ الزَّوْجَيْنِ الذَّكَرَ وَالْأُنثَى", "أَلَيْسَ ذَلِكَ بِقَادِرٍ عَلَى أَن يُحْيِيَ الْمَوْتَى"], "name_en": "Al-Qiyamah", "ayahs_en": ["I swear by the Day of Resurrection;", "And I swear by the self-reproaching person (a believer).", "Does man (a disbeliever) think that We shall not assemble his bones?", "Yes, We are Able to put together in perfect order the tips of his fingers.", "Nay! (Man denies Resurrection and Reckoning. So) he desires to continue committing sins.", "He asks: ”When will be this Day of Resurrection?”", "So, when the sight shall be dazed,", "And the moon will be eclipsed,", "And the sun and moon will be joined together (by going one into the other or folded up or deprived of their light, etc.)", "On that Day man will say: ”Where (is the refuge) to flee?”", "No! There is no refuge!", "Unto your Lord (Alone) will be the place of rest that Day.", "On that Day man will be informed of what he sent forward (of his evil or good deeds), and what he left behind (of his good or evil traditions).", "Nay! Man will be a witness against himself [as his body parts (skin, hands, legs, etc.) will speak about his deeds].", "Though he may put forth his excuses (to cover his evil deeds).", "Move not your tongue concerning (the Qur’ân, O Muhammad SAW) to make haste therewith.", "It is for Us to collect it and to give you (O Muhammad SAW) the ability to recite it (the Qur’ân),", "And when We have recited it to you [O Muhammad SAW through Jibrael (Gabriel)], then follow you its (the Qur’ân’s) recital.", "Then it is for Us (Allâh) to make it clear to you,", "Not [as you think, that you (mankind) will not be resurrected and recompensed for your deeds], but (you men) love the present life of this world,", "And leave (neglect) the Hereafter.", "Some faces that Day shall be Nâdirah (shining and radiant).", "Looking at their Lord (Allâh);", "And some faces, that Day, will be Bâsirah (dark, gloomy, frowning, and sad),", "Thinking that some calamity was about to fall on them;", "Nay, when (the soul) reaches to the collar bone (i.e. up to the throat in its exit),", "And it will be said: ”Who can cure him and save him from death?”", "And he (the dying person) will conclude that it was (the time) of departing (death);", "And leg will be joined with another leg (shrouded)", "The drive will be, on that Day, to your Lord (Allâh)!", "So he (the disbeliever) neither believed (in this Qur’ân, in the Message of Muhammad SAW) nor prayed!", "But on the contrary, he belied (this Qur’ân and the Message of Muhammad SAW) and turned away!", "Then he walked in full pride to his family admiring himself!", "Woe to you [O man (disbeliever)]! And then (again) woe to you!", "Again, woe to you [O man (disbeliever)]! And then (again) woe to you!", "Does man think that he will be left Suda [neglected without being punished or rewarded for the obligatory duties enjoined by his Lord (Allâh) on him]?", "Was he not a Nutfah (mixed male and female discharge of semen) poured forth?", "Then he became an ’Alaqa (a clot); then (Allâh) shaped and fashioned (him) in due proportion.", "And made him in two sexes, male and female.", "Is not He (Allâh Who does that), Able to give life to the dead? (Yes! He is Able to do all things)."]}