{"name_ar": "سورة الإنسان", "ayahs_ar": ["هَلْ أَتَى عَلَى الْإِنسَانِ حِينٌ مِّنَ الدَّهْرِ لَمْ يَكُن شَيْئًا مَّذْكُورًا", "إِنَّا خَلَقْنَا الْإِنسَانَ مِن نُّطْفَةٍ أَمْشَاجٍ نَّبْتَلِيهِ فَجَعَلْنَاهُ سَمِيعًا بَصِيرًا", "إِنَّا هَدَيْنَاهُ السَّبِيلَ إِمَّا شَاكِرًا وَإِمَّا كَفُورًا", "إِنَّا أَعْتَدْنَا لِلْكَافِرِينَ سَلَاسِلَا وَأَغْلَالًا وَسَعِيرًا", "إِنَّ الْأَبْرَارَ يَشْرَبُونَ مِن كَأْسٍ كَانَ مِزَاجُهَا كَافُورًا", "عَيْنًا يَشْرَبُ بِهَا عِبَادُ اللَّهِ يُفَجِّرُونَهَا تَفْجِيرًا", "يُوفُونَ بِالنَّذْرِ وَيَخَافُونَ يَوْمًا كَانَ شَرُّهُ مُسْتَطِيرًا", "وَيُطْعِمُونَ الطَّعَامَ عَلَى حُبِّهِ مِسْكِينًا وَيَتِيمًا وَأَسِيرًا", "إِنَّمَا نُطْعِمُكُمْ لِوَجْهِ اللَّهِ لَا نُرِيدُ مِنكُمْ جَزَاء وَلَا شُكُورًا", "إِنَّا نَخَافُ مِن رَّبِّنَا يَوْمًا عَبُوسًا قَمْطَرِيرًا", "فَوَقَاهُمُ اللَّهُ شَرَّ ذَلِكَ الْيَوْمِ وَلَقَّاهُمْ نَضْرَةً وَسُرُورًا", "وَجَزَاهُم بِمَا صَبَرُوا جَنَّةً وَحَرِيرًا", "مُتَّكِئِينَ فِيهَا عَلَى الْأَرَائِكِ لَا يَرَوْنَ فِيهَا شَمْسًا وَلَا زَمْهَرِيرًا", "وَدَانِيَةً عَلَيْهِمْ ظِلَالُهَا وَذُلِّلَتْ قُطُوفُهَا تَذْلِيلًا", "وَيُطَافُ عَلَيْهِم بِآنِيَةٍ مِّن فِضَّةٍ وَأَكْوَابٍ كَانَتْ قَوَارِيرَا", "قَوَارِيرَ مِن فِضَّةٍ قَدَّرُوهَا تَقْدِيرًا", "وَيُسْقَوْنَ فِيهَا كَأْسًا كَانَ مِزَاجُهَا زَنجَبِيلًا", "عَيْنًا فِيهَا تُسَمَّى سَلْسَبِيلًا", "وَيَطُوفُ عَلَيْهِمْ وِلْدَانٌ مُّخَلَّدُونَ إِذَا رَأَيْتَهُمْ حَسِبْتَهُمْ لُؤْلُؤًا مَّنثُورًا", "وَإِذَا رَأَيْتَ ثَمَّ رَأَيْتَ نَعِيمًا وَمُلْكًا كَبِيرًا", "عَالِيَهُمْ ثِيَابُ سُندُسٍ خُضْرٌ وَإِسْتَبْرَقٌ وَحُلُّوا أَسَاوِرَ مِن فِضَّةٍ وَسَقَاهُمْ رَبُّهُمْ شَرَابًا طَهُورًا", "إِنَّ هَذَا كَانَ لَكُمْ جَزَاء وَكَانَ سَعْيُكُم مَّشْكُورًا", "إِنَّا نَحْنُ نَزَّلْنَا عَلَيْكَ الْقُرْآنَ تَنزِيلًا", "فَاصْبِرْ لِحُكْمِ رَبِّكَ وَلَا تُطِعْ مِنْهُمْ آثِمًا أَوْ كَفُورًا", "وَاذْكُرِ اسْمَ رَبِّكَ بُكْرَةً وَأَصِيلًا", "وَمِنَ اللَّيْلِ فَاسْجُدْ لَهُ وَسَبِّحْهُ لَيْلًا طَوِيلًا", "إِنَّ هَؤُلَاء يُحِبُّونَ الْعَاجِلَةَ وَيَذَرُونَ وَرَاءهُمْ يَوْمًا ثَقِيلًا", "نَحْنُ خَلَقْنَاهُمْ وَشَدَدْنَا أَسْرَهُمْ وَإِذَا شِئْنَا بَدَّلْنَا أَمْثَالَهُمْ تَبْدِيلًا", "إِنَّ هَذِهِ تَذْكِرَةٌ فَمَن شَاء اتَّخَذَ إِلَى رَبِّهِ سَبِيلًا", "وَمَا تَشَاؤُونَ إِلَّا أَن يَشَاء اللَّهُ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا", "يُدْخِلُ مَن يَشَاء فِي رَحْمَتِهِ وَالظَّالِمِينَ أَعَدَّ لَهُمْ عَذَابًا أَلِيمًا"], "name_en": "Al-'Insan", "ayahs_en": ["Has there not been over man a period of time, when he was nothing to be mentioned?", "Verily, We have created man from Nutfah drops of mixed semen (discharge of man and woman), in order to try him, so We made him hearer, seer.", "Verily, We showed him the way, whether he be grateful or ungrateful.", "Verily, We have prepared for the disbelievers iron chains, iron collars, and a blazing Fire.", "Verily, the Abrâr (pious, who fear Allâh and avoid evil), shall drink a cup (of wine) mixed with water from a spring in Paradise called Kâfûr.", "A spring wherefrom the slaves of Allâh will drink, causing it to gush forth abundantly.", "They (are those who) fulfill (their) vows, and they fear a Day whose evil will be wide-spreading.", "And they give food, inspite of their love for it (or for the love of Him), to Miskin (poor), the orphan, and the captive,", "(Saying): ”We feed you seeking Allâh’s Countenance only. We wish for no reward, nor thanks from you.", "”Verily, We fear from our Lord a Day, hard and distressful, that will make the faces look horrible (from extreme dislikeness to it).”", "So Allâh saved them from the evil of that Day, and gave them Nadratan (a light of beauty) and joy.", "And their recompense shall be Paradise, and silken garments, because they were patient.", "Reclining therein on raised thrones, they will see there neither the excessive heat of the sun, nor the excessive bitter cold, (as in Paradise there is no sun and no moon).", "And the shade thereof is close upon them, and the bunches of fruit thereof will hang low within their reach.", "And amongst them will be passed round vessels of silver and cups of crystal,", "Crystal-clear, made of silver. They will determine the measure thereof according to their wishes.", "And they will be given to drink there a cup (of wine) mixed with Zanjabîl (ginger, etc.),", "A spring there, called Salsabîl.", "And round about them will (serve) boys of everlasting youth. If you see them, you would think them scattered pearls.", "And when you look there (in Paradise), you will see a delight (that cannot be imagined), and a great dominion.", "Their garments will be of fine green silk, and gold embroidery. They will be adorned with bracelets of silver, and their Lord will give them a pure drink.", "(And it will be said to them): ”Verily, this is a reward for you, and your endeavour has been accepted.”", "Verily! It is We Who have sent down the Qur’ân to you (O Muhammad SAW) by stages.", "Therefore be patient (O Muhammad SAW) and submit to the Command of your Lord (Allâh, by doing your duty to Him and by conveying His Message to mankind), and obey neither a sinner nor a disbeliever among them.", "And remember the Name of your Lord every morning and afternoon [i.e. offering of the Morning (Fajr), Zuhr, and ’Asr prayers].", "And during night, prostrate yourself to Him (i.e. the offering of Maghrib and ’Ishâ’ prayers), and glorify Him a long night through (i.e. Tahajjud prayer).", "Verily! These (disbelievers) love the present life of this world, and put behind them a heavy Day (that will be hard).", "It is We Who created them, and We have made them of strong built. And when We will, We can replace them with others like them with a complete replacement.", "Verily! This (Verses of the Qur’ân) is an admonition, so whosoever wills, let him take a Path to his Lord (Allâh).", "But you cannot will, unless Allâh wills. Verily, Allâh is Ever All-Knowing, All-Wise.", "He will admit to His Mercy whom He will and as for the Zâlimûn, (polytheists, wrong-doers, etc.) He has prepared a painful torment."]}