{"name_ar": "سورة النبأ", "ayahs_ar": ["عَمَّ يَتَسَاءلُونَ", "عَنِ النَّبَإِ الْعَظِيمِ", "الَّذِي هُمْ فِيهِ مُخْتَلِفُونَ", "كَلَّا سَيَعْلَمُونَ", "ثُمَّ كَلَّا سَيَعْلَمُونَ", "أَلَمْ نَجْعَلِ الْأَرْضَ مِهَادًا", "وَالْجِبَالَ أَوْتَادًا", "وَخَلَقْنَاكُمْ أَزْوَاجًا", "وَجَعَلْنَا نَوْمَكُمْ سُبَاتًا", "وَجَعَلْنَا اللَّيْلَ لِبَاسًا", "وَجَعَلْنَا النَّهَارَ مَعَاشًا", "وَبَنَيْنَا فَوْقَكُمْ سَبْعًا شِدَادًا", "وَجَعَلْنَا سِرَاجًا وَهَّاجًا", "وَأَنزَلْنَا مِنَ الْمُعْصِرَاتِ مَاء ثَجَّاجًا", "لِنُخْرِجَ بِهِ حَبًّا وَنَبَاتًا", "وَجَنَّاتٍ أَلْفَافًا", "إِنَّ يَوْمَ الْفَصْلِ كَانَ مِيقَاتًا", "يَوْمَ يُنفَخُ فِي الصُّورِ فَتَأْتُونَ أَفْوَاجًا", "وَفُتِحَتِ السَّمَاء فَكَانَتْ أَبْوَابًا", "وَسُيِّرَتِ الْجِبَالُ فَكَانَتْ سَرَابًا", "إِنَّ جَهَنَّمَ كَانَتْ مِرْصَادًا", "لِلْطَّاغِينَ مَآبًا", "لَابِثِينَ فِيهَا أَحْقَابًا", "لَّا يَذُوقُونَ فِيهَا بَرْدًا وَلَا شَرَابًا", "إِلَّا حَمِيمًا وَغَسَّاقًا", "جَزَاء وِفَاقًا", "إِنَّهُمْ كَانُوا لَا يَرْجُونَ حِسَابًا", "وَكَذَّبُوا بِآيَاتِنَا كِذَّابًا", "وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ كِتَابًا", "فَذُوقُوا فَلَن نَّزِيدَكُمْ إِلَّا عَذَابًا", "إِنَّ لِلْمُتَّقِينَ مَفَازًا", "حَدَائِقَ وَأَعْنَابًا", "وَكَوَاعِبَ أَتْرَابًا", "وَكَأْسًا دِهَاقًا", "لَّا يَسْمَعُونَ فِيهَا لَغْوًا وَلَا كِذَّابًا", "جَزَاء مِّن رَّبِّكَ عَطَاء حِسَابًا", "رَبِّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الرحْمَنِ لَا يَمْلِكُونَ مِنْهُ خِطَابًا", "يَوْمَ يَقُومُ الرُّوحُ وَالْمَلَائِكَةُ صَفًّا لَّا يَتَكَلَّمُونَ إِلَّا مَنْ أَذِنَ لَهُ الرحْمَنُ وَقَالَ صَوَابًا", "ذَلِكَ الْيَوْمُ الْحَقُّ فَمَن شَاء اتَّخَذَ إِلَى رَبِّهِ مَآبًا", "إِنَّا أَنذَرْنَاكُمْ عَذَابًا قَرِيبًا يَوْمَ يَنظُرُ الْمَرْءُ مَا قَدَّمَتْ يَدَاهُ وَيَقُولُ الْكَافِرُ يَا لَيْتَنِي كُنتُ تُرَابًا"], "name_en": "An-Naba'", "ayahs_en": ["What are they asking (one another)?", "About the great news, (i.e. Islâmic Monotheism, the Qur’ân, which Prophet Muhammad (Peace be upon him)brought and the Day of Resurrection, etc.),", "About which they are in disagreement.", "Nay, they will come to know!", "Nay, again, they will come to know!", "Have We not made the earth as a bed,", "And the mountains as pegs?", "And We have created you in pairs (male and female, tall and short, good and bad, etc.).", "And have made your sleep as a thing for rest.", "And have made the night as a covering (through its darkness),", "And have made the day for livelihood.", "And We have built above you seven strong (heavens),", "And have made (therein) a shinning lamp (sun).", "And have sent down from the rainy clouds abundant water.", "That We may produce therewith corn and vegetations,", "And gardens of thick growth.", "Verily, the Day of Decision is a fixed time,", "The Day when the Trumpet will be blown, and you shall come forth in crowds (groups);", "And the heaven shall be opened, and it will become as gates,", "And the mountains shall be moved away from their places and they will be as if they were a mirage.", "Truly, Hell is a place of ambush,", "A dwelling place for the Tâghûn (those who transgress the boundry limits set by Allâh like polytheists, disbelievers in the Oneness of Allâh, hyprocrites, sinners, criminals, etc.),", "They will abide therein for ages,", "Nothing cool shall they taste therein, nor any drink.", "Except boiling water, and dirty wound discharges.", "An exact recompense (according to their evil crimes).", "For verily, they used not to look for a reckoning.", "But they belied Our Ayât (proofs, evidences, verses, lessons, signs, revelations, and that which Our Prophet (Peace be upon him) brought) completely.", "And all things We have recorded in a Book.", "So taste you (the results of your evil actions); no increase shall We give you, except in torment.", "Verily, for the Muttaqûn, there will be a success (Paradise);", "Gardens and grapeyards;", "And young full-breasted (mature) maidens of equal age;", "And a full cup (of wine).", "No Laghw (dirty, false, evil talk) shall they hear therein, nor lying;", "A reward from your Lord, an ample calculated gift (according to the best of their good deeds).", "(From) the Lord of the heavens and the earth, and whatsoever is in between them, the Most Beneficent, none can dare to speak with Him (on the Day of Resurrection except after His Leave).", "The Day that Ar-Rûh [Jibrael (Gabriel) or another angel] and the angels will stand forth in rows, none shall speak except him whom the Most Beneficent (Allâh) allows, and he will speak what is right.", "That is without doubt the True Day, so, whosoever wills, let him seek a place with (or a way to) His Lord (by obeying Him in this worldly life)!", "Verily, We have warned you of a near torment, the Day when man will see that (the deeds) which his hands have sent forth, and the disbeliever will say: ”Woe to me! Would that I were dust!”"]}