{"name_ar": "سورة المطففين", "ayahs_ar": ["وَيْلٌ لِّلْمُطَفِّفِينَ", "الَّذِينَ إِذَا اكْتَالُواْ عَلَى النَّاسِ يَسْتَوْفُونَ", "وَإِذَا كَالُوهُمْ أَو وَّزَنُوهُمْ يُخْسِرُونَ", "أَلَا يَظُنُّ أُولَئِكَ أَنَّهُم مَّبْعُوثُونَ", "لِيَوْمٍ عَظِيمٍ", "يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ", "كَلَّا إِنَّ كِتَابَ الفُجَّارِ لَفِي سِجِّينٍ", "وَمَا أَدْرَاكَ مَا سِجِّينٌ", "كِتَابٌ مَّرْقُومٌ", "وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ", "الَّذِينَ يُكَذِّبُونَ بِيَوْمِ الدِّينِ", "وَمَا يُكَذِّبُ بِهِ إِلَّا كُلُّ مُعْتَدٍ أَثِيمٍ", "إِذَا تُتْلَى عَلَيْهِ آيَاتُنَا قَالَ أَسَاطِيرُ الْأَوَّلِينَ", "كَلَّا بَلْ رَانَ عَلَى قُلُوبِهِم مَّا كَانُوا يَكْسِبُونَ", "كَلَّا إِنَّهُمْ عَن رَّبِّهِمْ يَوْمَئِذٍ لَّمَحْجُوبُونَ", "ثُمَّ إِنَّهُمْ لَصَالُوا الْجَحِيمِ", "ثُمَّ يُقَالُ هَذَا الَّذِي كُنتُم بِهِ تُكَذِّبُونَ", "كَلَّا إِنَّ كِتَابَ الْأَبْرَارِ لَفِي عِلِّيِّينَ", "وَمَا أَدْرَاكَ مَا عِلِّيُّونَ", "كِتَابٌ مَّرْقُومٌ", "يَشْهَدُهُ الْمُقَرَّبُونَ", "إِنَّ الْأَبْرَارَ لَفِي نَعِيمٍ", "عَلَى الْأَرَائِكِ يَنظُرُونَ", "تَعْرِفُ فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ", "يُسْقَوْنَ مِن رَّحِيقٍ مَّخْتُومٍ", "خِتَامُهُ مِسْكٌ وَفِي ذَلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ", "وَمِزَاجُهُ مِن تَسْنِيمٍ", "عَيْنًا يَشْرَبُ بِهَا الْمُقَرَّبُونَ", "إِنَّ الَّذِينَ أَجْرَمُوا كَانُواْ مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ", "وَإِذَا مَرُّواْ بِهِمْ يَتَغَامَزُونَ", "وَإِذَا انقَلَبُواْ إِلَى أَهْلِهِمُ انقَلَبُواْ فَكِهِينَ", "وَإِذَا رَأَوْهُمْ قَالُوا إِنَّ هَؤُلَاء لَضَالُّونَ", "وَمَا أُرْسِلُوا عَلَيْهِمْ حَافِظِينَ", "فَالْيَوْمَ الَّذِينَ آمَنُواْ مِنَ الْكُفَّارِ يَضْحَكُونَ", "عَلَى الْأَرَائِكِ يَنظُرُونَ", "هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوا يَفْعَلُونَ"], "name_en": "Al-Mutaffifin", "ayahs_en": ["Woe to Al-Mutaffifin [those who give less in measure and weight (decrease the rights of others)],", "Those who, when they have to receive by measure from men, demand full measure,", "And when they have to give by measure or weight to men, give less than due.", "Think they not that they will be resurrected (for reckoning),", "On a Great Day,", "The Day when (all) mankind will stand before the Lord of the ’Alamîn (mankind, jinns and all that exists)?", "Nay! Truly, the Record (writing of the deeds) of the Fujjâr (disbelievers, sinners, evil-doers and wicked) is (preserved) in Sijjîn.", "And what will make you know what Sijjîn is?", "A Register inscribed.", "Woe, that Day, to those who deny [(Allâh, His Angels, His Books, His Messengers, the Day of Resurrection, and Al-Qadar (Divine Preordainments)].", "Those who deny the Day of Recompense.", "And none can deny it except every transgressor beyond bounds, (in disbelief, oppression and disobedience of Allâh, the sinner!)", "When Our Verses (of the Qur’ân) are recited to him he says: ”Tales of the ancients!”", "Nay! But on their hearts is the Rân (covering of sins and evil deeds) which they used to earn .", "Nay! Surely, they (evil-doers) will be veiled from seeing their Lord that Day.", "Then, verily they will indeed enter and taste the burning flame of Hell.", "Then, it will be said to them: ”This is what you used to deny!”", "Nay! Verily, the Record (writing of the deeds) of Al-Abrâr (the pious who fear Allâh and avoid evil), is (preserved) in ’Illiyyûn.", "And what will make you know what ’Illiyyûn is?", "A Register inscribed.", "To which bear witness those nearest (to Allâh, i.e. the angels).", "Verily, Al-Abrâr (the pious who fear Allâh and avoid evil) will be in delight (Paradise).", "On thrones, looking (at all things).", "You will recognise in their faces the brightness of delight.", "They will be given to drink pure sealed wine.", "The last thereof (that wine) will be the smell of musk, and for this let (all) those strive who want to strive (i.e. hasten earnestly to the obedience of Allâh).", "It (that wine) will be mixed with Tasnîm.", "A spring whereof drink those nearest to Allâh.", "Verily! (During the worldly life) those who committed crimes used to laugh at those who believed.", "And whenever they passed by them, used to wink one to another (in mockery);", "And when they returned to their own people, they would return jesting;", "And when they saw them, they said: ”Verily! These have indeed gone astray!”", "But they (disbelievers, sinners) had not been sent as watchers over them (the believers).", "But this Day (the Day of Resurrection) those who believe will laugh at the disbelievers", "On (high) thrones, looking (at all things).", "Are not the disbelievers paid (fully) for what they used to do?"]}