{"name_ar": "سورة الفجر", "ayahs_ar": ["وَالْفَجْرِ", "وَلَيَالٍ عَشْرٍ", "وَالشَّفْعِ وَالْوَتْرِ", "وَاللَّيْلِ إِذَا يَسْرِ", "هَلْ فِي ذَلِكَ قَسَمٌ لِّذِي حِجْرٍ", "أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِعَادٍ", "إِرَمَ ذَاتِ الْعِمَادِ", "الَّتِي لَمْ يُخْلَقْ مِثْلُهَا فِي الْبِلَادِ", "وَثَمُودَ الَّذِينَ جَابُوا الصَّخْرَ بِالْوَادِ", "وَفِرْعَوْنَ ذِي الْأَوْتَادِ", "الَّذِينَ طَغَوْا فِي الْبِلَادِ", "فَأَكْثَرُوا فِيهَا الْفَسَادَ", "فَصَبَّ عَلَيْهِمْ رَبُّكَ سَوْطَ عَذَابٍ", "إِنَّ رَبَّكَ لَبِالْمِرْصَادِ", "فَأَمَّا الْإِنسَانُ إِذَا مَا ابْتَلَاهُ رَبُّهُ فَأَكْرَمَهُ وَنَعَّمَهُ فَيَقُولُ رَبِّي أَكْرَمَنِ", "وَأَمَّا إِذَا مَا ابْتَلَاهُ فَقَدَرَ عَلَيْهِ رِزْقَهُ فَيَقُولُ رَبِّي أَهَانَنِ", "كَلَّا بَل لَّا تُكْرِمُونَ الْيَتِيمَ", "وَلَا تَحَاضُّونَ عَلَى طَعَامِ الْمِسْكِينِ", "وَتَأْكُلُونَ التُّرَاثَ أَكْلًا لَّمًّا", "وَتُحِبُّونَ الْمَالَ حُبًّا جَمًّا", "كَلَّا إِذَا دُكَّتِ الْأَرْضُ دَكًّا دَكًّا", "وَجَاء رَبُّكَ وَالْمَلَكُ صَفًّا صَفًّا", "وَجِيءَ يَوْمَئِذٍ بِجَهَنَّمَ يَوْمَئِذٍ يَتَذَكَّرُ الْإِنسَانُ وَأَنَّى لَهُ الذِّكْرَى", "يَقُولُ يَا لَيْتَنِي قَدَّمْتُ لِحَيَاتِي", "فَيَوْمَئِذٍ لَّا يُعَذِّبُ عَذَابَهُ أَحَدٌ", "وَلَا يُوثِقُ وَثَاقَهُ أَحَدٌ", "يَا أَيَّتُهَا النَّفْسُ الْمُطْمَئِنَّةُ", "ارْجِعِي إِلَى رَبِّكِ رَاضِيَةً مَّرْضِيَّةً", "فَادْخُلِي فِي عِبَادِي", "وَادْخُلِي جَنَّتِي"], "name_en": "Al-Fajr", "ayahs_en": ["By the dawn;", "By the ten nights (i.e. the first ten days of the month of Dhul-Hîjjah) ,", "And by the even and the odd (of all the creations of Allâh) .", "And by the night when it departs.", "There is indeed in them (the above oaths) sufficient proofs for men of understanding (and that, they should avoid all kinds of sins and disbeliefs, etc.)!", "Did you (O Muhammad (Peace be upon him) not see (thought) how your Lord dealt with ’Ad (people)?", "Who were very tall like lofty pillars,", "The like of which were not created in the land?", "And (with) Thamûd (people), who cut (hewed) out rocks in the valley (to make dwellings)?", "And (with) Fir’aun (Pharaoh), who had pegs (who used to torture men by binding them to pegs)?", "Who did transgress beyond bounds in the lands (in the disobedience of Allâh).", "And made therein much mischief.", "So your Lord poured on them different kinds of severe torment.", "Verily, your Lord is Ever Watchful (over them).", "As for man, when his Lord tries him by giving him honour and gifts, then he says (puffed up): ”My Lord has honoured me.”", "But when He tries him, by straitening his means of life, he says: ”My Lord has humiliated me!”", "Nay! But you treat not the orphans with kindness and generosity (i.e. you neither treat them well, nor give them their exact right of inheritance)!", "And urge not on the feeding of AlMiskîn (the poor)!", "And you devour inheritance all with greed,", "And you love wealth with much love!", "Nay! When the earth is ground to powder,", "And your Lord comes with the angels in rows,", "And Hell will be brought near that Day. On that Day will man remember, but how will that remembrance (then) avail him?", "He will say: ”Alas! Would that I had sent forth (good deeds) for (this) my life!”", "So on that Day, none will punish as He will punish.", "And none will bind as He will bind.", "(It will be said to the pious): ”O (you) the one in (complete) rest and satisfaction!", "”Come back to your Lord, Well-pleased (yourself) and well-pleasing unto Him!", "”Enter you, then, among My honoured slaves,", "”And enter you My Paradise!”"]}