{"name_ar": "سورة البينة", "ayahs_ar": ["لَمْ يَكُنِ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ مُنفَكِّينَ حَتَّى تَأْتِيَهُمُ الْبَيِّنَةُ", "رَسُولٌ مِّنَ اللَّهِ يَتْلُو صُحُفًا مُّطَهَّرَةً", "فِيهَا كُتُبٌ قَيِّمَةٌ", "وَمَا تَفَرَّقَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِن بَعْدِ مَا جَاءتْهُمُ الْبَيِّنَةُ", "وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاء وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ وَذَلِكَ دِينُ الْقَيِّمَةِ", "إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَا أُوْلَئِكَ هُمْ شَرُّ الْبَرِيَّةِ", "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُوْلَئِكَ هُمْ خَيْرُ الْبَرِيَّةِ", "جَزَاؤُهُمْ عِندَ رَبِّهِمْ جَنَّاتُ عَدْنٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا رَّضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ذَلِكَ لِمَنْ خَشِيَ رَبَّهُ"], "name_en": "Al-Bayyinah", "ayahs_en": ["Those who disbelieve from among the people of the Scripture (Jews and Christians) and among Al-Mushrikûn, were not going to leave (their disbelief) until there came to them clear evidence.", "A Messenger (Muhammad (Peace be upon him) from Allâh, reciting (the Qur’ân) purified pages [purified from Al-Bâtil (falsehood, etc.)].", "Containing correct and straight laws from Allâh.", "And the people of the Scripture (Jews and Christians) differed not until after there came to them clear evidence. (i.e. Prophet Muhammad (Peace be upon him) and whatever was revealed to him).", "And they were commanded not, but that they should worship Allâh, and worship none but Him Alone (abstaining from ascribing partners to Him), and perform As-Salât (Iqâmat-as-Salât) and give Zakât: and that is the right religion.", "Verily, those who disbelieve (in the religion of Islâm, the Qur’ân and Prophet Muhammad (Peace be upon him) from among the people of the Scripture (Jews and Christians) and Al-Mushrikûn will abide in the Fire of Hell. They are the worst of creatures.", "Verily, those who believe [in the Oneness of Allâh, and in His Messenger Muhammad (Peace be upon him) including all obligations ordered by Islâm] and do righteous good deeds, they are the best of creatures.", "Their reward with their Lord is ’Adn (Eden) Paradise (Gardens of Eternity), underneath which rivers flow, they will abide therein forever, Allâh Well-Pleased with them, and they with Him. That is for him who fears his Lord."]}